#!/bin/sh

echo "د العزيز آل سعود (15 ذو الحجة 1405 هـ / 31 أغسطس 1985م)؛ ولي عهد السعودية، ورئيس مجلس الوزراء/n/r يرأس مجلس الشؤون السياسية والأمنية ومجلس الشؤون الاقتصادية والتنمية/n/r هو نجل الملك سلمان بن عبد العزيز آل سعود من فهدة بنت فلاح آل حثلين/n/r

حاصل على درجة البكالوريوس في القانون من جامعة الملك سعود/n/r كان قد شغل منصب رئيس الديوان الملكي السعودي عند تولي والده الحكم في يناير 2015 وحتى أبريل 2015/n/r في 29 أبريل 2015، صدر أمر ملكي نص على اختياره وليًا لولي العهد، وتعيينه نائبًا ثانيًا لرئيس مجلس الوزراء السعودي/n/r أُختير بمنصب ولي العهد في يونيو 2017، بعد إقرار هيئة البيعة السعودية بإعفاء ابن عمه ولي العهد وزير الداخلية محمد بن نايف بن عبد العزيز آل سعود/n/r

أظهر محمد بن سلمان توجّهات انفتاحية ومختلفة عمَّن سبقه من قيادات السعودية، فشهدت البلاد خلال فترة ولاية عهده السماحَ للمرأة السعودية بقيادة السيارة ودخولِ الملاعبِ الرياضية وتفعيلِ هيئة الترفيه، وتحدّث بصراحة عن توجّه السعودية لمكافحة ما يسميه التشدّد الديني داخل الدولة - الذي يعرف محليًا بالصحوة - ووصفه بالدخيل على المجتمع السعودي/n/r أطلق خطة رؤية السعودية 2030، التي تهدف إلى جعل الاقتصاد السعودي يرتكز على الاستثمار، بالإضافة إلى عدم اعتماده على النفط كدخل أساسي ووحيد، إذ وعد بإنهاء علاقة ارتهان الدولة السعودية بالنفط والتي وصفها بـ«الإدمان»/n/r قاد الحَربَ على الحوثيين في اليمن،  وعارض الاتفاق النووي الإيراني وهدّد بتطوير السعودية قنبلة نووية فيما لو أنتجت إيران سلاحًا نوويًا/n/r وصفته مجلة ذي إيكونوميست بأنّه القوي وراء عرش والده الملك سلمان بن عبد العزيز آل سعود/n/r

أشارت تقارير حقوقية، أن ولي العهد السعودي، رغم الإصلاحات الاقتصادية والاجتماعية التي أجراها ورغم انتهاجه نهجًا جديدًا في السعودية، وُصِفَ بالتحرري والذي قوبل بالثناء دوليًا، إلا أنّه لم يوقف الاعتقالات الأمنية التي طالت عددًا من الدعاة والناشطين، وكانت حملته ضد الفساد التي اعتُقِل على أثرها عدد من أفراد العائلة المالكة مثار جدل، وكذلك كانت السياسة الخارجية السعودية، حيث وجهت الخارجية الإيرانية والتركية والقطرية انتقادات حادّة للسعودية بسبب السياسات التي تبنّاها محمد بن سلمان في ملف اليمن والعراق ولبنان وفي ملف مواجهة تيارات الإسلام السياسي داخل السعودية وعلى رأسها جماعة الإخوان المسلمين، التي أدّت إلى نشوب الأزمة الدبلوماسية مع قطر/n/r

في 2017، أختير عبر مجلة تايم الأمريكية كشخصية العام باختيار القراء/n/r كذلك اختارته المجلة الأميركية فورين بوليسي من ضمن القادة الأكثر تأثيرًا في العالم ضمن قائمتها السنوية لأهم مائة مفكِّر في العالم لعام 2015/n/r وفي عام 2018، قامت مجلة فوربس باختياره ضمن قائمة فوربس لأكثر الشخصيات تأثيرًا في العالم/n/r

نسبه
المقالات الرئيسة: آل سعود ومحمد بن سعود
هو محمد بن الملك سلمان بن الملك عبد العزيز بن الإمام عبد الرحمن بن الإمام فيصل بن الإمام تركي بن عبد الله بن الإمام محمد بن الأمير سعود الأوّل/n/r وسعود هو أمير الدرعية وإليه يَنتسبُ جميع أئمة وأمراء وملوك السعودية منذ القرن الثامن العشر، وباسمهِ تسمَّت الأسرة الحاكمة فيها/n/r

الولادة والنشأة والتعليم
المقالات الرئيسة: الرياض وجامعة الملك سعود
وُلِدَ محمد في مدينة الرياض في يوم السبت 15 ذو الحجة 1405 هـ الموافق 31 أغسطس 1985، وهو الابن السادس للملك سلمان بن عبد العزيز، والدته هي الأميرة فهدة بنت فلاح آل حثلين/n/r تَلقَّى تعليمه العام في مدارس الرياض، وأنهى دراسته الثانوية في العام 2003، ضمن العشرة الأوائل على مستوى المملكة/n/r أكمل خلال فترة تعليمه عددًا من الدورات والبرامج المتخصّصة، وحصل على درجة البكالوريوس في القانون من جامعة الملك سعود، حائزًا على الترتيب الثاني على دفعته/n/r

العمل السياسي
كانت بداية محمد بن سلمان في النشاط السياسي حين عُيّن مستشارًا متفرغًا في هيئة الخبراء بمجلس الوزراء السعودي في 10 أبريل 2007، واستمر في عمله بنفس المنصب، حتى عُيّن في إمارة منطقة الرياض مستشارًا خاصاً لوالده أمير الرياض في ذلك الوقت في 16 ديسمبر 2009، وتحوّل منصبه بالهيئة إلى منصب مستشار غير متفرغ/n/r وحين وُلِّيَ والده سلمان بن عبد العزيز ولاية العهد في المملكة العربية السعودية في 2012، أصبح محمد مستشارًا خاصًا ومشرفًا على المكتب والشؤون الخاصة لوالده ولي العهد نائب رئيس مجلس الوزراء وزير الدفاع/n/r

استمر عمله أثناء ذلك في منصبه مستشارًا غير متفرغ في هيئة الخبراء حتى 3 مارس 2013، حيث صدر أمرٌ ملكي بتعيينه رئيسًا لديوان سمو ولي العهد ومستشارًا خاصًا له بمرتبة وزير، وبعدها بأربعة أشهر، أضيف منصب المشرف العام على مكتب وزير الدفاع إلى مهام عمله السابقة/n/r وكانت آخر ترقياته قبل تولي والده الحكم في 25 أبريل 2014 عند صدور الأمر الملكي بتعيينه وزيرًا للدولة عضوًا في مجلس الوزراء السعودي بالإضافة إلى عمله/n/r

حين تولّى الملك سلمان بن عبد العزيز الحكم في المملكة العربية السعودية في 23 يناير 2015، أصدر أمرًا ملكيًا يقضي بتولّي محمد بن سلمان وزارة الدفاع بالإضافة إلى تعيينه رئيسًا للديوان الملكي ومستشارًا خاصًا للملك، ثم أتبعه بأمر ملكي آخر يقضي بإنشاء مجلس الشؤون الاقتصادية والتنمية برئاسة محمد بن سلمان/n/r

وزارة الدفاع
المقالة الرئيسة: وزارة الدفاع (السعودية)
جاء تعيين محمد بن سلمان مشرفًا على مكتب وزير الدفاع في 13 يوليو 2013، وتكليفه بإصلاح وزارة الدفاع، في مرحلة كانت الوزارة تعاني فيها من مشاكل كبيرة، قال عنها محمد بن سلمان: «بأنها مشاكل استعصى إيجاد حلول لها على مدى سنين»، ولمعالجة ذلك، غيّر محمد إجراءات شراء الأسلحة وإجراءات التعاقد ونُظم استخدام وإدارة تكنولوجيا المعلومات والموارد البشرية، كما انتدب مجموعة شركات استشارية عالمية، من بينها: شركة بوز ألن هاملتون (بالإنجليزية: Booz Allen Hamilton)‏ وشركة ماكنزي الاستشارية، لوضع خطط لتحديث وتنظيم الوزارة، كما أعاد تفعيل دائرة الشؤون القانونية وتعزيز وجودها في الوزارة بعد أن كانت «مُهمَّشة» قبل وصوله، فأعاد عشرات العقود لدراستها والنظر فيها، كما أنشأ مكتبًا لتحليل صفقات الأسلحة والتأكد من سلامتها بعد اكتشافه عمليات شراء أسلحة لم تُعرض لفحص الجودة كما هو مطلوب وصُوّرت للقيادة بشكل خاطئ، إضافة إلى عدم وجود هدف واضح من امتلاكها وهو الأمر الذي جعل الوزارة ساحة لإبرام عقود سيئة و«مصدرٍ كبيرٍ للفساد» على حد وصف فهد العيسى مدير عام مكتب وزير الدفاع السعودي، الذي وصف وضع الوزارة آنذاك بقوله: «نحن (أي السعودية) رابع أكبر منفق عسكري في العالم، ولكن عندما يتعلق الأمر بنوعية أسلحتنا، لا نكاد نكون من ضمن أفضل 20 دولة/n/r»

في 23 يناير 2015، بات محمد بن سلمان سابع وزير دفاع في تاريخ السعودية، إثر الأمر الملكي الصادر من الملك سلمان بن عبد العزيز الذي عيّن بموجبه محمد وزيرًا للدفاع، ليُصبح ابن سلمان بذلك التاريخ رئيسًا لمجلس إدارة المؤسسة العامة للصناعات العسكرية، بصفته وزيرًا للدفاع/n/r

في 25 أبريل 2016، حدّد ابن سلمان لوزارة الدفاع خمسة أهداف إستراتيجية تنفيذًا لرؤية السعودية 2030، وهي: تحقيق التفوق والتميز العملياتي المشترك، تطوير الأداء التنظيمي، تطوير الأداء الفردي ورفع المعنويات، تحسين كفاءة الإنفاق ودعم توطين التصنيع العسكري، وتحديث المعدات والأسلحة/n/r

استمر محمد بن سلمان وزيرًا للدفاع حتى 27 سبتمبر 2022، حيث أصدر الملك سلمان أمرًا ملكيًا بإعادة تشكيل مجلس الوزراء قضى فيه بأن يكون الأمير محمد بن سلمان ولي العهد رئيسًا لمجلس الوزراء/n/r

توطين الصناعات العسكرية
المقالات الرئيسة: توطين الصناعات العسكرية في السعودية والهيئة العامة للصناعات العسكرية والشركة السعودية للصناعات العسكرية

وزير الدفاع الأمريكي آشتون كارتر بجانب محمد بن سلمان أمام مدخل مبنى البنتاغون في 13 مايو 2015/n/r
بدأ محمد بن سلمان في عام 2016، بوضع الأسس لبرنامج حكومي توطين الصناعات العسكرية في السعودية، يستهدفُ من خلاله توطين 50% من الإنفاق العسكري السعودي/n/r وفي نوفمبر 2016، أُعلِنَ عن لقاءاتٍ جرت بين محمد بن سلمان ورؤساء كل من شركة ريثيون الأميركية، إضافة إلى شركتي داسو وتاليس الفرنسيتين، تباحث فيها معهم حول توطين الصناعات العسكرية في السعودية، كما التقى في فبراير 2017، السيدة «مارلين هيوسن» الرئيس التنفيذي لشركة لوكهيد مارتن/n/r

بعد أشهر من ذلك، أُعِلن عن تأسيس الشركة السعودية للصناعات العسكرية في 17 مايو 2017، وكشف محمد بن سلمان بمناسبة ذلك عن أن: «الإنفاق العسكري الداخلي السعودي لا يتجاوز نسبة 2% من مجموع الإنفاق الحكومي السعودي»، مع أن «المملكة العربية السعودية تعتبر من أكبر خمس دول إنفاقًا على الأمن والدفاع على مستوى العالم»، رادًا هذه المؤشرات إلى «الفساد»، بحسب تعبيره، موضحًا أن أهداف الشركة السعودية للصناعات العسكرية أن تكون محفزًا أساسيًا للتحول في قطاع الصناعات العسكرية السعودية وداعمًا لنمو القطاع ليُصبح قادرًا على توطين نسبة 50% من إجمالي الإنفاق الحكومي العسكري في المملكة بحلول العام 2030، وذلك عبر زيادة الصناعات العسكرية المحلية وزيادة الصادرات، وجلب استثمارات أجنبية إلى السعودية عن طريق الدخول في مشروعات مشتركة مع كبريات شركات الصناعة العسكرية العالمية، وتحريك عجلة الاقتصاد المحلي من خلال زيادة الطلب على المنتجات المحلية من المكونات الأولية والمواد الخام كالحديد والألمونيوم، والخدمات اللوجستية وخدمات التدريب/n/r تلا ذلك بثلاثة أشهر إنشاء الهيئة العامة للصناعات العسكرية التي تهدف لتنظيم قطاع الصناعات العسكرية في السعودية وتطويره ومراقبة أدائه وإدارة عمليات المشتريات العسكرية والبحث والتطوير، إصدار تراخيص التصنيع والتصدير والتفاوض مع الجهات والشركات العالمية لتوطين التقنيات العسكرية/n/r

في عام 2018، كشفت تقارير دولية أن حجم الإنفاق العسكري السعودي اقترب من حاجز سبعين مليار دولار في العام 2017، لتصبح في المركز الثالث بعد الولايات المتحدة والصين، متقدمةً على روسيا الاتحادية/n/r صاحب ذلك الإعلان زيارة لمحمد بن سلمان إلى سياتل الأمريكية في مارس 2018، حيث وقّعت «الشركة السعودية للصناعات العسكرية» اتفاقًا مع شركة بوينغ، لتوطين 55% من عمليات «الصيانة والإصلاح وعمرة الطائرات الحربية ذات الأجنحة الثابتة والطائرات العمودية» في المملكة العربية السعودية، إضافة إلى «نقل تقنية دمج الأسلحة على تلك الطائرات وتوطين سلسلة الإمداد لقطع الغيار»، ونشرت تقارير عن توقيع الشركة السعودية للصناعات العسكرية أربع مذكرات تفاهم أخرى مع كل من شركة «تقنية» للطيران باستثمار تجاوز ستة مليارات دولار، إلى جانب الشركات الأمريكية رايثيون، لوكهيد مارتن وجنرال ديناميكس باستثمارات بنحو 12/n/r494 مليار دولار، ليبلغ إجمالي العقود المبرمة 18/n/r5 مليار دولار/n/r

وكانت الشركة السعودية للصناعات العسكرية قد أبرمت بتوجيهات محمد بن سلمان 18 اتفاقية إستراتيجية حتى ديسمبر 2018 مع شركات عالمية ومحلية كبرى في مجالات التقنية، الدفاع، الأمن، البحث والتطوير، وتضمنت الاتفاقيات مذكرات اتفاق وتفاهم وتعاون مع كلٍّ من: بوينغ، لوكهيد مارتن، باراماونت، هينسولت، إل3 تكنولوجيز، بي إيه إي سيستمز، إيرباص، إم بي دي إيه، ليوناردو، إليترونيكا الإيطالية ومدينة الملك عبدالعزيز للعلوم والتقنية ومركز الأمير سلطان للدراسات والبحوث الدفاعية/n/r

وعلى هامش إطلاق محمد بن سلمان برنامج تطوير الصناعة الوطنية والخدمات اللوجستية في 28 يناير 2019، الذي ينفذ أكثر من 300 مبادرة، ويعمل على تطوير 11 صناعة منها صناعة السيارات والصناعات العسكرية، وقَّعت الشركة السعودية للصناعات العسكرية برعايتهِ على عقدي تأسيس كيانين تجاريين بنظام المشروع المشترك مع كل من شركة تاليس الفرنسية وشركة «سي إم آي للدفاع» البلجيكية (بالإنجليزية: CMI Defense)‏، ويشمل المشروع المشترك مع شركة «تاليس» مجالات عدة؛ أبرزها توطين صنع وإنتاج: رادارات الدفاع الجوي قصير المدى والصواريخ المضادة، أنظمة القيادة والتحكم (C2)، الصواريخ متعددة المهام، صواعق القنابل الموجهة، أنظمة الاتصال البيني، وكذلك الاستثمار في المرافق والمعدات داخل السوق المحلية بنسبة توطينٍ تصل إلى 70%/n/r

كذلك وقعت الشركة في 17 فبراير 2019، خلال معرض الدفاع الدولي في دورته لذلك العام، اتفاقًا مع مجموعة نافال الفرنسية لإنشاء شركة سعودية في مجال الدفاع البحري السعودي، إضافة إلى توقيع اتفاق آخر في نفس المعرض مع شركة إل3 تكنولوجيز الأمريكية لتطوير مشاريع تقنيات الأشعة الكهروضوئية والأشعة تحت الحمراء وأنظمة المهام الخاصة داخل السعودية/n/r

ولاية العهد
المقالات الرئيسة: ولاية العهد السعودية وهيئة البيعة
مع إعفاء الأمير مقرن بن عبد العزيز آل سعود من منصب ولي العهد بناء على طلبه في 29 أبريل 2015، واختيار الأمير محمد بن نايف بن عبد العزيز آل سعود وليًا للعهد، صدر أمر ملكي ينص على اختيار محمد بن سلمان وليًا لولي العهد وتعيينه نائبًا ثانيًا لرئيس مجلس الوزراء مع استمراره في منصب وزير الدفاع ورئيس مجلس الشؤون الاقتصادية والتنمية/n/r وقد تزايدت النشاطات السياسية لمحمد بن سلمان بعد توليه منصب ولي ولي العهد، حيث شارك في عدد من المؤتمرات السياسية والزيارات الدبلوماسية الخارجية/n/r

في 21 يونيو 2017، أصدر الملك سلمان بن عبد العزيز أمرًا ملكيّا - بعد إعفاء الأمير محمد بن نايف من منصبه – يقضي باختيار محمد بن سلمان وليًا للعهد وتعيينه نائبًا لرئيس مجلس الوزراء مع استمراره وزيرًا للدفاع/n/r كما أصبح يرأس مجلسي الشؤون الاقتصادية والتنمية والشؤون السياسية والأمنية، وقد أقيمت مراسم البيعة في قصر الصفا في مكة المكرمة، حيث بويع من قبل السعوديين/n/r وكان محمد بن سلمان قد اختير لولاية العهد بأغلبية أعضاء هيئة البيعة، بعد أن عُرِضَ القرار عليهم، بأن نال 31 صوتًا من أصل 34 صوتًا، وهي أعلى نسبة تصويت تشهدها هيئة البيعة منذ إنشائها/n/r

رئاسة مجلس الوزراء
المقالة الرئيسة: مجلس الوزراء السعودي
في 27 سبتمبر 2022، أصدر الملك سلمان بن عبد العزيز أمرًا ملكيّا يقضي بأن يكون الأمير محمد بن سلمان ولي العهد رئيسًا لمجلس الوزراء، في استثناء من حكم المادة السادسة والخمسين من النظام الأساسي للحكم، ومن الأحكام ذات الصلة الواردة في نظام مجلس الوزراء، ونصت المادة الثانية من الأمر الملكي على أن تكون جلسات مجلس الوزراء التي يحضرها الملك سلمان بن عبد العزيز برئاستهِ/n/r

الرؤية السياسية
يرى عددٌ من الباحثين في الشأن السعودي أن ابن سلمان لديه نفوذ قوي ومتزايد في القرارات السيادية في المملكة العربية السعودية، كون والده هو الملك؛ فتحدثت تقارير مختلفة عن التغييرات الجذرية التي بدأت بالظهور على الدولة السعودية فور ظهور محمد على الساحة السياسية، وعزت هذه التقارير قرارات الإصلاح الاقتصادي والاجتماعي التي اتخذتها الحكومة في العام 2016 - بما فيها سحب سلطة الضبط الجنائي من الشرطة الدينية بالمملكة والعمل على تنويع مصادر الدخل وتقليل الفجوة بين الواردات والمصروفات بتقليل العجز في الميزانية - إلى محمد بن سلمان وذكرت أنه هو من كان يقف وراءها/n/r يقول مراقبون إن هذه القرارات التي صدرت إبّان تولّيه منصب ولي ولي العهد، واستمرت بعد أن تولّى ولاية العهد، يُراد بها أن تحدث تحوّلا جذريًا في المملكة العربية السعودية/n/r فهو يريد أن يحوّل اقتصاد المملكة العربية السعودية القائم على الاعتماد على النفط كمصدر دخل رئيسي ووحيد للدولة، إلى اقتصاد متنوّع ومتعدّد المجالات، حيث، من جهة يحفظ للسعودية بقاءها كمصدر رئيس للطاقة في «عالم ما بعد النفط»، ومن جهة أخرى يجعل السعودية في مأمن من «تقلبات أسعار النفط»، بذلك يحافظ على استمرار دعم مشاريع الدولة التنموية حتى إنجازها، والتي يستهدف بها تحويل السعودية إلى وجهة اقتصادية وسياحية عالمية/n/r

وكان محمد بن سلمان قد وعد بإنهاء علاقة ارتهان الدولة السعودية بالنفط والتي وصفها بـ«الإدمان»/n/r ويرى ابن سلمان أن السعودية لم تستغل إلا 10% من قدراتها وإمكاناتها الطبيعية والاقتصادية/n/r وتعليقًا على المشاريع الاقتصادية والتنموية الكبرى التي أطلقها، والتي شبهت بعض وسائل الإعلام، جزءا منها بتلك التي أُقيمت في المنطقة الجنوبية من منطقة خليج سان فرانسيسكو في كاليفورنيا، صرّح لمجلة تايم قائلًا: «إننا نرسم خطتنا بناءً على مكامن القوة لدينا/n/r فلا نريد أن نقلد غيرنا، ولا نريد أن نبني وادي السيلكون»/n/r ويهدف محمد بن سلمان إلى جعل صندوق الاستثمارات العامة أكبر صندوق ثروة سيادية على مستوى العالم وأكثرها تأثيرًا، بقيمة تتجاوز تريليوني دولار أمريكي، وذلك بحلول العام 2030/n/r وقد ترأس محمد بن سلمان «صندوق الاستثمارات العامة» في 23 مارس عام 2015، حيث قام بمراجعة استراتيجيته الاستثمارية لدعم التنوع بعيدا عن النفط/n/r وتشير التقارير أن قيمة الصندوق الذي أنشئ في العام 1971، كانت بحدود 5/n/r3 مليار دولار في أبريل من العام 2016، وبعد عدد من الاستثمارات التي قام بها محمد بن سلمان، قفزت أصول الصندوق في أكتوبر 2016، إلى مائة وستين مليار دولار/n/r لتصل أصول الصندوق في نهاية 2020م إلى أكثر من 399 مليار دولار/n/r

الإصلاحات الداخلية
إصلاحات اجتماعية
حقوق المرأة السعودية
المقالة الرئيسة: حقوق المرأة في السعودية
أخذت توجهات محمد بن سلمان الإصلاحية بشأن تمكين المرأة السعودية تتمثّل بصورة سريعة ما إن أصبح وريثًا واضحًا للحكم في السعودية، وكانت أولى تلك الإشارات ما نُشِر في حوار مطوّل له أجري في 16 أبريل 2016، مع مجلة بلومبرغ الاقتصادية، حين قال: «نحن نؤمن أن لدى النساء حقوقًا في الإسلام لم يحصلن عليها بعد/n/r» في حين كانت أكثر تلك الإشارات بروزًا حين عرض بعدها بأيام في 25 أبريل 2016، رؤيتهِ للسعودية في عام 2030، وهي الرؤية التي كفلت المساواة بين جميع المواطنين من كلا الجنسين، وأصبحت تُعرف باسم رؤية السعودية 2030، إذ أشار بوضوح إلى أنه لا يمكن للمملكة العربية السعودية أن تزدهر في ظل الحد من حقوق نصف المجتمع، في إشارة منه إلى الحقوق المسلوبة من المرأة السعودية/n/r

دفعت رؤية محمد بن سلمان إلى تسارع وتيرة الإصلاح الاجتماعي، وكان من أهم تلك الإصلاحات رفع الحظر عن قيادة المرأة للسيارة وزيادة نسبة مشاركتها في سوق العمل، واتخاذ إجراءات مهمة لإسقاط نظام الولاية على المرأة، وهو النظام الذي كان سببًا في تحجيم دور المرأة السعودية على مدى عقود طويلة، خاصة منذ نهاية سبعينيات القرن العشرين، حين بدأت التيارات المحافظة في المملكة بالنشاط/n/r

وفي لقاء له في عام 2018، صرح أن: «النساء السعوديّات - في عهده - أصبح لديهن حقوق جديدة، حيث بات بإمكانهن البدء في التجارة والانضمام إلى السلك العسكري السعودي وحضور الحفلات والأحداث الرياضية، وبعد أشهر قليلة سيكون بمقدورهن الجلوس خلف مقود السيارة»/n/r

وصفت صحيفة نيويورك تايمز هذه الإصلاحات بأنها خطوات واسعة وغير مسبوقة في تاريخ المملكة العربية السعودية وأنها ستؤثر جذريًا على حياة المرأة السعودية، في حين وصفت محمد بن سلمان بأنه: «أحد أكثر القادة السعوديين ديناميكية»/n/r

رفع الحظر عن قيادة المرأة في السعودية
المقالة الرئيسة: قيادة المرأة في السعودية
عُدّت قضية حظر المرأة من قيادة السيارة في السعودية، إحدى قضايا الرأي العام التي شغلت المجتمع السعودي، إذ انفردت السعودية بكونها البلد الوحيد في العالم الذي مُنِعت النساء فيها من قيادة السيارات، وكان قرار عدم السماح للنساء بالقيادة قائمًا بحكم الأمر الواقع من خلال عدم وجود ترخيص بإصدار رخص قيادة لهن، بالرغم من عدم وجود قانون سعودي صريح يمنع المرأة من القيادة/n/r في 16 أبريل 2016، كشف محمد بن سلمان بأنه ليس لديه مشكلة مع المؤسسة الدينية الرسمية فيما يخص قيادة المرأة للسيارة، مشيرًا إلى أن المشكلة: «التي أعمل على حلها هي مع أولئك الذين يشوهون الحقائق على المؤسسة الدينية كي لا تحصل النساء على حقوقهن الكاملة التي كفلها لهن الإسلام»، حسبما جاء في حواره مع مجلة بلومبيرغ الاقتصادية/n/r جاء رفع الحظر عن قيادة المرأة للسيارة في السعودية في 26 سبتمبر 2017، بعد مضي ثلاثة أشهر على تولي ابن سلمان ولاية العهد، حيث صدر أمر ملكي من قبل الملك سلمان بن عبد العزيز، نص على منح النساء حق القيادة وتوجيه إدارة المرور بالبدء في إصدار رخص القيادة للنساء في 24 يونيو 2018، وقد صدرت أول رخصة قيادة لامرأة سعودية في 4 يونيو 2018/n/r

إنهاء نظام الولاية على المرأة
المقالة الرئيسة: نظام الولاية على المرأة (السعودية)
بدأت فعليًا إجراءات إلغاء نظام الولاية على المرأة في السعودية في عهد الملك سلمان بن عبد العزيز، تحديدًا بعد تولي محمد بن سلمان ولاية العهد في المملكة وإطلاقه رؤية السعودية 2030 في العام 2016، حيث دفع إلى إلغاء النظام كُليًا/n/r وكان ابن سلمان قد صرّح لمجلة ذا أتلانتيك في الأوّل من أبريل 2018، قائلًا: «قبل العام 1979 كانت هناك عادات اجتماعية أكثر مرونة، ولم تكن هناك قوانين للولاية في السعودية»، في إشارة منه إلى سلسلة تشريعات متفرّقة لم تأخذ صفة القانون جرى العمل بها منذ نهاية سبعينيات القرن العشرين حدّت من حقوق المرأة السعودية باعتبارها قاصرًا بحاجة إلى ولي أمر/n/r شملت تلك التشريعات مختلف المجالات الحقوقية بما في ذلك الصحة، التعليم، العمل، الزواج، القضاء، التنقّل والسفر، وقضت بأن المرأة لا يمكن أن تتولى شؤونها الخاصة وهي بحاجة إلى رجل يأخذ القرار عنها، ولم تُحدّد التشريعات سنًّا قانونية للمرأة تصبح فيه ولية أمر نفسها كما أنّها لم تُحدّد بالمقابل سنًّا قانونية للرجل الذي يمكنه تولي شؤون المرأة، وعُدّ أي ذكر في عائلة المرأة البالغة مؤهلًا لأن يُصبح ولي أمرها، حتى وإن لم يبلغ سن الرشد القانونية/n/r

وُصِف نظام الولاية بأنه «جدار برلين» في السعودية، وأن الحكومة السعودية ماضية في هدمهِ وإسقاطه، تنفيذًا لرؤية السعودية 2030، إذ تضمّنت خُطط ولي العهد في الإصلاحات، خطةً لـ«تحسين أوضاع المرأة في السعودية، والاهتمام بها من خلال إدخالها في مجالات العمل، وجعلها تتولّى العديد من الأدوار والمناصب الفعّالة، مما يحقق التقدّم والإصلاح في اقتصاد المملكة» وهي الرؤية التي تعهد ابن سلمان من خلالها بالمساواة بين الرجل والمرأة، خاصة فيما يخص الحقوق والفرص والأجور/n/r

كانت صحيفة ذي إيكونوميست البريطانية قد اعتبرت في 30 سبتمبر 2017، أن هذه الخطط والقرارات الإصلاحية بشأن المرأة تكشف عن رغبة صريحة من محمد بن سلمان في تخفيف قيود نظام الولاية على المرأة وربّما إنهائه بشكل كامل في السعودية/n/r

في لقاء له مع شبكة سي بي إس نيوز في 16 مارس 2018 ضمن برنامج 60 دقيقة للإعلامية نورا أودونيل، قال ابن سلمان أن: «إننا قطعنا شوطًا طويلًا للغاية ولم يتبقَّ إلا طريق قصير لنقطعه،» في معرض ردّه على سؤال حول إلغاء نظام الولاية، واصفًا المدافعين عن هذا النظام ومن يعارضون اختلاط الجنسين في العمل بـ«التطرّف»، قائلًا: هؤلاء المتطرفون «يخالفون ما كان عليه الرسول ﷺ والخلفاء الراشدون»، وألمح إلى قرب السماح للمرأة السعودية بعدم ارتداء «العباءة السوداء»، قائلًا: «لا يوجد نص شرعي يوجب أن تكون العباءة سوداء أو الحجاب أسودًا»/n/r

كانت الحكومة السعودية قد بدأت بإقرار قوانين عدة ألغت بموجبها أجزاءً واسعة من نظام الولاية على المرأة، وهي القوانين التي سمحت للمرأة بدخول الملاعب، دور المسارح والسينما، وكفلت لها الحق بالابتعاث والتعليم العالي في الخارج، والعمل في مختلف المجالات، بما في ذلك الحقل الدبلوماسي وتولي مناصب عُليا داخل الدولة، كانت بسبب نظام الولاية مُقتصرة على الذكور/n/r

وجاء الأمر الملكي رقم أ/229 في 23 فبراير 2019، الذي صدر باسم الملك سلمان بن عبد العزيز ووُقِع من قبل ولي العهد نائب الملك محمد بن سلمان في سابقة هي الأولى من نوعها باتجاه إلغاء ولاية الرجل على المرأة في السفر، إذ عَيَّن الأميرة ريما بنت بندر بمنصب «سفيرة لخادم الحرمين الشريفين لدى الولايات المتحدة الأمريكية بمرتبة وزير»، لتُصبح بذلك أول سفيرة للملكة، وأوّل امرأة سعودية تُعيّن بمنصب كبير ومهم في تاريخ السعودية/n/r وفي 30 يوليو 2019، أمر الملك سلمان بإجراء سلسلة تعديلات ألغى إثرها الجانب الأعظم من نظام ولاية الرجل على المرأة، وجاء ضمن التعديلات التي نُشرت في 2 أغسطس 2019 في صحيفة أم القرى ودخلت حيّز التنفيذ في نهاية أغسطس من العام نفسه: حق المرأة السعودية باستخراج جواز سفر بنفسها أسوة بالرجل، وحقها بالسفر ما إن تبلغ سن 21 عامًا دون قيد أو شرط، وحقها بطلب تسجيل طفلها المولود، بعد أن كان الأمر مقتصرًا على الزوج، وحقها بطلب الحصول على سجل الأسرة الخاص بها من إدارة الأحوال المدنية، بعد أن كان الأمر مقتصرًا على الرجل بوصفه رب الأسرة، وحقها في أن تكون ربًا لأسرتها مثلها مثل زوجها/n/r

الانفتاح على العالم
وقد جاء قرار منح التراخيص لفتح دور للسينما في السعودية بعد أربعين سنة من المنع، إضافة إلى قرار إنشاء الهيئة العامة للترفيه في السعودية، في إطار حملة الانفتاح المجتمعي التي يقودها محمد بن سلمان، وقد بدأت الهيئة منذ تأسيسها بإقامة حفلات غنائية وترفيهية في السعودية بشكل متواصل، كذلك في سياق الانفتاح أسست في فبراير 2020، هيئات ثقافية متعددة لتهتم من جانب بالموروث الثقافي السعودي حيث تعمل على حفظه ونشره على الصعيد الوطني والإقليمي والعالمي بعد أن كان مغيباً في ظل التشدد الذي كان يُخيم على الأجواء في المملكة ومن جانب آخر لتؤسس قطاعات ثقافية للمساهمة في التنويع الاقتصادي، ومن هذه الهيئات: هيئة التراث، وهيئة المتاحف، وهيئة الأفلام، وهيئة الموسيقى، وهيئة المكتبات/n/r

مكافحة الفساد
المقالات الرئيسة: لجنة مكافحة الفساد (السعودية) واعتقالات بتهم الفساد في السعودية (2017)

ولي العهد محمد بن سلمان رئيس لجنة مكافحة الفساد التي أمرت بالملاحقات القانونية/n/r
كان ولي العهد السعودي قد صرح في 25 أبريل 2016، بأن الملك سلمان بن عبد العزيز أبدى عدم رضاه عن الدور الذي تقوم به هيئة مكافحة الفساد السعودية، مُشيرًا إلى أن الملك أحدث تغييرات في الهيئة منذ اليوم الأوّل الذي تولى فيه الحكم، مفصحًا في 2 مايو 2017، بأن الحكومة السعودية تؤمن بأن سياسة مكافحة الفساد إذا لم تكن على رأس السلطة، فلن تكون هناك مكافحة فساد حقيقية ولن تكون هناك تنمية وازدهار مهما عملت، متعهدًا بأنه: «لن ينجو أي شخص دخل في قضية فساد سواءً وزيرًا أو أميرًا أو أيًا كان»/n/r

في 4 نوفمبر 2017، أصدر الملك سلمان أمرًا ملكيًا بتشكيل لجنة عليا برئاسة محمد بن سلمان، وعضوية كل من: رئيس هيئة الرقابة والتحقيق، رئيس الهيئة الوطنية لمكافحة الفساد، رئيس ديوان المراقبة العامة، النائب العام ورئيس أمن الدولة، وأبرز ما حُدّد لها من مهام: حصر المخالفات في قضايا الفساد العام، «التحقيق وإصدار أوامر القبض والمنع من السفر وكشف الحسابات والمحافظ وتجميدها، وتتبع الأموال والأصول ومنع نقلها أو تحويلها من قبل الأشخاص والكيانات أيًّا كانت صفتها»، اتخاذ ما يلزم مع المتورطين في قضايا الفساد العام وإعادة الأموال للخزينة العامة للدولة/n/r عُرِفت اللجنة لاحقًا باسم اللجنة العليا لمكافحة الفساد/n/r

إثر ذلك بدأت اللجنة بحملة ملاحقات قانونية، لعدد من مسؤولي الدولة في السعودية، كان على رأس هؤلاء شخصيات من العائلة الحاكمة وأخرى اقتصادية شهيرة، حيث وجهت لهم تهمًا بالفساد/n/r نتج عن حملة الاعتقالات، إجراءات قانونية تمثلت بتحفظ الحكومة السعودية على أموال المتهمين، الذين وضعت طائراتهم الخاصة تحت الحراسة، لمنع هروبهم إلى خارج السعودية، كما شُدِّدت المراقبة على المطارات السعودية لمنع هروب أي متهم ما يزال تحت التحقيق/n/r وقد أُوقِف المتهمون وأُودِعوا في فندق ريتز كارلتون بالعاصمة الرياض، الذي أُخلي من جميع النزلاء، وأوقفت فيه جميع خدمات الحجز/n/r كذلك قُطِعت جميع خطوط الاتصال الهاتفي به/n/r

في أعقاب الحملة، قال محمد بن سلمان في وصفه لحملة مكافحة الفساد التي يقودها في السعودية: «إن جميع حروب الحكومة السعودية في القضاء على الفساد فشلت، ذلك لأن تلك الحملات بدأت عند الطبقة الكادحة صعودًا إلى غيرها من الطبقات المرموقة»، مُستطردًا: «أمّا اليوم فالأمر مختلف، ذلك أن الملك سلمان بن عبد العزيز قطع عهدًا على نفسه بوضع حدٍ لـ (عمليات الفساد التي كانت مستشريه في هيكل الدولة)»، كاشفًا عن أن الملك سلمان فور توليه مقاليد الحكم أمر بجمع كل البيانات المُتعلقة بالفساد، عند الطبقة العُليا في السعودية، وهو ما استغرق عامين كاملين، جُمعَتْ خلالهما قائمة مسندة إلى معلومات دقيقة، تضم قرابة مائتي اسم، مُبيِّنًا «أن 95% من المتّهمين وافقوا على إعادة الأموال التي اختلسوها من أموال الدولة»/n/r وعن الإجراءات القانونية المتخذة ضد المتهمين، قال: «كل إجراءات مكافحة الفساد كانت ضرورية، واُتّخِذَت بناءً على قوانين واضحة ومعمول بها؛ بهدف إيصال رسالة عدم التهاون مع أي فساد»، منوهًا إلى أن «الهدف الأول للحملة هو معاقبة الفاسدين وليس تحصيل الأموال»/n/r وتعليقًا على بعض ما روّجته وسائل الإعلام - المحسوبة على أطراف مضادة للسعودية - إلى أن حملة الاعتقالات استهدفت وصول محمد بن سلمان إلى سدّة الحكم في السعودية، قال بن سلمان: «إنه لأمرٌ مضحك أن يقول أحد إن حملة مكافحة الفساد هذه كانت وسيلة لانتزاع السُلطة، فالأعضاء البارزين من المُحتجزين في ريتز أعلنوا مسبقًا بيعتهم لي ودعمهم لإصلاحاتي، كما أن الغالبية العظمى من أفراد العائلة الحاكمة تقف في صفي»، مضيفًا: «لطالما عانت دولتنا من الفساد منذ ثمانينيات القرن العشرين حتى يومنا هذا»/n/r وبحسب محمد بن سلمان، فإن تحقيقات اللجنة العليا لمكافحة الفساد توصلت إلى «أن ما يُقارب 10% من الإنفاق الحكومي السعودي كان قد تعرّض إلى الاختلاس أو الهدر، منذ بداية الثمانينيات، بسبب الفساد من كلتا الطبقتين: العُليا والكادحة»/n/r

وفي 30 يناير 2018، أُعْلِنَ في السعودية عن أن «الحكومة السعودية نجحت في جمع أكثر من مائة وسبعة مليارات دولار أمريكي تتضمن مختلف أنواع الأصول وتشمل عقارات وكيانات تجارية وأوراق مالية ونقد وغيرها، من خلال تسويات مالية مع رجال الأعمال والمسؤولين الذين جرى استدعاؤهم في إطار التحقيقات في حملة مكافحة الفساد»/n/r مثَّل الإعلان نصرًا سياسيًا لولي العهد محمد بن سلمان، الذي توقّع - عند تدشين حملة التطهير - بأن يصل صافي التسويّات إلى نحو مائة مليار دولار أمريكي/n/r

وبعد انتهاء المرحلة الأولى من حملة مكافحة الفساد التي استهدفت محاسبة كبار الفاسدين في السعودية الذين يُعرفون باسم «هوامير الفساد» أو «الرؤوس الكبيرة الفاسدة» على حد وصف مازن الكهموس رئيس هيئة الرقابة ومكافحة الفساد في السعودية، أُعلن عن بدء المرحلة الثانية التي تستهدف محاسبة الفاسدين من الموظفين الحكوميين المتوسطين والصغار، وأشار الكهموس بأن محمد بن سلمان وجهه بتغيير منظومة عمل الهيئة والقضاء على الإجراءات البيروقراطية السابقة وبإعلامه عن أيّ وزير لا يتعاون مع الهيئة/n/r

وفي 12 نوفمبر 2020، في كلمة لمحمد بن سلمان في الجلسة الافتتاحية لأعمال السنة الأولى من الدورة الثامنة لمجلس الشورى السعودي، وصف الفساد الذي كان منتشرًا «خلال العقود الماضية» في المملكة العربية السعودية بأنه مثل مرض السرطان، كاشفًا بأنه كان «يستهلك 5% إلى 15% من ميزانية الدولة»، وهو يرى أنه كان سببًا في انخفاض مستوى الخدمات والمشاريع وعدد الوظائف في السعودية من 5% إلى 15% على أقل تقدير/n/r يعتقد ابن سلمان أن سوء الأداء الإداري الذي خلقه الفساد لم يكن لسنة أو سنتين فقط، ولكنه تراكم على مدى ثلاثين سنة، وعدَّ الفساد العدو الأول للتنمية والازدهار، واصفًا إياه «بالآفة» التي تسبّبت في ضياع العديد من الفرص الكبيرة في السعودية، متوعدًا بأن الفساد: «أصبح من الماضي ولن يتكرر بعد اليوم على أي نطاق كان دون حساب قوي ومؤلم لمن تسوّل له نفسه، كبيرًا أو صغيرًا»/n/r

أعلن ابن سلمان في عام 2020، أن متحصلات تسويات مكافحة الفساد ما بين عامي 2017 و2020، قد بلغت 247 مليار ريال سعودي، ومثّل ذلك ما نسبته 20% من إجمالي الإيرادات غير النفطية السعودية، مشيرًا إلى أن وزارة المالية تعمل على تسييل أصول أخرى بعشرات المليارات نُقِلت إليها، لتُسجل لاحقًا في إيرادات الدولة/n/r

ويرى خبراء إلى أن السعودية بهذه الحملات تضع أقدامها نحو الانتقال لاقتصاد السوق الحر والعمل على تشجيع الاستثمارات التي تعد عصب الاقتصاد السعودي لمرحلة ما بعد النفط وفقًا لرؤية السعودية 2030، مشيرين إلى أن محمد بن سلمان يعتقد أن وجود فساد مالي في إدارة اقتصاد مثل اقتصاد المملكة العربية السعودية يؤدي إلى هدر الموارد المالية ويهدد فرص نمو الاقتصاد ومواكبة التحولات في الاقتصاد العالمي، وأن السعودية معنية بمكافحة الفساد بشكل جذري وبأثر رجعي لضمان الانتقال نحو الاقتصاد الآمن، وقطع الطريق أمام انتشار المحسوبية التي تعد أحد أهم المعوقات التي تعيق التطور الاقتصادي الوطني، وتؤخر خلق التنمية المستدامة/n/r

وفي التقرير السنوي الذي تصدره منظمة الشفافية الدولية، تقدمت السعودية سبعة مراكز عالمية في ترتيب مؤشر مدركات الفساد لعام 2019؛ إذ ارتفعت إلى المركز الـ51 عالمياً من أصل 180 دولة، متقدمة بذلك في مركزها بين دول مجموعة العشرين لتحقق المركز العاشر/n/r

إصلاح التعليم
في 15 سبتمبر 2021، أطلق محمد بن سلمان برنامج تنمية القدرات البشرية، أحد برامج تحقيق رؤية السعودية 2030، وهو يهدف إلى إصلاح نظام التعليم، وتتضمن خطة البرنامج: «89 مُبادرة بهدف تحقيق 16 هدفًا استراتيجيًا من أهداف رؤية المملكة 2030»، وتشتمل استراتيجية البرنامج ثلاث ركائز رئيسة، هي: «تطوير أساس تعليمي متين ومرن للجميع، والإعداد لسوق العمل المستقبلي محليًا وعالميًا، وإتاحة فرص التعلم مدى الحياة»، للمساهمة في تعزيز «قيم الوسطية والتسامح، والعزيمة والمثابرة، والانضباط والإتقان، بما يحقق قيم المواطنة العالمية ويعزز من تنافسية وقدرات المواطن السعودي»، على حد ما جاء في تعريف البرنامج/n/r

إصلاح القضاء
تعرض القضاء السعودي منذ عقود لانتقادات حقوقية بسبب «بطء إجراءات التقاضي التي قد تمتد إلى فترات غير محدودة»، «والغموض الذي يخيم على آلية صدور الأحكام»، «وخلوه من الضمانات»، وقد نتج ذلك لافتقاد النظام القضائي السعودي لمدونة شرعية قانونية جامعة وعامة يرجع القضاة إليها احتكامًا قبل إصدار الأحكام، وافتقاده لنظام السوابق القضائية، بسبب إعمال الاجتهاد في إصدار الأحكام ورفض التقليد، مما أتاح لأي قاض تجاهل الأحكام السابقة سواء صدرت عنه أو عن غيره، ومكنه من تطبيق تفسيره للنصوص الشريعة، الأمر الذي أوجد اختلافات كبيرة في تفسير نصوص الشريعة وفي تطبيقها، مما أوجد أحكامًا متباينة حتى في القضايا المتشابهة/n/r دفع هذا التباين إلى مطالبات نادت بتدوين الشريعة لضبط القضاء، ليُعلن وزير العدل في عام 2010 عن خطط لتدوين الشريعة، إلا إنها ووجهت بمقاومة من التيار الديني المسيطر على القضاء/n/r وسبق ذلك الإعلان بثلاث سنوات أن نشرت وزارة العدل السعودية إصدارها الأوّل من مدونة الأحكام القضائية، ورغم تتابع الإصدارات إلا إنها حددت الهدف من وراء مشروع المدونة بالتوثيق ونشر الفائدة للاستئناس عند الاجتهاد، وكان محمد بن سلمان قد صرّح في 8 فبراير 2021، أن «مدونة الأحكام القضائية اتضح بعد الدراسة بأنها لا تفي باحتياجات المجتمع وتطلعاته»/n/r

كانت السعودية ضمن خطة إصلاحات واسعة في مجال حقوق الإنسان قد قلصت من صلاحيات الأحكام التعزيرية المتروكة لتأويلات القضاة، حيث أوقفت أحكام القتل تعزيرًا على الأشخاص الذين لم يتموا 18 عامًا وقت ارتكابهم الفعل المعاقب عليه، وشمل هذا مرتكبي الجرائم الإرهابية الذين صدرت بحقهم أحكام نهائية، كما ألغت عقوبة الجلد وقررت استبدالها بعقوبتي السجن أو الغرامة، أو بعقوبات بديلة بحسب ما يصدره ولي الأمر من أنظمة أو قرارات بهذا الشأن/n/r وفي 8 فبراير 2021، انتقد محمد بن سلمان افتقار القضاء لمنظومة تشريعات متخصصة، مشيرًا إلى أن ذلك «أدّى إلى تباين في الأحكام وعدم وضوح في القواعد الحاكمة للوقائع والممارسات ما أدّى لطول أمد التقاضي الذي لا يستند إلى نصوص نظامية، علاوة على ما سبَّبهُ ذلك من عدم وجود إطار قانوني واضح للأفراد وقطاع الأعمال في بناء التزاماتهم»، مضيفًا «لقد كان ذلك مؤلمًا للعديد من الأفراد والأسر، لا سيما للمرأة، ومكّن البعض من التنصل من مسؤولياته»، معلنًا عن إطلاق مشروع «منظومة التشريعات المتخصصة»، بهدف «تطوير البيئة التشريعية، من خلال استحداث وإصلاح الأنظمة التي تحفظ الحقوق وتُرسِّخ مبادئ العدالة والشفافية وحماية حقوق الإنسان وتحقّق التنمية الشاملة، وتعزّز تنافسية المملكة عالميًا من خلال مرجعياتٍ مؤسسيةٍ إجرائيةٍ وموضوعيةٍ واضحةٍ ومحددةٍ»، مشيرًا إلى أن عملية تطوير المنظومة التشريعية في المملكة مستمرة، وستصدر هذه التشريعات تباعًا، بعد أن تُحال على مجلس الوزراء وأجهزته لدراستها ومراجعتها وفق الأصول التشريعية؛ تمهيدًا لإحالتها على مجلس الشورى وفقًا لنظامه، ومن ثم إصدارها وفقًا للأصول النظامية المتبعة في هذا الشأن/n/r

منظومة التشريعات المتخصصة
كشف محمد بن سلمان عن أن «منظومة التشريعات المتخصصة» تضم أربعة مشروعات أنظمة تعمل السعودية على إعدادها، وهي مشروع نظام الأحوال الشخصية، ومشروع نظام المعاملات المدنية، ومشروع النظام الجزائي للعقوبات التعزيرية، ومشروع نظام الإثبات، مشيرًا إلى أن هذه المنظومة «ستُمثِّلُ موجة جديدة من الإصلاحات، التي ستُسهم في إمكانية التنبؤ بالأحكام ورفع مستوى النزاهة وكفاءة أداء الأجهزة العدلية وزيادة موثوقية الإجراءات وآليات الرقابة، كونها ركيزة أساسية لتحقيق مبادئ العدالة التي تفرض وضوحَ حدود المسؤولية، واستقرار المرجعية النظامية بما يحدّ من الفردية في إصدار الأحكام»، مبينًا أن المنظومة ستلتزم «بأحدث التوجهات القانونية والممارسات القضائية الدولية الحديثة، بما لا يتعارض مع الأحكام الشرعية»، وأنها «سيراعي التزامات المملكة فيما يخصُّ المواثيق والاتفاقيات الدولية التي انضمت إليها»/n/r وقد أقر مجلس الوزراء في 28 ديسمبر 2021 نظام الإثبات/n/r

الدين
وصل محمد بن سلمان إلى ولاية العهد في ظل هيمنة التيار الديني الحركي على مجمل الحياة العامة في السعودية، هيمنة نتجت عن سطوة مطلقة فرضها التيار على التربية والتعليم والثقافة والإعلام والقضاء، حتى اتسمت البلاد بطابع التزمت الديني الذي أثر على طبيعة المجتمع السعودي وعكس صورة مغايرة عن حقيقة البلاد/n/r

القرآن والسنة
في مقابلة للأمير محمد بن سلمان، بُثت في 27 أبريل 2021، في الذكرى الخامسة للإعلان عن رؤية السعودية 2030، قال إن السعودية في الجوانب الشرعية: «ملزمة بتطبيق أحكام القرآن وأحكام الحديث المتواتر، وتنظر إلى حديث الآحاد وفقًا لدرجة صحته، ولا تنظر إلى «الخبر» بتاتًا إلا إن كان فيه مصلحة واضحة للإنسان»، مضيفًا: «ألا عقوبة على شأن ديني إلا بنص قرآني قطعي الدلالة»، وأن السلطة غير ملزمة بمحاسبة الأفراد على أمر لم يُنزل الله به حكمًا عقابيًا دنيويًا، مشيرًا إلى أن القرآن هو دستور السعودية/n/r وفي معرض سؤاله عن مدرسة الشيخ محمد بن عبد الوهاب إن كانت هي الدائرة التي يلزم تفسير القرآن والحديث في حدودها، قال: إن المملكة غير ملزمة بالأخذ بتفسير مدرسة فقهية واحدة أو عالم فقيه واحد في تطبيق أحكام الإسلام، وأن الالتزام بذلك هو تأليه للبشر وغلق لباب الاجتهاد، في حين «لم يضع الله حجابًا بينه وبين الناس»/n/r

الوسطية
حين سئل محمد بن سلمان عن مفهومه للاعتدال، قال في 27 أبريل 2021، إن: «[كلمة] الاعتدال واسعة للغاية، فجميع فقهاء المسلمين اجتهدوا بمفهوم الاعتدال منذ أكثر من 1000 عام»، وإنه «غير قادر على شرح الكلمة»، لكنه أشار إلى أن مفهوم الاعتدال عنده هو: «الالتزام بدستور المملكة العربية السعودية أي القرآن والسنة اللذين يشكّلان أساس نظام الحكم في السعودية /n/r/n/r/n/r وتطبيقه على أكمل وجه وبمفهوم واسع يشمل الجميع»، وعن مصطلح «الإسلام المعتدل»، قال إن استخدام: مصطلح «الإسلام المعتدل» قد يجعل المتطرفين والإرهابيين سعداء، ذلك أنه قد يوحي أن السعودية والبلدان الأخرى [التي انتهجت الوسطية] تعمل على تغيير الإسلام إلى شيءٍ جديد، بينما هي عودة إلى أصل وجذور الإسلام، رجوع «إلى تعاليم الإسلام الحقيقية، التي عاش بها الرسول عليه الصلاة والسلام والخلفاء الأربعة الراشدون، حيث كانت مجتمعاتهم منفتحة ومسالمة، يعيش المسلمون فيها جنبًا إلى جنب المسيحيين واليهود»، مشيرًا إلى أن «هذه التعاليم أرشدتنا أن نحترم مختلف الثقافات والديانات»/n/r

محاربة التطرف والإرهاب في السعودية
المقالات الرئيسة: الصحوة السعودية والإرهاب في السعودية
اتخذ محمد بن سلمان خطواتٍ عديدة لمحاربة التطرّف الديني في المملكة العربية السعودية، واستهدفت تلك الخطوات إنهاء ما يُسمّى مشروع الصحوة الإسلامية في السعودية/n/r ويسجّل المتابعون أن ثقافة التشدّد في المملكة العربية السعودية أصبحت في انحسارٍ بسبب سياسات محمد بن سلمان، لصالح ما يعتقد أنّها تعاليم الإسلام الحقيقية، الضامنة لثقافة التعدّدية الفكرية، «المنفتحة على العالم وعلى جميع الأديان وعلى جميع التقاليد والشعوب»/n/r والصحوة الإسلامية في السعودية هي حركة فكرية اجتماعية إسلامية سياسية نشأت بدعم من مجموعة دعاة إبان حراكهم الدعوي، والتسمية إشارة إلى «إيقاظ الناس من غفوتهم» حسبما يقولون، وقد تأثر شيوخ هذا التيار بفكر جماعة الإخوان المسلمين/n/r بدأ مصطلح «الصحوة» في الظهور في حقبة الثمانينيات من القرن العشرين/n/r بحسب محمد بن سلمان فإن «الصحوة» حالة غير عادية وغير طبيعية دخلت على المجتمع السعودي، وبدأت بنشر ما وصفه بالإسلام «غير المعتدل»، من خلال سيطرتها على سلك التعليم في المملكة، بعد أن أصبحت مدارس المملكة العربية السعودية ساحة نشاط لهؤلاء، حيث «تعرضت للغزو من جماعات متشددة، من بينها الإخوان المسلمين» بحسب تعبيره، وقد أرجع هذه الحالة إلى كونها ردَّ فعلٍ مُوَازٍ للثورة الإسلامية في إيران/n/r وقال ابن سلمان أن المجتمع السعودي، خاصة الشباب منهم، كانوا ضحية لهذا المشروع، متعهدًا بـ«تحرير المجتمع السعودي» من مشروع الصحوة وذلك بإنهاء تلك الحقبة لإعادة السعودية إلى ما كانت عليه قبل ثلاثين عامًا، أي إلى ما قبل بدء الصحوة، حيث كان الناس «يعيشون حياة طبيعية مثل بقية دول الخليج العربي»، ضاربا أمثلة بأن النساء «كن يقدن السيارات، وكانت هناك دور للسينما»، مضيفًا أن: «70% من الشعب السعودي هم شباب وشابات بأعمار لم تتجاوز الثلاثين عامًا، وبكل صراحة لن نضيع ثلاثين سنة من حياتنا في التعامل مع أي أفكار مدمّرة»، مستطردًا: «سوف ندمرها اليوم وفورًا»، وهو تصريح يرى مراقبون بأنّه يعكس توجهًا فكريًا واضحًا لديه لمحاربة مشروع الصحوة، ويُفسر سلسلة الخطوات التي اتُّخذت لمحاربة ما يوصف بالتطرّف في المملكة، بعد أن تعهد بالقضاء عليه في القريب العاجل على حد وصفه، قائلًا: «لن تقبل أي دولة في العالم بأن يكون لديها جماعة متطرّفة تسيطر على نظام الدولة التعليمي»/n/r

أطلق محمد بن سلمان في 30 أبريل 2017، مركز الحرب الفكرية التابع لوزارة الدفاع السعودية، لمواجهة جذور التطرف والإرهاب، ونشر ثقافة التسامح التي يدعو لها الإسلام، وفي 21 مايو 2017، افتتح الملك سلمان المركز العالمي لمكافحة الفكر المتطرف في الرياض، بحضور الرئيس الأمريكي دونالد ترمب وولي العهد السعودي وجمع من رؤساء الدول حول العالم، وهو مركز عالمي يخدم جميع دول العالم ويُعنى بمحاربة التطرف فكريًا وإعلاميًا ورقميًا، وتعزيز قيم التعايش والتسامح بين الشعوب، وينشر بجميع اللغات حول العالم/n/r

كانت واشنطن العاصمة قد أعربت عن رغبة شديدة في رؤية المزيد من الخطوات السعودية لمكافحة الجماعات المتطرفة والإرهابية، ودعا مسؤولون أمريكيون نظراءهم السعوديين إلى المضي بصرامة أكبر في نزع الشرعية عن الأيديولوجية الدينية المتطرفة في السعودية/n/r

يقول محمد بن سلمان بأن القضاء على التطرف داخل السعودية في عام 2017، «لم يكن خيارًا مطروحًا من الأساس، ولا السيطرة عليه أمرًا واردًا»، ذلك أنه كان قد استشرى وقوي عوده بشكل كبير حتى وصل السعوديون إلى مرحلة يهدفون فيها في أفضل الأحوال: «إلى التعايش مع هذه الآفة» على حد تعبيره، إلا أنه منذ أن وعد بالقضاء عليه في عام 2017، استطاعت الحكومة السعودية خلال سنة واحدة، أن تقضي على «مشروع أيديولوجي صُنع على مدى 40 سنة»/n/r

يرى محمد بن سلمان، بعد ثلاثة سنوات من بدء حملته على التطرّف، بأن التطرف لم يعد مقبولًا اليوم في المملكة العربية السعودية، وهو وإن لم يعد يظهر على السطح، إذ أصبح «منبوذًا ومتخفيًا ومنزويًا»، لكنه لم ينتهِ بعد، متعهدًا بالاستمرار في مواجهة أي مظاهر وتصرفات وأفكار متطرفة «دخيلة من جهات خارجية تسترت بعباءة الدين»، نبذها السعوديون، قائلًا بأن السعوديين «لن يسمحوا أبدًا بوجودها بينهم مرة أخرى»/n/r

في منتصف عام 2017، عمل محمد بن سلمان أيضًا على إعادة هيكلة وزارة الداخلية السعودية، بعد أن تزايدت العمليات الإرهابية داخل السعودية منذ تفجيرات الخبر عام 1996، وهي الفترة التي لم يكد يمر عام من دون أن تتعرض السعودية فيها لعملية إرهابية واحدة، حتى «وصل الحال إلى عملية إرهابية في كل ربع عام أو أقل» كما قال ابن سلمان، مشيرًا إلى أن الجماعات الإرهابية استطاعت أن تصل ما بين عامي 2012 و2017 إلى داخل المقرات الأمنية السعودية نفسها، وهذا الأمر دفعه إلى إصلاح القطاع الأمني وتغيير آلية مواجهة الإرهاب حيث أصبح عمل الأجهزة الأمنية السعودية تحت إدارته «استباقيًا»، وهذا بدوره كان سببًا في انخفاض عدد العمليات الإرهابية في السعودية ما بين عامي 2017 و2020، حيث لفت محمد بن سلمان إلى أن السعودية وصلت إلى ما يقارب «صفر» عملية إرهابية ناجحة خلال هذه الفترة، باستثناء ما أسماها: «محاولات فردية معدودة لم تحقق أهدافها البغيضة»، متوعدًا بأن الدولة السعودية ستضرب «بيد من حديد» ضد كل من تسوّل له نفسه المساس بأمنها واستقرارها/n/r

يعتقد محمد بن سلمان بأن «خطاب الكراهية هو الدافع الرئيسي لتجنيد المتطرفين»، ويشمل خطاب الكراهية الذي يستخدم حرية التعبير وحقوق الإنسان مبررًا لازدراء الأديان ومهاجمة الرموز الدينية والوطنية، ويرى ابن سلمان، بأن هذا النوع من الخطاب يخلق بيئة خصبة للتطرف والإرهاب ويستقطب خطاب كراهية مضادًا من المتطرفين/n/r وسبق لمحمد بن سلمان أن رفض في أكثر من مناسبة أي محاولة للربط بين الإسلام والإرهاب، داعيًا دول العالم أن تحذو حذو السعودية في تجريم ونبذ كل عمل إرهابي أو ممارسات وأعمال تولد الكراهية والعنف/n/r

تحديد دور الحسبة
المقالة الرئيسة: هيئة الأمر بالمعروف والنهي عن المنكر
حدَّ محمد بن سلمان من دور الشرطة الدينية السعودية التي تُعرف رسميًا باسم هيئة الأمر بالمعروف والنهي عن المنكر، حيث جُردت من سلطتها في مباشرة وتنفيذ إجراءات «الضبط الجنائي والإداري والتحفظ والمتابعة والمطاردة والإيقاف والاستجواب والتثبت من الهوية والتحقيق والقبض»، بعد أن قُصرت هذه الإجراءات على السلطات الأمنية التابعة لوزارة الداخلية، وكان «رجال الحسبة» أو «المطاوعة» كما يُسمون محليًا قد عُرفوا بالتعسف والتَّزمّت، خاصة تجاه النساء السعوديات، وسُجلت حوادث وفاة عديدة تسببت بها دورياتهم وعلقت في ذاكرة المجتمع السعودي، ومنها مقتل 15 طالبة في حريق بمدرسة بنات في مكة في 11 مارس 2002، بعد أن منع رجال الحسبة رجال الإطفاء ورجال الإسعاف من الدخول إلى المدرسة لئلا «يُكشفن على غريب»/n/r

رؤية 2030

شعار رؤية السعودية 2030
المقالات الرئيسة: رؤية السعودية 2030 وبرنامج التحول الوطني
في 25 أبريل 2016 أطلق محمد بن سلمان رؤية أسماها رؤية المملكة العربية السعودية 2030، وهي خطة اقتصادية اجتماعية ثقافية سياسية شاملة للمملكة العربية السعودية تؤسس لدخول المملكة إلى عصر ما بعد النفط/n/r تتزامن الرؤية مع التاريخ المحدّد لإعلان الانتهاء من تسليم ثمانين مشروعًا حكوميًا عملاقًا، يكلّف أقل واحد بينهما ما يعادل أربعة مليارات ريال، بينما بعض المشاريع تفوق كلفتها المائة مليار ريال سعودي، كما في مشروع مترو الرياض/n/r نظَّمَ الخُطَّة مجلس الشؤون الاقتصادية والتنمية برئاسته، وقد عُرِضت على مجلس الوزراء السعودي برئاسة الملك سلمان بن عبد العزيز آل سعود/n/r وبعد الإعلان عن الرؤية، قدّم محمد بن سلمان، عن طريق مجلس الشؤون الاقتصادية والتنمية كل من برنامج التحول الوطني في 7 يونيو 2016 وبرنامج تحقيق التوازن المالي في 22 ديسمبر 2016، إذ يعد كل منهما من ركائز الرؤية، وقد وافق مجلس الوزراء السعودي على البرنامجين/n/r

يهدف محمد بن سلمان من خلال هذه الخطة، والبرامج المتصلة بها، إلى زيادة الإيرادات غير النفطية السعودية ستة أضعاف من نحو 43/n/r5 مليار دولار سنويًا إلى 267 مليار دولار سنويًا، إضافة إلى زيادة حصة الصادرات غير النفطية السعودية من 16% من الناتج المحلي السعودي (في 2016) إلى 50% من الناتج المحلي السعودي (في 2030)/n/r كما أنّه يريد بهذه الرؤية أن يجعل الاستثمار في الداخل السعودي منطقة لإيجاد المزيد من الفرص الوظيفية والاقتصادية في السعودية/n/r وضع محمد بن سلمان ثلاثة أركان للرؤية السعودية، هي باعتقاده بمثابة عوامل نجاحها إذا ما ارتكزت الرؤية عليها:

الركن الأوّل هو أن السعودية هي العمق العربي والإسلامي، إذ يوجد بها المسجد الحرام في مكة المكرمة، والمسجد النبوي في المدينة المنورة، واللذان يعدان أهم الأماكن المقدسة عند المسلمين، بذلك هي قبلة أكثر من 1/n/r8 مليار مسلم على وجه الأرض، ويجب أن ترتكز الرؤية على هذا العامل/n/r
الركن الثاني: القدرات الاستثمارية الضخمة للمملكة العربية السعودية يجب أن تكون محركًا لاقتصاد المملكة وموردًا إضافيا لها، وبهذه القدرات تهدف الرؤية أن تصنع من المملكة العربية السعودية قوة استثمارية رائدة/n/r
الركن الثالث، يعتقد محمد بن سلمان أن الموقع الجغرافي الإستراتيجي للمملكة العربية السعودية، وما يحيط بها من معابر مائية مهمة - مضيق هرمز في الشرق، مضيق باب المندب في الجنوب الغربي، قناة السويس في الشمال الغربي - يجعل من المملكة أهم بوابة للعالم بصفتها مركز ربط للقارات الثلاث (آسيا، أفريقيا وأوروبا)/n/r
نيوم
المقالة الرئيسة: نيوم
نيوم أو «المدينة الحلم» أو «أرض الفرص والأحلام» كما وُصِفَت، مشروع مدينة ذكية أطلقه محمد بن سلمان في مؤتمر دولي للاستثمار في مدينة الرياض في 24 أكتوبر 2017/n/r يرغب ابن سلمان أن تكون «نيوم» بمثابة عاصمة تجارية واقتصادية عالمية تمثل روح العصر المرتبط بالذكاء الاصطناعي/n/r يقع مشروع «نيوم» شمال غرب السعودية على مساحة ست وعشرين ألفًا وخمسمائة كيلومتر مربع بالاشتراك مع كلٍّ من مصر والأردن، وسيكون المشروع «منطقة خاصة» سيشتمل أراضٍ سعودية وأخرى مجاورة لها داخل الحدود المصرية والأردنية، وسيحكم بقوانين تجارية خاصة به/n/r وقد جاء اختيار محمد بن سلمان لهذه المنطقة لتكون أرض المشروع، ذلك بأن قرابة عشرة بالمائة من حركة التجارة العالمية تمّر عبر ساحلها، إضافة إلى أن الموقع يعد محورًا يربط القارات الثلاث آسيا وأوروبا وأفريقيا، إذ يمكن لسبعين بالمائة من سكان العالم الوصول إلى «نيوم» خلال ثماني ساعات كأقصى حد/n/r قدّر محمد بن سلمان قيمة المشروع بخمسمائة مليار دولار أمريكي، قائلا أن تمويله سيكون من قبل صندوق الاستثمارات العامة ومستثمرين سعوديين ودوليين/n/r وهو يطل من الشمال والغرب السعوديين على البحر الأحمر وخليج العقبة بطول 468 كيلومتر وتحيط به من الشرق سلسلة جبال بارتفاع 2500 متر/n/r

قال محمد بن سلمان أن المنطقة ستكون مفتوحة للسياحة في العام 2020، بينما ستُفتتح مدينة نيوم - التي يقوم عليها المشروع - في العام 2025/n/r قالت صحيفة فاينانشال تايمز في وصف المشروع بأنَّ محمد بن سلمان يريد أن يبني «دافوس في الصحراء»، في إشارة إلى مدينة دافوس السويسرية التي يقام فيها المنتدى الاقتصادي العالمي/n/r يأتي مشروع نيوم كجزء من رؤيته رؤية السعودية 2030 ضمن استراتيجية وُصِفَت بأنّها طموحة، تستهدف الانفتاح الاقتصادي ومحاربة التطرّف وتخفيف القيود الاجتماعية الطارئة على السعودية حسبما وصفها محمد بن سلمان/n/r وكان ولي العهد السعودي قد أعلن أن أسهم مدينة نيوم ستطرح للاكتتاب في الأسواق المالية العالمية، حيث قال إنّ نيوم هي «أوّل مدينة رأسمالية في العالم، هذا هو الشيء الفريد الذي سيحدث ثورة»، مضيفًا: «ستكون أول منطقة تطرح في الأسواق العامة، يبدو الأمر كما لو أنك تطرح مدينة نيويورك في الأسواق»/n/r

ذا لاين
المقالة الرئيسة: ذا لاين
أقدم لكم ذا لاين، مدينة مليونية بطول 170 كم تحافظ على 95% من الطبيعة في أراضي نيوم، صفر سيارات، صفر شوارع، وصفر انبعاثات كربونية/n/r
—محمد بن سلمان، 10 يناير 2021
هو مشروع مدينة مخططة في منطقة تبوك شمال غرب السعودية/n/r المدينة مخطط لها على أن تكون بشكل خط مستقيم بطول 170 كيلومتر (105 أميال)، يمتد من البحر الأحمر غربا إلى الشرق، ماراً بتضاريس جغرافية وبيئية مختلفة ومتنوعة، تشمل السواحل والسهول والأودية والصحاري والجبال، ستكون مدينة خالية من الكربون، وقادرة على إيواء مليون ساكن/n/r ستكلف بنيتها التحتية ملبغ من 100 إلى 200 مليار دولار، ويتوقع أن تخلق 380 ألف فرصة عمل وتحفز التنويع الاقتصادي وتساهم بمبلغ 180 مليار ريال سعودي في الناتج المحلي الإجمالي المحلي بحلول عام 2030/n/r ومن المخطط أن يتم تشغيلها بنسبة 100٪ من الطاقة المتجددة وأن يكون لها لوائح أعمال قائمة على المسؤولية البيئية/n/r

في 25 يوليو 2022، كشف محمد بن سلمان عن تصاميم مدينة «ذا لاين»، إذ سيبلغ عرضها 200 م فقط على امتداد 170 كلم، وارتفاع يبلغ 500 م فوق سطح البحر، مما سيجعلها بمثابة ناطحات سحاب متشابكة وممتدة على طول 170 كلم/n/r ستُبنى المدينة على مساحة لا تتجاوز 34 كلم2، وستتسع لنحو 9 ملايين نسمة/n/r أشار الأمير إلى المدينة ستتيح لجميع السكان إمكانية الوصول إلى جميع المرافق والخدمات في غضون خمس دقائق، إضافة إلى وجود قطار فائق السرعة يصل بين طرفي المدينة خلال عشرين دقيقة/n/r وكشفت التصاميم أن جانبي المدينة الخارجيين سيغطيان بمرايا عاكسة/n/r وستكون مدينة «ذا لاين» إحدى مشاريع نيوم المصممة رقميًا بالكامل/n/r

مشروع القِدِّية
المقالة الرئيسة: القدية (مشروع)
في 8 أبريل 2017، أطلق محمد بن سلمان مشروع منتجع القِدِّية الترفيهي الذي يستهدف تأسيس أكبر مدينة ترفيهية ثقافية رياضية على مستوى العالم بمساحة 334 كيلومتر مربع، أي يزيد حجمه عن ديزني وورلد بثلاث مرات تقريبًا/n/r «عاصمة المغامرات المستقبلية» على حد وصف محمد بن سلمان للمشروع، يستهدف منه – إضافة إلى تنويع إيرادات صندوق الاستثمارات العامة – أن يحافظ على حصة من إنفاق السعوديين على الترفيه/n/r

مشروع البحر الأحمر
المقالة الرئيسة: مشروع البحر الأحمر
في 31 يوليو 2017، أطلق محمد بن سلمان من خلال صندوق الاستثمارات العامة مشروع البحر الأحمر وهو مشروع سياحي عالمي، يستهدف خلق منتجعات سياحية على أكثر من خمسين جزيرة سعودية بين مدينتي أُمْلُج الحوراء والوجه، ويجاور المحميات الطبيعية بالمنطقة والبراكين الخاملة، ومواقع آثار أبرزها مدائن صالح، وسيقام على مساحة تقدّر بأربع وثلاثين ألف كيلومتر مربع/n/r يرغب محمد بن سلمان أن يصبح هذا المشروع بوابة لاستكشاف منطقة البحر الأحمر أمام العالم لينافس كلا من جزر السيشل وجزر المالديف التي يمكن لجميع سكان الأرض زيارتهما، إذ سيُتاح لغالبية السيّاح في العالم إمكانية زيارة منطقة مشروع البحر الأحمر والدخول إليها من دون الحاجة إلى حصولهم على تأشيرة دخول سعودية، ويستهدف محمد بن سلمان من هذه الخطوة، من جهة كسر حواجز التطرّف الذي منع تطوير السياحة - خاصة البحرية منها - في السعودية، ومن جهة أخرى أن يكون للمملكة حضور على خريطة السياحة العالمية وفقًا لرؤية السعودية 2030/n/r

وكان محمد بن سلمان في العام 2015 قد زار المنطقة - قبل الكشف عن المشروع بعامين - حيث أبدى في مقابلة له مع مجلة الإيكونوميست البريطانية عن إعجابه بتلك المنطقة، قائلا بـ«أنها رائعة»، و«أنه قضى بها ثماني عطلات»، حيث «يوجد فيها ما يقرب من مائة جزيرة، في مجموعة مرجانية واحدة»/n/r مضيفًا «إن المنطقة تتمتع بدرجة حرارة مثالية وهي أكثر برودة من مدينة جدة، كما أنها تعتبر أرضًا عذراء يمكن استغلالها اقتصاديًا»/n/r

مدينة الأمير محمد بن سلمان غير الربحية
المقالة الرئيسة: مدينة الأمير محمد بن سلمان غير الربحية
في 14 نوفمبر 2021، أعلن الأمير محمد عن مدينة الأمير محمد بن سلمان غير الربحية، وهي أول مدينة غير ربحية في العالم، ستقام على أرض خاصة بولي العهد في حي عرقة غرب الرياض العاصمة بمحاذاة وادي حنيفة، على مساحة تقدر بحوالي (3/n/r4) كيلو متر مربع، خصصها ولي العهد لتنفيذ المشروع/n/r المدينة ستكون حاضرة رقمية متقدمة محورها الإنسان، صممت لتكون مستدامة وصديقة للمشاة، مع تخصيص أكثر من (44%) من المساحة الإجمالية كمساحات خضراء مفتوحة لتسهم في تعزيز التنمية المستدامة/n/r المدينة التي تتبنى مفهوم التوأم الرقمي ستحتضن العديد من الأكاديميات والكليات ومدارس مسك، وستشمل على مركز للمؤتمرات، ومتحف علمي، ومركز الإبداع ليكون مساحة لتحقيق طموحات المبتكرين في العلوم والتقنية بالأنظمة المتطورة مثل: الذكاء الاصطناعي، وإنترنت الأشياء والروبوتات، وكذلك معهد ومعرض للفنون، ومسارح لفنون الأداء، ومنطقة ألعاب، ومعهد لفنون الطهي بالإضافة إلى مجمع سكني متكامل، وستعمل المدينة أيضاً على استضافة رؤوس الأموال الجريئة والمستثمرين ذوي المساهمات المجتمعية حول العالم/n/r

مدينة أوكساجون
المقالة الرئيسة: أوكساجون
في 16 نوفمبر 2021، أعلن الأمير محمد عن إطلاق مدينة نيوم الصناعية «أوكساجون»، هي مدينة صناعية تعد أكبر تجمع صناعي عائم في العالم/n/r تقع المدينة في الركن الجنوبي الغربي من نيوم على البحر الأحمر بالقرب من قناة السويس، ويتوقع أن تبدأ استقبال رواد التصنيع والمستثمرين وأصحاب الأعمال في بداية عام 2022/n/r

طرح أرامكو للاكتتاب العام
المقالات الرئيسة: أرامكو السعودية وطرح أسهم أرامكو للاكتتاب العام
في 4 يناير 2016، كشف محمد بن سلمان لمجلة ذي إيكونوميست البريطانية، عن مقترح طرح نسبة من أسهم شركة أرامكو، كجزء من خطة الإصلاح الاقتصادي لرؤية السعودية 2030، بهدف استحداث أسلوب الإدارة ونظام التدقيق الغربي في عملاقة النفط العالمية، إضافة إلى توفير سيولة مالية تساهم في الحد من العجز في ميزانية السعودية/n/r وحُدِّدت النسبة المتوقع طرحها للاكتتاب بسقف لا يتجاوز خمسة في المائة من أسهم شركة أرامكو/n/r وقال خبراء أن قيمة الشركة ستصل إلى تريليوني دولار أمريكي (2000 مليار دولار)، عند الطرح الأوّلي الذي وُصِفَ – فيما لو تم – بالأعظم في التاريخ، نظرًا إلى حجم الشركة/n/r وكشف محمد بن سلمان أن صندوق الاستثمارات العامة هو من سيدير عملية الاكتتاب، التي من المرجّح أن تكون في سوق الأوراق المالية السعودي في الرياض، أو أحد المراكز المالية الدولية الرائدة في العالم/n/r وكان الرئيس الأمريكي ترمب حثّ ولي العهد السعودي على أن يختار بورصة نيويورك منصة للاكتتاب والتداول، فيما تشير تصريحات المسؤولين السعوديين أن بورصة لندن هي الأقرب/n/r

وكان من المتوقّع أن يبدأ الاكتتاب الأوّلي في النصف الثاني من العام 2018، لكنَّ تقريرًا نُشِر على موقع وكالة رويترز للأنباء في 22 أغسطس 2018، نُسِب إلى مصادر قيل أنّها سعودية، رجّح وقف خطة طرح أرامكو، وهو ما نفته وزارة الطاقة السعودية بعد ساعات، غير أن وزير الطاقة السعودي خالد الفالح كشف عن تأجيل الطرح إلى أجل غير مُسمّى، إذ أكد في بيان الوزارة: «أن الحكومة ما تزال ملتزمة بالطرح الأولي العام لأرامكو السعودية، وفق الظروف الملائمة، وفي الوقت المناسب الذي تختاره الحكومة»/n/r في 3 نوفمبر 2019 أعلن رئيس مجلس إدارة أرامكو موافقة هيئة السوق المالية السعودية على الاكتتاب، وقبلها كانت قد نُشرت تقارير أفادت بموافقة ولي العهد محمد بن سلمان على طرح أرامكو للاكتتاب وأنّه «أعطى الضوء الأخضر لبدء الطرح»، ما أدّى إلى أن تعلن الشركة في 17 نوفمبر 2019، طرح جزء بلغ 1/n/r5% من إجمالي أسهم الشركة للتداول العام، ومع انتهاء فترة الاكتتاب، أصبح اكتتاب أرامكو، أكبر طرح أولي عام في التاريخ، حيث جمع أكثر من 25/n/r6 مليار دولار أمريكي، مُتجاوزًا الرقم القياسي المُسجّل في عام 2014 لمجموعة علي بابا الصينية البالغ حينها 25 مليار دولار/n/r وعند بدء تداول أسهم الشركة في السوق المالية السعودية في 11 ديسمبر 2019، وصلت القيمة السوقية لأرامكو إلى 2 تريليون دولار أمريكي، مزيحة شركة أبل من عرش أكبر الشركات من حيث القيمة في العالم/n/r وقد ارتفع سعر سهم أرامكو بنسبة 10% عند بدء تداوله ليصل إلى 35 ريالًا سعوديًّا، وارتفع سهم الشركة يوم الخميس بنسبة 10% لليوم الثاني على التوالي، ليبلغ سعره 38/n/r7 ريال سعودي أي 10/n/r32 دولار أمريكي للسهم الواحد/n/r كل هذا دفع بالسوق المالية السعودية لتُعزّز موقعها بين الأسواق المالية العالمية لتصبح تاسع أكبر سوق مالية في العالم، ما جعلها تقترب من حجم البورصتين الألمانية والكندية، ومتجاوزة البورصة الهندية/n/r وقد وُصِف اليوم الأوّل للتداول باليوم الذي تحقّق فيه وعد محمد بن سلمان الذي كان قد قطعه منذ أكثر من ثلاث سنوات/n/r

الطاقة النووية

محمد بن سلمان مصافِحًا الرئيس الروسي فلاديمير بوتين
في مقابلة له مع صحيفة الواشنطن بوست، قال محمد بن سلمان أن «لدى المملكة العربية السعودية أكثر من خمسة بالمائة من احتياطيات مادة اليورانيوم في العالم»، واصفًا «عدم استخدامها يشابه الاستغناء عن النفط»/n/r وكانت الحكومة السعودية قد وقعت مع روسيا الاتحادية عددًا من الاتفاقيات في المجال النووي، على رأسها إنشاء 16 مفاعلًا نوويًا، بعد زيارة قام بها محمد بن سلمان إلى روسيا في 18 يونيو 2015، حيث التقى الرئيس الروسي فلاديمير بوتين في مدينة سان بطرسبرغ/n/r وتؤسس الاتفاقية الموقعة للتعاون بين البلدين في المجال النووي، بما في ذلك، «إنشاء واستخدام وتفكيك المفاعلات النووية المخصصة لإنتاج الطاقة، وتقديم الخدمات المتعلقة بمعالجة الوقود النووي المستنفد، وإنتاج النظائر المشعة واستخدامها في الصناعة والطب والزراعة، وتأهيل الكوادر في مجال الطاقة النووية»/n/r

وبعيد تلك الزيارة، وقع محمد بن سلمان مذكرتي تفاهم مع الحكومة الفرنسية - بعد لقاءه الرئيس الفرنسي فرونسوا أولاند - للتعاون في «مجالات إدارة النفايات المشعة بين مدينة الملك عبد الله للطاقة الذرية والمتجددة والمعهد الفرنسي للوقاية من الإشعاعات والسلامة النووية، والتعاون ين مدينة الملك عبد الله للطاقة الذرية والمتجددة والوكالة الفرنسية لإدارة النفايات النووية في مجال تطوير تنظيم الاستخدامات السلمية للطاقة النووية في مجال النفايات النووية»/n/r وكان مجلس الوزراء السعودي قد وافق على الاتفاقية الروسية السعودية في اجتماع له في مارس 2016، ثم أتبع ذلك بالموافقة على «المشروع الوطني للطاقة الذرية السعودية»، الذي رفعه ولي العهد إلى المجلس في 24 يوليو 2017/n/r والخطة الأوّلية للمشروع، ترسمُ ببناء محطة نووية مدنية لإنتاج الطاقة، تتكون من مفاعلين نووين اثنين، ستطرح مناقصة إنشاءها قُبيل نهاية عام 2018، حسبما أُعْلِنَ في السعودية/n/r

النقل
المقالة الرئيسة: وزارة النقل والخدمات اللوجستية
أطلق محمد بن سلمان رئيس اللجنة العليا للنقل والخدمات اللوجستية في 30 يونيو 2021م، الاستراتيجية الوطنية للنقل والخدمات اللوجستية، التي تهدف لترسيخ مكانة المملكة مركزًا لوجستيًا عالميًا يربط القارات الثلاث، والارتقاء بخدمات ووسائل النقل كافة، وتعزيز التكامل في منظومة الخدمات اللوجستية وأنماط النقل الحديثة لدعم مسيرة التنمية الشاملة في المملكة/n/r

وتتضمن الاستراتيجية حزمة من المشروعات الكبرى الممكِّنة لتحقيق المستهدفات الاقتصادية والاجتماعية، واعتماد نماذج حوكمة فاعلة لتعزيز العمل المؤسسي في منظومة النقل، وبما يتفق مع تغير مسمى الوزارة من وزارة النقل إلى وزارة النقل والخدمات اللوجستية/n/r

وقال سمو ولي العهد: «إن هذه الاستراتيجية ستسهم في تعزيز القدرات البشرية والفنية في قطاع النقل والخدمات اللوجستية بالمملكة، وستعزز الارتباط بالاقتصاد العالمي، وتمكن بلادنا من استثمار موقعها الجغرافي الذي يتوسط القارات الثلاث في تنويع اقتصادها؛ من خلال تأسيس صناعة متقدمة من الخدمات اللوجستية، وبناء منظومات عالية الجودة من الخدمات، وتطبيق نماذج عمل تنافسية لتعزيز الإنتاجية والاستدامة في قطاع الخدمات اللوجستية؛ بوصفه محوراً رئيسياً في برامج رؤية المملكة 2030، وقطاعاً حيوياً ممكِّناً للقطاعات الاقتصادية، وصولا لتحقيق التنمية المستدامة»/n/r

تركز الإستراتيجية على تطوير البنى التحتية، وإطلاق العديد من المنصات والمناطق اللوجستية في المملكة، وتطبيق أنظمة تشغيل متطورة، وتعزيز الشراكات الفاعلة بين المنظومة الحكومية والقطاع الخاص لتحقيق أربعة أهداف رئيسة هي:

تعزيز مكانة المملكة كمركز لوجستي عالمي/n/r
الارتقاء بجودة الحياة في المدن السعودية/n/r
تحقيق التوازن في الميزانية العامة/n/r
تحسين أداء الجهاز الحكومي/n/r
وأضاف، أن الإستراتيجية تستهدف النهوض بالمملكة العربية السعودية لتصبح في المرتبة الخامسة عالمياً في الحركة العابرة للنقل الجوي، وزيادة الوجهات لأكثر من 250 وجهة دولية، إلى جانب إطلاق ناقل وطني جديد، بما يمكن القطاعات الأخرى مثل الحج والعمرة والسياحة من تحقيق مستهدفاتها الوطنية، وإضافة إلى ذلك ستسعى الإستراتيجية إلى رفع قدرات قطاع الشحن الجوي من خلال مضاعفة طاقته الاستيعابية لتصل إلى أكثر من 4/n/r5 ملايين طن/n/r

وعلى صعيد النقل البحري، قال: إن الإستراتيجية تستهدف الوصول إلى طاقة استيعابية تزيد على 40 مليون حاوية سنوياً، مع ما يعنيه ذلك من استثمارات واسعة في مجال تطوير البنى التحتية للموانئ وتعزيز تكاملها مع المناطق اللوجستية في المملكة، وكذلك توسيع ربطها بخطوط الملاحة الدولية؛ بحيث تتكامل مع شبكات الخطوط الحديدية والطرق، مما يسهم في تحسين كفاءة خطوط منظومة النقل واقتصادياتها/n/r

وأوضح محمد بن سلمان أن الخطوط الحديدية تقدم خدماتها في قطاع نقل الركاب والبضائع عبر شبكة يبلغ طولها 5330 كم، من بينها 450 كم في مسار الخط الحديدي لقطار الحرمين السريع بين مكة المكرمة والمدينة المنورة، الذي يعد أكبر مشروع للنقل عالي السرعة في المنطقة، كما ستحقق الاستراتيجية زيادة في مجموع أطوال السكك الحديدية المستقبلية تقدر بـ 8080 كم تتضمن مشروع «الجسر البري» بطول يتجاوز 1300 كم الذي ستتجاوز طاقته الاستيعابية 3 ملايين مسافر، وشحن أكثر من 50 مليون طن سنوياً، بهدف ربط موانئ المملكة على ساحل الخليج العربي بموانئ ساحل البحر الأحمر، مع فتح فرص جديدة وواعدة لهذا الخط عبر مروره بمراكز لوجستية حديثة، ومراكز للأنشطة الاقتصادية والمدن الصناعية والأنشطة التعدينية، وتحسين مؤشر الأداء اللوجستي للمملكة لتكون ضمن قائمة الدول العشر الأولى على مستوى العالم/n/r

أكد محمد بن سلمان أن الإستراتيجية تستند على ركائز عالية الأهمية، تشمل كذلك شبكة الطرق الكبرى، التي تعد بلادنا الأولى في ترابطها على مستوى العالم، كما ستكون المملكة - بمشيئة الله - من الدول المتقدمة دولياً على صعيد جودة الطرق وسلامتها، حيث تتضمن الإستراتيجية العديد من المبادرات التي تهدف لخفض أعداد ضحايا الحوادث إلى الحد الأدنى؛ أسوة بأفضل التجارب العالمية، وتحقيق كفاءة الربط وتطوير خدمات النقل العام في المدن السعودية بالتوازي مع تحقيق المستهدفات على صعيد الاستدامة والمحافظة على البيئة وتقليل استهلاك الوقود بنسبة 25%، وتوفير حلول ذكية لتسهيل تنقل المسافرين بين المدن ونقل البضائع وفقا لأحدث التقنيات المطبقة عالمياً/n/r

وأشار إلى أن أحد الأهداف الرئيسية للإستراتيجية يتمثل في زيادة مساهمة قطاع النقل والخدمات اللوجستية في إجمالي الناتج المحلي الوطني، فبينما يبلغ إسهام هذا القطاع حالياً في الناتج المحلي الإجمالي للمملكة حوالي 6%، تستهدف الإستراتيجية زيادة إسهامه إلى 10% من خلال تصدر قطاع النقل والخدمات اللوجستية مراتب متقدمة لدعم الاقتصاد الوطني، وتمكين نمو الأعمال وتوسيع الاستثمارات، وزيادة ما يضخه هذا القطاع من إيرادات غير نفطية بشكل سنوي ليصل إلى حوالي 45 مليار ريال في عام 2030م/n/r

البيئة
المقالة الرئيسة: بيئة السعودية
من أجل تعزيز الجهود البيئية القائمة في المملكة العربية السعودية خلال السنوات السابقة وفق رؤية 2030، ورغبة المملكة الجادّة بمواجهة ما عانته من تحديات بيئية تمثلت في ارتفاع درجات الحرارة وانخفاض نسبة الأمطار وارتفاع موجات الغبار والتصحر، وكجزء من جهودها لتعزيز الصحة العامة ورفع مستوى جودة الحياة للمواطنين والمقيمين فيها، امر الأمير محمد بإعادة هيكلة شاملة لقطاع البيئة، وتأسيس القوات الخاصة للأمن البيئي في عام 2019م، ورفع نسبة تغطية المحميات الطبيعية من 4% إلى ما يزيد عن 14% وزيادة الغطاء النباتي في المملكة بنسبة 40% خلال الأربع سنوات الاخيرة، مما مكن السعودية من الوصول لأفضل مستوى الانبعاثات الكربونية للدول المنتجة للنفط/n/r

خلال فترة ترأس المملكة لمجموعة العشرين لعام 2020، وانطلاقاً من دورها تجاه القضايا الدولية المشتركة، واستكمالاً لجهودها لحماية كوكب الأرض الذي نتج عنه إصدار إعلان خاص حول البيئة وتبني مفهوم الاقتصاد الدائري للكربون، وتأسيس أول مجموعة عمل خاصة للبيئة فيها، وإطلاق مبادرتين دولية للحد من تدهور الأراضي وحماية الشعب المرجانية/n/r

في مارس 2021، أعلن ولي العهد السعودي عن مبادرتين، تتمثل في «مبادرة السعودية الخضراء»، و«مبادرة الشرق الأوسط الأخضر» اللتين سترسمان توجه المملكة والمنطقة في حماية الأرض والطبيعة ووضعها في خارطة طريق ذات معالم واضحة وطموحة وستسهمان بشكل قوي بتحقيق المستهدفات العالمية من خلال رفع مستوى الغطاء النباتي، وتقليل انبعاثات الكربون، ومكافحة التلوث وتدهور الأراضي، والحفاظ على الحياة البحرية/n/r ومن أبرز مستهدفات هذه المبادرات زراعة 10 مليار شجرة داخل السعودية خلال العقود القادمة، ما يعادل إعادة تأهيل حوالي 40 مليون هكتار من الأراضي المتدهورة، ما يعني زيادة في المساحة المغطاة بالأشجار الحالية إلى 12 ضعف، تمثل مساهمة المملكة بأكثر من 4% في تحقيق مستهدفات المبادرة العالمية للحد من تدهور الأراضي والموائل الفطرية، و1% من المستهدف العالمي لزراعة ترليون شجرة/n/r كما ستعمل على رفع نسبة المناطق المحمية إلى أكثر من 30% من مساحة أراضيها التي تقدر بـ (600) ألف كيلومتر مربع، لتتجاوز المستهدف العالمي الحالي بحماية 17% من أراضي كل دولة، إضافة إلى عدد من المبادرات لحماية البيئة البحرية والساحلية/n/r وأوضح ولي العهد أنه بينما لا يزال هناك الكثير الذي يتوجب القيام به إلا أن المملكة مصممة على إحداث تأثير عالمي دائم وانطلاقاً من دورها الريادي، وفيما يخص «مبادرة الشرق الأوسط الأخضر» أعلن الأمير محمد، أن المملكة ستبدأ العمل مع الدول الشقيقة في مجلس التعاون لدول الخليج العربية والشرق الأوسط، وتسعى بالشراكة مع الأشقاء في دول الشرق الأوسط لزراعة 40 مليار شجرة إضافية في الشرق الأوسط، مبينا أن البرنامج يهدف لزراعة (50 مليار) شجرة وهو أكبر برنامج إعادة تشجير في العالم ، وهو ضعف حجم السور الأخضر العظيم في منطقة الساحل (ثاني أكبر مبادرة إقليمية من هذا النوع)/n/r سيعمل هذا المشروع على استعادة مساحة تعادل (200 مليون) هكتار من الأراضي المتدهورة مما يمثل (5%) من الهدف العالمي لزراعة (1 تريليون) شجرة ويحقق تخفيض بنسبة (2/n/r5%) من معدلات الكربون العالمية/n/r

وفي تصريح له قال ولي العهد: «إنه بصفتنا منتجًا عالميًا رائدًا للنفط ندرك تمامًا نصيبنا من المسؤولية في دفع عجلة مكافحة أزمة المناخ، وأنه مثل ما تمثل دورنا الريادي في استقرار أسواق الطاقة خلال عصر النفط والغاز، فإننا سنعمل لقيادة الحقبة الخضراء القادمة/n/r وأضاف، إن المملكة والمنطقة تواجهان الكثير من التحديات البيئية، مثل التصحر، الأمر الذي يشكل تهديدا اقتصاديا للمنطقة (حيث يقدر أن 13 مليار دولار تستنزف من العواصف الرملية في المنطقة كل سنة)، كما أن تلوث الهواء من غازات الاحتباس الحراري يقدر أنها قلصت متوسط عمر المواطنين بمعدل سنة ونصف سنة»/n/r

وأضاف: إن مبادرة السعودية الخضراء ستعمل كذلك على تقليل الانبعاثات الكربونية بأكثر من 4% من المساهمات العالمية، وذلك من خلال مشاريع الطاقة المتجددة التي ستوفر 50% من إنتاج الكهرباء داخل المملكة بحلول عام 2030م، ومشاريع في مجال التقنيات الهيدروكربونية النظيفة التي ستمحي أكثر من 130 مليون طن من الانبعاثات الكربونية، إضافة إلى رفع نسبة تحويل النفايات عن المرادم إلى 94%/n/r

كما أضاف، «أن حصة إنتاج الطاقة النظيفة في الشرق الأوسط لا يتجاوز اليوم 7%، وأن التقنيات التي تستخدم في إنتاج النفط في المنطقة ليست ذات كفاءة، وستعمل المملكة العربية السعودية مع هذه الدول على نقل المعرفة ومشاركة الخبرات مما سيسهم تخفيض انبعاثات الكربون الناتجة عن إنتاج النفط في المنطقة بأكثر من 60%، مضيفا، بأن هذه الجهود المشتركة ستحقق تخفيضاً في الانبعاثات الكربونية بما نسبته أكثر من 10% من المساهمات العالمية»/n/r

في 23 أكتوبر 2021 أطلق ولي العهد، بصفته رئيسا اللجنة العليا للسعودية الخضراء، النسخة الأولى للمنتدى السنوي لمبادرة السعودية الخضراء في الرياض، الذي يعنى بإطلاق المبادرات البيئية الجديدة للمملكة، ومتابعة أثر المبادرات التي تم الإعلان عنها سابقاً، بما يحقق مستهدفات مبادرة السعودية الخضراء/n/r وأعلن عن إطلاق الحزمة الأولى من المبادرات النوعية في المملكة لتكون خارطة طريق لحماية البيئة ومواجهة تحديات التغير المناخي، وتمثل هذه المبادرات استثمارات بقيمة تزيد على (700) مليار ريال، مما يساهم في تنمية الاقتصاد الأخضر، وخلق فرص عمل نوعية، وتوفير فرص استثمارية ضخمة للقطاع الخاص، وفق رؤية المملكة 2030/n/r

وأكد الأمير محمد بدء المرحلة الأولى من مبادرات التشجير بزراعة أكثر من (450) مليون شجرة، وإعادة تأهيل (8) ملايين هكتار من الأراضي المتدهورة، وتخصيص أراض محمية جديدة، ليصبح إجمالي المناطق المحمية في المملكة أكثر من (20%) من إجمالي مساحتها/n/r

مخطط رحلة عبر الزمن
المقالة الرئيسة: رحلة عبر الزمن
في 7 أبريل 2021 أطلق ولي العهد وبصفته رئيس مجلس إدارة الهيئة الملكية لمحافظة العُلا، الرؤية التصميمية لمخطط «رحلة عبر الزمن»، بهدف إحياء وتأهيل المنطقة الأثرية الرئيسة في العُلا بشكل مسؤول ومستدام، حيث يُعد المشروع محطة رئيسية ضمن برنامج تطوير العُلا وتحويلها إلى وجهة عالمية رائدة للفنون والتراث والثقافة والطبيعة، تحقيقًا لمستهدفات رؤية السعودية 2030/n/r

تعزيز الشراكة مع القطاع الخاص
في 30 مارس 2021، دشن ولي العهد برنامج تعزيز الشراكة مع القطاع الخاص (شريك) هو أحد برامج رؤية السعودية 2030، والذي يهدف لتعزيز الشراكة بين القطاعين الخاص والحكومي، والمساهمة في دعم النمو المستدام للاقتصاد الوطني، وتعزيز مرونة وقدرات الشركات الكبرى إقليميا وعالميا، وتمكين الشركات الوطنية الكبرى من تحقيق أهداف وفرص استثمارية، مع اطلاق ما يصل إلى 5 تريليونات ريال من استثمارات القطاع الخاص حتى عام 2030/n/r وجرى تصميم البرنامج لتقديم الدعم عبر عدد من الركائز تشمل التعاون المالي والنقدي والتشغيلي والتنظيمي واستثمار الأصول/n/r

التنمية المستدامة
دعم بقوة برامج التنمية المستدامة، بمجالاتها المختلفة والتي اشتملت على التنمية الاقتصادية، التنمية الاجتماعية وحماية البيئة/n/r وأطلق الكثير من المشاريع والمبادرات، ففي الطاقة المتجددة، أمر باستخدام مصادر طاقة جديدة صديقة للبيئة، تشتمل على طاقة الرياح، طاقة الهيدروجين، والطاقة الشمسية، والتي عادةً ما تكون أكثر استدامة من مصادر الوقود الأحفوري/n/r وأمر بإنشاء البرنامج الوطني للطاقة المتجددة، والذي بدوره قام بطرح عدة مشاريع في مختلف مناطق المملكة، والتي اشتملت على إنشاء محطات تعمل بالطاقة الشمسية في كل من سدير وسكاكا ورفحاء والمدينة المنورة والفيصلية وجدة ورابغ والقريات، ومحطة تعمل بطاقة الرياح في دومة الجندل، ومحطة تعمل بالطاقة الشمسية الهجينة في ضباء/n/r

الاستراتيجية الوطنية للاستثمار
هي إستراتيجية وطنية أطلقها الأمير محمد في 11 أكتوبر 2021، وتعد أحد الممكنات الرئيسة لتحقيق مستهدفات رؤية السعودية 2030/n/r وستسهم الاستراتيجية في دعم نمو الاقتصاد الوطني وتنويع مصادره ورفع إسهام القطاع الخاص في الناتج المحلي الإجمالي إلى 65%، وتعزيز الاستثمار الأجنبي المباشر إلى 5/n/r7% من الناتج المحلي الإجمالي، وزيادة نسبة الصادرات غير النفطية من 16% إلى 50% من إجمالي الناتج المحلي غير النفطي، وتخفيض معدل البطالة إلى 7%، وتقدُّم المملكة إلى أحد المراكز العشرة الأوائل في مؤشر التنافسية العالمي بحلول عام 2030م، وتشمل الإستراتيجية تطوير خطط استثمارية تفصيلية لعدة قطاعات منها الصناعة، والطاقة المتجددة، والنقل والخدمات اللوجستية، والسياحة، والبنية التحتية الرقمية، والرعاية الصحية/n/r

وتهدف الاستراتيجية إلى رفع صافي تدفقات الاستثمار الأجنبي المباشر إلى 388 مليار ريال سنوياً، وزيادة الاستثمار المحلي ليصل إلى حوالي 1/n/r7 تريليون ريال سنوياً بحلول عام 2030 مما يسهم في ارتفاع نسبة الاستثمار إلى الناتج المحلي الإجمالي للمملكة من 22% في عام 2019م إلى 30% في عام 2030م، وبالتالي نمو الاقتصاد السعودي ليصبح من أكبر 15 اقتصاداً عالميًا/n/r

السياسة الخارجية
يشير مراقبون أن السياسة السعودية في عهد محمد بن سلمان - بصفته وزيرًا للدفاع ووليًا للعهد - التي وصفتها بعض الجهات بـ«الاندفاع والتسرّع»، تعد اليوم «سياسة أكثر جرأة واستقلالية» وواقعية بالنسبة لقضايا المنطقة/n/r فالرياض حسبما يقول المتابعون، «كثّفت كل جهودها من أجل وقف التغلغل الإيراني في المنطقة»، و«لم تتأخّر عن التدخّل العسكري المباشر في اليمن لوقف الحوثيين عن السيطرة على البلد»، إضافة إلى أنّها أصبحت أقرب إلى المقاربة الروسية بالنسبة لملف الأزمة السورية بعدما كانت تطالب الرئيس السوري بشار الأسد بالرحيل من الحكم/n/r من جهة أخرى أصبحت الدبلوماسية السعودية أكثر نشاطا دوليًا، على صعيدين، الأوّل من أجل ما تقول أنّه «مكافحة الجماعات الإسلامية ووقف التطرّف» بـ«نزع الشرعية الدولية عن نشاط تلك المجاميع في العالم» بعدما ضيّقت على القيادات والكوادر المرتبطة بتلك الجماعات في الداخل السعودي، والآخر من أجل «محاصرة إيران لوقف مشروعها التوسعي في المنطقة»/n/r

إيران
المقالات الرئيسة: صراع إيران والسعودية بالوكالة وبرنامج إيران النووي والعلاقات الإيرانية السعودية
من وجهة نظر الباحثين، فإن العلاقة بين المملكة العربية السعودية والجمهورية الإسلامية في إيران شابتها توتّرات عديدة منذ قيام الثورة الإسلامية الإيرانية في العام 1979، حيث رُفِعَ شعار تصدير الثورة إلى المحيط العربي لإيران والتي قابلها دعم خليجي وعربي للعراق طيلة السنوات الثمانية للحرب العراقية الإيرانية، ثم ساءت العلاقة بين البلدين إلى درجة كبرى بُعيد الغزو الأمريكي للعراق في العالم 2003، الذي وُصِفَ بأنّه أثمن هدية أمريكية يمكن أن تقدّم إلى طهران، حيث فكّكت الدولة العراقية وحلّ الجيش العراقي من جانب الولايات المتحدة و«قدّمت بغداد على طبق من ذهب إلى إيران بقرار سحب القوات الأمريكية من العراق» على حد وصف المراقبين، وهو ما اعتبر بحسب محمد بن سلمان «أكبر خطأين اقترفتهما أمريكا في المنطقة»، ومما زاد التوتّرات بين الرياض وطهران، بدايةً استمرار تقديم إيران الدعم العسكري لحزب الله اللبناني الذي يقول أنّه ذراع الولي الفقيه في لبنان، خاصة بعد أحداث 7 أيار 2008، حيث قام الحزب بالزحف العسكري على بيروت، ما وصف بأنّه احتلال للمدينة، حيث عطّل الحياة السياسية في الجمهورية اللبنانية، مرورًا بما يوصف بالتدخّل الإيراني في الدول العربية، خاصة الخليجية منها، وصولًا إلى تدخّل إيران عسكريًا مع حلفائها في الحرب الأهلية السورية من جهة، ومن جهة أخرى تدخل قوات درع الجزيرة في البحرين بقيادة السعودية، لإجهاض ما سُمي بمحاولة إيران لقلب نظام الحكم في مملكة البحرين، غير أن تدهور العلاقة بحسب المتابعين، أخذ منحى دراماتيكيًا جدًا – وخرج من إطار الحرب بالوكالة بين البلدين – منذ قيام حركة أنصار الله الحوثية في اليمن - المدعومة من إيران - في سبتمبر من العام 2014، بمشروع السيطرة على الأوضاع في الجمهورية اليمنية، التي توصف بأنّها خاصرة الجزيرة العربية، قابله تدخل عسكري دولي بقيادة السعودية في اليمن، لصدّ تمدّد الحوثيين في مارس من العام 2015، ما عدَّ أوّل عملية عسكرية سعودية مباشرة، لوضع حدٍّ للتدخّلات الإيرانية في الوطن العربي، حيث برز فيها اسم محمد بن سلمان بصفته وزيرًا للدفاع السعودي، إذ تولّى قيادة قوات التحالف الدولي في إطار عملية عاصفة الحزم، مُشرفًا على الضربة العسكرية الأولى الموجّهة ضد الحوثيين في اليمن، ما صعّد من وتيرة الخلافات بين الجانبين، إلى أن انقطعت العلاقات الدبلوماسية بين البلدين كليًا، على خلفية إحراق البعثات الدبلوماسية السعودية في إيران في بداية العام 2016، وكان - قبلها بشهر تحديدًا - قد انتشر في الإعلام الدولي تقرير مُسرّب من دائرة الاستخبارات الاتحادية الألمانية، تناول السياسة العسكرية السعودية بقيادة محمد بن سلمان في مواجهة إيران، حيث أشير في التقرير إلى ما وُصِفَ بـ«سياسة الدبلوماسية الحذرة» للسعودية قد استُبْدِلت بـ«سياسة تدخّل متسرّعة واندفاعية»، وأضيف في التقرير أن «الرياض في عهد الملك سلمان، أصبحت أكثر اندفاعًا في مواجهة التوسّع الإيراني في المنطقة»، والسياسة السعودية التي وُصِمت في التقرير بـ«الاندفاع»، فسّرها مراقبون بأنّها أصبحت «أكثر جرأة» وأخذت المبادرة والقيادة في شؤون الدفاع عن المنطقة العربية من دون الرجوع إلى الدول الغربية، وهو ما أزعج بعض الدول، في حين رأى آخرون، على رأسهم وزارة الخارجية الإيرانية، أن السياسة السعودية الجديدة أصبحت «متهوّرة» على حد تعبير وزير الخارجية الإيرانية محمد جواد ظريف/n/r وقد استُقْبِلَ في إيران خبرُ تعيين محمد بن سلمان في منصب ولي ولي العهد ثم توليه منصب ولاية العهد في المملكة العربية السعودية بانتقادات وترقّب، وعدَّته إحدى الصحف الرسمية بمثابة إعلان حرب على إيران في المنطقة/n/r وفي سلسلة تصريحات لافتة كشفت عن انعدام نقاط التفاهم بين الرياض وطهران، منذرة بنقل الصراع إلى الداخل الإيراني، قال محمد بن سلمان في 3 مايو 2017: «أن السعوديين لن ينتظروا حتى تصبح المعركة في السعودية»، مضيفًا: «نعمل على أن تكون المعركة لديهم في إيران وليس في السعودية»، ما فُهم على أنّه تهديد سعودي جدّي باستمالة القوميات المضطهدة في إيران، حيث تشكّل القوميات غير الفارسية ما بين أربعين إلى ستين بالمائة من مجموع السكان هناك، حين سُئِلَ عن مدى ما تشكله إيران من خطر على السعودية، قال محمد بن سلمان: «أن إيران لا تشكّل الخطر الأكبر على السعودية»، ذلك أنّها بحسب تعبيره: «ليست منافسا للسعودية»، معتبرًا أن الجيش الإيراني ليس ضمن أقوى خمسة جيوش في العالم الإسلامي، مضيفًا أن الاقتصاد السعودي أكبر من الاقتصاد الإيراني، خاتما حديثه بالقول: «إيران بعيدة جدًا عن أن تكون مساوية للسعودية»، لكنّه أكّد على أن: «إيران هي العدو الأكبر للمنطقة»، لما تمارسه من «إرهاب وتوسّع في البلدان العربية» على حد وصفه، قائلًا أن «الحرب بين السعودية وإيران إذا ما اندلعت ستكون كارثة كبرى»، واصفًا المرشد الأعلى الإيراني علي خامنئي بـ«هتلر الشرق الأوسط الجديد» الذي يجب مواجهته عالميًا، ذلك على خلفية مواجهة التدخّلات الإيرانية في المنطقة، وهي التدخلات التي بنى رئيس الوزراء اللبناني سعد الحريري استقالته عليها في كلمة متلفزة بثت من الرياض في 4 نوفمبر 2017 عبر فيها عن خشيته من الاغتيال، استقالة رفضها الرئيس اللبناني ميشال عون، بينما اتهم الأمين العام لحزب الله حسن نصر الله السعودية بإجباره عليها، وهي اتهامات ردها الحريري في أكثر من مناسبة/n/r وقد دفعت محاولات ولي العهد السعودي التحذير من البرنامج النووي الإيراني، الصراع بين البلدين إلى مرحلة متقدمة على الصعيد الدولي، حيث اتهم مسؤولون إيرانيون ولي العهد السعودي بأنّه وراء قرار الرئيس الأمريكي دونالد ترمب إلغاء الاتفاق النووي الإيراني في 9 مايو 2018، وأضافوا أن تصريحات ولي العهد السعودي حول «المشاريع التوسعية والتخريبية الإيرانية» في المنطقة «مزاعم لا أساس لها من الصحة»، ودعوا القيادة السعودية إلى الاتعاظ مما أسموه «مصير صديقهم وحليفهم صدام»، الرئيس العراقي الذي أعِدم في العراق/n/r


محمد بن سلمان مع الرئيس الأمريكي دونالد ترمب في الرواق الغربي للبيت الأبيض/n/r
وكان محمد بن سلمان في مقابلة له مع قناة سي بي إس نيوز الأمريكية في 16 مارس 2018، قد هدّد بأن تتجه المملكة العربية السعودية إلى تحويل برنامجها النووي المدني إلى برنامج نووي عسكري لإنتاج سلاح نووي فيما لو أقدمت إيران على إنتاج قنبلة نووية/n/r داعيا في مقابلة مع صحيفة الواشنطن بوست في 26 مارس 2018 «الولايات المتحدة الأمريكية إلى وضع قوانين وقواعد للتأكد من عدم إساءة استخدام اليورانيوم المخصّب»، في إشارة منه إلى الاتفاق النووي الإيراني الذي يتيح لإيران الاستمرار في عمليات تخصيب اليورانيوم لمدّ البرنامج النووي الإيراني بالوقود النووي، بالإضافة إلى السماح للإيرانيين بمواصلة البحث والتطوير لإنتاج أجهزة الطرد المركزي، وهو ما عدّ من الجانب السعودي، ثغرة تسمح للإيرانيين بالحصول على التقنية اللازمة لإنتاج السلاح النووي/n/r ثم طالب في مقابلة أجرتها معه صحيفة نيويورك تايمز في 28 مارس 2018، بإلغاء الاتفاق النووي الإيراني فورًا واستبداله بآخر يضمن عدم حصول طهران على أسلحة دمار شامل، مشبّها ذلك الاتفاق بمعاهدة ميونخ، التي عدّها المؤرخون سببًا باشتعال الحرب العالمية الثانية، بعد أن سمحت لألمانيا النازية بقيادة أدولف هتلر بالتوسّع في أوروبا/n/r وبحسب مراقبين، توّجت تحرّكات محمد بن سلمان هذه، باتخاذ الرئيس الأمريكي دونالد ترمب قرار إلغاء الاتفاق النووي في 9 مايو 2018، وهو القرار الذي جاء بعد زيارة طويلة قام بها ولي العهد السعودي إلى الولايات المتحدة، التقى فيها الرئيس الأمريكي في البيت الأبيض في 20 مارس 2018، منتقدًا الاتفاق النووي الإيراني/n/r أعقب الانسحاب الأمريكي من الاتفاق النووي تفجر الصراع الإيراني السعودي في لبنان واليمن حيث أخذ الحوثيون بدعم من حزب الله، يضربون الداخل السعودي بطائرات مسيرة إيرانية، وكانت الهجمات على منشآت أرامكو السعودية في 14 سبتمبر 2019، أكبر ضربة توجه للسعودية، وهي وإن تبنّاها الحوثيون أشارت كل من الحكومتين الأمريكية والسعودية إلى ضلوع إيران فيها، وهو ما أكده التقرير الصادر عن فريق محققي الأمم المتحدة/n/r وأشاد قائد فيلق القدس الإيراني قاسم سليماني في تغريدة له على تويتر بالحوثيين الذين عدّهم فرعًا من فروع حرس الثورة الإسلامية الإيرانية/n/r بعد نحو 111 يومًا وجهت الولايات المتحدة ضربة جوبة لموكب قاسم سليماني حيث قُتل في محيط مطار بغداد الدولي في 3 يناير 2020، في عملية باركتها الخارجية السعودية/n/r وعلى هذه الخلفية من الانقطاع الدبلوماسي والصراع الإقليمي بدأت الدولتان سلسلة مفاوضات برعاية عراقية، انطلقت جولتها الأولى في 9 أبريل 2021 في بغداد، وهي مفاوضات تلاها حديث لولي العهد في 27 أبريل 2021، قال فيه: «إيران دولة جارة، نطمح أن يكون لدينا معها علاقة جيدة /n/r/n/r/n/r وألا تصبح الأوضاع في إيران صعبة، بل العكس نريد أن تكون إيران مزدهرة»، غير أن «الإشكالية هو في السلوك السلبي لطهران في المنطقة، إن كان عبر برنامجها النووي أو الصاروخي أو دعمها لمليشيات خارجة عن القانون»، مشيرًا إلى أن السعودية تعمل مع شركائها الدوليين لإيجاد حلول لهذه الإشكاليات/n/r

الأزمة اليمنية
المقالات الرئيسة: الحرب الأهلية اليمنية (2015-الآن) والتدخل العسكري في اليمن
في سبتمبر 2014، بدأ الحوثيون – بعد خروجهم من معقلهم في صعدة – بالانتشار بشكل سريع في اليمن، فأتمّوا السيطرة على العاصمة اليمنية صنعاء، حيث احتلوا دار الرئاسة هناك، ووضعوا الرئيس اليمني عبد ربه منصور هادي تحت الإقامة الجبرية، ثم أجبروه على تقديم الاستقالة، وأخذوا قرارًا بتعطيل الدستور، زاحفين عسكريًا على مجمل الأراضي اليمنية، وبفرار الرئيس هادي إلى مدينة عدن - التي أعلنها عاصمة مؤقتة - أعلن بصفته رئيسا للجمهورية، التعبئة العسكرية العامة والحرب على الحوثيين، مقدّمًا طلبًا رسميًا باسم الحكومة اليمنية، دعا فيه قوات درع الجزيرة إلى التدخل في اليمن، وهو ما تم من خلال تشكيل تحالف من عدد من الدول العربية باسم التحالف العربي، أطلق عملية عسكرية بقيادة السعودية، تحت مسمّى عاصفة الحزم، قام محمد بن سلمان بالإشراف على الضربة العسكرية الأولى التي وجهت لما تسمى «معاقل الحوثيين» في اليمن/n/r وتشير التقارير إلى ارتفاع نسبة سيطرة قوات الشرعية الحكومية اليمنية على الأراضي اليمنية، من قرابة الصفر في المائة قبل بدء عملية عاصفة الحزم، إلى نسبة ما بين ثمانين إلى خمسة وثمانين في المائة، وهو ما عدّ انتصارا لقوات الشرعية بمساندة التحالف/n/r غير أن منظمات حقوقية دولية لم تخف انتقاداتها للحرب الدائرة في اليمن، حيث وجّهت إلى كل من الحوثيين وطيران التحالف العربي اتهامات بقصف أهداف مدنية، في عمليات، وصفتها بأنّها قد ترقى إلى جرائم حرب، مطالبة المجتمع الدولي بالتحقيق في تلك الأحداث، وقد علّق محمد بن سلمان على بعض تلك التقارير قائلًا أن «الأخطاء واردة في أي عملية عسكرية»، لكنّها إن حدثت من جانب المملكة أو دول التحالف فهي أخطاء غير متعمّدة وغير مقصودة/n/r وكان الحوثيون قد أعلنوا أنّهم يعملون على أن تكون الحرب في اليمن، حرب استنزاف للتحالف، وذلك بعيد إعلان التحالف العربي التدخّل العسكري في الحرب في اليمن، وهي الحرب التي وصفها محمد بن سلمان أن قرار دخولها لم يكن خيارًا بل كان اضطرارًا، وأن الخيارات في اليمن كانت بين «سيئ وأسوأ» على حد وصفه، مضيفًا أن التدخّل هناك حال دون أن ينقسم البلد بين الحوثيين وتنظيم القاعدة/n/r

الأزمة السورية
المقالات الرئيسة: الأزمة السورية والتدخل السعودي في الحرب الأهلية السورية
فيما يتعلق بالأزمة السورية، يقول مراقبون أن محمد بن سلمان فجَّر مفاجئة، حين أعرب عن اعتقاده بقرب انتهاء أجل الصراع في سوريا وببقاء الرئيس السوري بشار الأسد في الحكم مع تضائل فرص تنحيته، في إشارة إلى تغيّر موقف السعودية تجاه الملف السوري، مطالبًا من جهة روسيا بأن يكون لديها نفوذ قوي ومباشر في سوريا، وأن تعمل على تقوية وتمكين النظام السوري لتقليل النفوذ الإيراني، وأن تحافظ دمشق على آيديولوجيتها، وأن يقوّي بشار الأسد نظامه – أمام المد الإيراني– لئلا يصبح الرئيس السوري «دمية بيد إيران» على حد تعبيره، معربًا عن اعتقاده أن مصالح الرئيس السوري هي «ألا يدع الإيرانيين يفعلون ما يريدون فعله (في سوريا)»، ومن جهة أخرى مطالبًا أمريكا بأن تُبقي على وجودها العسكري في الشرق السوري لتقطع الطريق على المشروع الإيراني في المنطقة/n/r جاء حديث ولي العهد السعودي في مقابلة مع مجلة تايم في 30 مارس 2018، عند تواجده في الولايات المتحدة الأمريكية وعقب أيام من لقائه الرئيس الأمريكي ترمب في البيت الأبيض، قائلًا: «لا أعلم إن كان بعض الأشخاص سيغضبون حينما أجيب عن ذلك السؤال، لكنني لا أكذب، أعتقد أن الكذب على الناس أمرٌ مُخزٍ فعلًا، وخصوصًا في العام 2018، حيث يكاد يكون أمرًا مُستحيلًا أن تُخفي شيئًا عن الناس، أعتقد أن (الرئيس السوري) بشار (الأسد) باقٍ في الوقت الحالي، وأن سورية تُمثل جزءًا من النفوذ الروسي في الشرق الأوسط لمدة طويلة جدًا»، مضيفًا: «لا أعتقد أنه سيرحل من دون حرب، ولا أعتقد أنه يوجد أي أحد يريد أن يبدأ هذه الحرب، لما ستحدثه من تعارض بين الولايات المتحدة وروسيا، ولا أحد يريد رؤية ذلك»/n/r وحين سُئِلَ عن رأيه حول فكرة سحب أمريكا لقواتها من سوريا، وهي رغبة الرئيس الأمريكي ترمب، قال محمد بن سلمان: أنّه يعتقد أن على القوات الأمريكية «أن تبقى (في شرق سوريا) على المدى المتوسط على الأقل، إن لم يكن على المدى الطويل، ذلك لأن الولايات المتحدة تحتاج لأن تمتلك أوراقًا للتفاوض وممارسة الضغط»، لافتًا إلى أنه: «في حال إخراج تلك القوات فأنك ستخسر تلك الأوراق، هذا أولًا، أمّا ثانيًا فأنت تحتاج إلى نقاط تفتيش في الممر بين حزب الله (اللبناني) وإيران، لأنك إن أخرجت هذه القوات من شرق سوريا فستخسر نقطة التفتيش تلك، وسيساهم ذلك الممر في تصعيد أمور أخرى في المنطقة»/n/r وفي مارس 2023، بدأت المملكة العربية السعودية محادثات لإعادة سوريا إلى جامعة الدول العربية، وقدمت الدعم الاقتصادي بعد زلزال قهرمان مرعش 2023 في 6 فبراير والذي حدث في سوريا وتركيا/n/r وفي مايو 2023 حضر الرئيس السوري بشار الأسد قمة الجامعة العربية في جدة حيث استقبله محمد بن سلمان فيها/n/r

القضية الفلسطينية
المقالة الرئيسة: القضية الفلسطينية
في حوار له مع مجلة ذا أتلانتيك الأمريكية، نُشِر في 2 أبريل 2018، حول رؤيته للصراع العربي الإسرائيلي ومستقبل العلاقات العربية مع إسرائيل، قال محمد بن سلمان أن المملكة العربية السعودية لا يمكن أن يكون لها أي علاقة مع إسرائيل قبل الوصول إلى سلامٍ عادلٍ ومُنْصِفٍ تُحلُّ بموجبه القضية الفلسطينية في إطار حلِّ الدولتين، كاشفًا عن مخاوف دينية حول مصير المسجد الأقصى في القدس وحول حقوق الشعب الفلسطيني، جاء ذلك في معرض ردّه على سؤال حول «حق الشعب اليهودي في أن تكون له دولة» قائلا:«أعتقد عمومًا أن كل شعب، في أي مكان، له الحق في العيش في بلده المسالم/n/r أعتقد أن الفلسطينيين والإسرائيليين لهم الحق في امتلاك أرضهم الخاصة، لكنّه يجب أن يكون لدينا اتفاق سلامٍ عادلٍ ومُنصفٍ لضمان الاستقرار للجميع ولإقامة علاقات طبيعية بين الشعوب»/n/r وكان ولي العهد السعودي قد وصف قرار الرئيس الأمريكي دونالد ترمب إعلان القدس عاصمة إسرائيل، ونقله السفارة الأمريكية إلى القدس بـ«المؤلم»/n/r ويقول مراقبون أن ولي العهد السعودي حسب هذه الرؤية لا يخرج عن الإجماع العربي حول القضية الفلسطينية، وقد تأكد ذلك من مخرجات القمة العربية في الظهران، التي عُقِدَت بعد هذا اللقاء بأيام، وأطلقَ الملك سلمان بن عبد العزيز عليها اسم «قمة القدس»، إذ تمسّكت القمة برئاسة السعودية بحل الدولتين وفق مبادرة السلام العربية، ينص على أن تكون القدس الشرقية عاصمة لدولة فلسطينية على حدود 1967/n/r

الصين
تعد الصين أكبر شريك تجاري للسعودية وفقًا لإحصاء وكالة الجمارك الصينية لعام 2021، إذ بلغ التبادل التجاري بينهما نحو 87/n/r3 مليار دولار، مقابل 67/n/r1 مليار دولار أمريكي في 2020، بزيادة بلغت 30 في المائة، بينما بلغ حجم التبادل التجاري بين البلدين في عام 2014، نحو 66 مليار دولار أمريكي، وذلك قبل عام من وصول الملك سلمان بن عبد العزيز إلى الحكم/n/r بدأت ملامح التوجه السعودي نحو الشرق والصين تحديدًا تتشكل سريعًا بعد أن حَوّلت الإدارة الأمريكية إبان رئاسة باراك أوباما دفة أولوياتها الإستراتيجية بعيدًا عن الشرق الأوسط والخليج العربي، لتشهد العلاقات السعودية الصينية منذ ذلك الحين تطورًا أخذ بالتصاعد بزيارة الرئيس الصيني للرياض في 19 يناير 2016، حيث رفع الجانبان مستوى العلاقات الثنائية بين البلدين إلى مستوى «الشراكة الإستراتيجية الشاملة»، بعد إعلان رغبتهما المشتركة في توثيق التعاون بينهما ليصل لمستوى أعلى في مختلف المجالات «السياسية والاقتصادية والتجارية والثقافية والإنسانية والعسكرية والأمنية والطاقة وعلى المستويين الإقليمي والدولي»/n/r وعُززت العلاقات أكثر بزيارة الأمير محمد بن سلمان للصين على رأس وفد حكومي من 300 شخص ضمن أعمال قمة مجموعة العشرين التي انعقدت في مدينة هانغتشو شرقي الصين في 4 سبتمبر 2016، إذ شدّد على أهمية العلاقات السعودية الصينية، في ظل اتساع رقعة المصالح المشتركة بين البلدين وتقارب وجهات نظرهما في الكثير من الشؤون الدولية، مشيرًا إلى أن الاقتصاد والتجارة في البلدين يمكن أن يكمل بعضهما الآخر، وذلك بعد أشهر من إطلاقه لرؤية السعودية 2030، وجائت زيارة الملك سلمان بن عبد العزيز لبكين في 15 يناير 2017 التي رافقه فيها وفد حكومي ضم ألف شخص في مُستهل جولة آسيوية استغرقت شهرًا، ووقعت فيها القيادة السعودية مع القيادة الصينية على اتفاقات بقيمة تجاوزت 65 مليار دولار أمريكي، لتُعمق الشراكة بين البلدين في مسعى وُصِف بالعملي لدمج مبادرة الحزام والطريق مع رؤية السعودية 2030، في حين وُصِفت زيارة محمد بن سلمان إلى بكين في 21 فبراير 2019 بأنها «مواصلة لخلق حقبة جديدة من العلاقات بين البلدين»، حيث وقع الجانبان خلالها على 35 اتفاقية بقيمة تزيد عن 28 مليار دولار أمريكي، وتضمنت خطة لإدراج اللغة الصينية مادة اختيارية في جميع مراحل التعلیم العام والجامعي في السعودية، لزيادة الروابط التجارية والثقافية بين البلدين/n/r وفي ختام زيارته للصين، قال محمد بن سلمان إن: «المملكة العربية السعودية تلتزم بشدة بسياسة الصين الواحدة»، مضيفًا أن «للصين الحق في اتخاذ التدابير لمكافحة الإرهاب والتطرف حماية لأمنها القومي»/n/r وقد رُدَّ هذا التقارب والنمو المطرد للعلاقات بين البلدين إلى التزام الدولتين بمبدأ الاحترام المتبادل للسيادة وعدم الإضرار بسلامة ووحدة أراضيهما وعدم التدخل في السياسات الداخلية لبعضهما البعض وعدم التدخل في القيم المجتمعية لكلا البلدين، ودعمهما للتعددية القطبية وقضية إصلاح مجلس الأمن الدولي/n/r

لم تختزل هذه الزيارات والاتفاقات على الجانب الاقتصادي وحسب، بل اتخذت بعدًا أمنيًا بشأن التعاون في مكافحة الإرهاب، وبعدًا عسكريًا كُشفت بعض جوانبه، ومنها اتفاق سعودي صيني توصل إليه الطرفان في 5 مارس 2022، لبناء مصنع للطائرات دون طيار في السعودية، وصفقات تسليح وفقًا لصحيفة وول ستريت جورنال/n/r وكانت شبكة سي إن إن الأمريكية قد نشرت في 5 يونيو 2019، تقريرًا سريًّا استند على ثلاثة مصادر استخباراتية، يفيد أن السعودية بدأت تطور برنامجها الخاص للصواريخ البالستية بمساعدة صينية، وقد خلصت المعلومات الاستخباراتية الأمريكية إلى أن السعودية وسعت بنيتها التحتية والتقنية للصواريخ البالستية عبر عمليات شراء حديثة من الصين، ورغم أن أهداف البرنامج الصاروخي السعودي لم تتضح في التقارير الاستخباراتية، إلا إن مصدرًا أوضح أن هذه الخطوة تعزز جهودًا محتملة للسعودية لدعم برنامجها النووي العسكري متى ما حازت على رأس نووي حربي، وهي خطوة فُسرت بأنها تنفيذ لتحذيرات أطلقها محمد بن سلمان في مقابلة سابقة له مع قناة سي بي إس نيوز الأمريكية في 16 مارس 2018، حين هدّد بتحويل البرنامج النووي المدني السعودي إلى برنامج نووي عسكري لإنتاج سلاح نووي فيما لو أتيح لإيران إنتاج قنبلة نووية، ولم تؤكد السعودية صحة هذه التقارير إلا إن الصين أعلنت أن شراكتها الإستراتيجية ومنها العسكرية مع الرياض، لا تنتهك أي قانون دولي، وقد دفعت هذه الشراكة بمدير وكالة المخابرات المركزية الأمريكية وليام بيرنز أن يزور السعودية سرًا للاجتماع مع الأمير محمد بن سلمان في محاولة لإصلاح العلاقات الأمريكية السعودية ولبحث مجالات عدة، على رأسها تنامي العلاقات السعودية الصينية في الجانبين الاقتصادي والعسكري، وقد أجري الاجتماع في منتصف أبريل 2022 في جدة، وفقًا لتقرير نشرته صحيفة وول ستريت جورنال في 3 مايو 2022/n/r

الولايات المتحدة
إدارة ترمب
المقالة الرئيسة: قمة الرياض 2017

محمد بن سلمان مع الرئيس الأمريكي دونالد ترمب في المكتب البيضاوي/n/r
توصف العلاقات الأمريكية السعودية بأنّها «تاريخية» و«إستراتيجية» بعد حلف بدأ في العام 1940، إلّا أنّ العلاقات بين البلدين، بحسب المراقبين، شهدت الكثير من التوتّرات الدبلوماسية، إبّان عهد الرئيس الأمريكي باراك أوباما، الذي اتّهم من جانب أطراف خليجية، بأنّه سعى إلى تحسين العلاقات الأمريكية الإيرانية على حساب «العلاقات الأمريكية العربية» و«الأمريكية الخليجية»، ذلك بعد انكشاف المفاوضات السرية بين واشنطن وطهران، والتي أدّت إلى توقيع الاتفاق النووي الإيراني، الذي نال انتقادات واسعة من دول الخليج العربية/n/r وكان الرئيس الأمريكي أوباما، في مقابلة له مع مجلة ذا أتلانتيك الأمريكية، نُشّرت في أبريل 2016، في معرّض ردّه على سؤال، عمّا إذا كانت السعودية دولة صديقة لأمريكا، أجاب: «الأمر معقّد»، مضيفًا: «دول مجلس التعاون الخليجي بحاجة إلى مشاطرة إيران في الشرق الأوسط»، ما فُهِم على أنّه بمثابة ضوء أخضر أمريكي إلى طهران، يمنحها حرية التصرّف دون رادع في المنطقة، ما أدّى إلى تدهور غير مسبوق في «العلاقات الأمريكية السعودية»، وتحوّلها من علاقة كانت توصف بـ«الوثيقة والدافئة»، إلى أخرى «مشحونة»/n/r

إلا أنّ العلاقات، سرعان ما بدأت تعود إلى طبيعتها، بُعيد انتخاب دونالد ترمب رئيسًا للولايات المتحدة الأمريكية، الذي أعلن أكثر من مرة أنّه يريد مكافحة التوسّع الإيراني في الشرق الأوسط، وتمزيق الاتفاقية النووية مع إيران، التي طالما وصفها بأنّها «كارثية»، وهي النقاط التي يرى المراقبون أنّها عادت وجمعت الطرفين الأمريكي-السعودي؛ فأصبح محمد بن سلمان -حين كان وليًا لولي العهد- أوّل مسؤول سياسي عربي يلتقي الرئيس الأمريكي ترمب في البيت الأبيض، في 14 مارس 2017 (بعد تولي الأخير منصب الرئاسة بشهرين)، حيث أقام ترمب مأدبة غداء لمحمد بن سلمان، قائلًا لأعضاء فريقه في البيت الأبيض: «أعتقد أن لدينا شريكًا قويًا»/n/r وقد وُصِفَ الاجتماع بين الرجلين بأنّه «نقطة تحوّل تاريخية في مسار العلاقات بين البلدين»، عكس وجود تطابق كبير في وجهات النظر والأهداف بين المملكة العربية السعودية وأميركا تجاه إيران/n/r وفي 4 مايو 2017، أعلن ترمب من حديقة البيت الأبيض: أن «أوّل محطة خارجية لي كرئيس للولايات المتحدة ستكون إلى السعودية»، حيث حطّت طائرته الرئاسية في الرياض في 20 مايو 2017، لحضور قمة الرياض، التي التقى فيها بالملك سلمان، وشهدا معًا توقيع اتفاقيات بين الجانبين الأمريكي-السعودي، سمّيت بـ«اتفاقية الرؤية الإستراتيجية المشتركة» بحجم استثمارات تجاوزت قيمتها 400 مليار دولار أمريكي، ووصفت بأنّها اتفاقية «تاريخية وغير مسبوقة»/n/r وفي 20 مارس 2018، عاد محمد بن سلمان -بعد أن أصبح وليًا للعهد- إلى زيارة البيت الأبيض ملتقيًا بترمب، مطالبًا من واشنطن بـ«إنهاء الاتفاق النووي فورًا»، وهو ما تم في 9 مايو 2018، بعد قرار الرئيس الأمريكي ترمب انسحاب الولايات المتحدة الأمريكية من الاتفاق النووي، وإعادة العقوبات على إيران/n/r

وتجمع محمد بن سلمان علاقات - توصف بالوثيقة - مع جاريد كوشنر (زوج إيفانكا ترمب، ابنة الرئيس الأمريكي دونالد ترمب)، تعرضت في بعض الأحيان لانتقادات في واشنطن، بسبب «تجاوزها للقنوات الدبلوماسية المعتادة»/n/r

إدارة بايدن
كانت العلاقات بين السعودية وجو بايدن متوترة منذ أن كان نائبًا للرئيس إبّان رئاسة باراك أوباما، خاصة بعد أن وصمها بدعم الإرهاب بالتدريب والسلاح والمال من جانب، ومن جانب آخر حين شبه التحالف الأمريكي السعودي بالتحالف الأمريكي السوفيتي إبّان رئاسة ستالين، وهي تصريحات عاد واعتذر عنها لاحقًا واصفًا إياها بأنها «هفوة دبلوماسية» غير مقصودة، ورغم أن الجانبين الأمريكي والسعودي أعلنا طي المسألة، إلا إن العلاقات بين البلدين دخلت منعرجًا حادًا حين وقعت واشنطن وطهران على الاتفاق النووي الذي كان بايدن نصيرًا له ضمن إدارة أوباما، ولم تخف السعودية امتعاضها من هذا الاتفاق، إذ قال الأمير بندر بن سلطان إنه سيُتيح لإيران امتلاك قنبلة ذرية، وسيجعلها «تعيث فسادًا في الشرق الأوسط الذي يعيش بالفعل أجواء كارثية أصبحت إيران فيه لاعبًا رئيسيًا في زعزعة استقرار[ه]»، تزامن ذلك التقارب الأمريكي الإيراني، مع زيارة رسمية للأمير محمد بن سلمان إلى موسكو التقى فيها بالرئيس الروسي فلاديمير بوتين، حيث وقعا على ستة اتفاقيات وصفت بالإستراتيجية منها اتفاقيات نووية، وكتبت صحف سعودية بأن هذا التقارب الروسي السعودي قد جاء في الوقت المناسب وأن «تنويع تحالفات» السعودية لا مناص منه في ظل هذا التحول الأمريكي في المنطقة/n/r

مع مجيء دونالد ترمب إلى البيت الأبيض وانسحابه من الاتفاق النووي، تعهد جو بايدن خلال حملته الرئاسية بالعودة عن قرار الانسحاب الذي وصفه مرارًا «بالخطأ الهائل»/n/r

في 20 نوفمبر 2019، خلال المناظرة الحزبية الديمقراطية الخامسة التي انعقدت في ولاية جورجيا، وجمعت جو بايدن بتسعة مرشحين رئاسيين ديمقراطيين آخرين يهدفون للفوز بترشيح الحزب الديمقراطي لخوض الانتخابات الرئاسية الأمريكية لمنافسة الرئيس دونالد ترمب، قال بايدن في معرض ردّه على سؤال عمّا إذا كان سيفرض عقوبات ضد السعودية على خلفية مقتل الصحفي السعودي جمال خاشقجي، إنه يعتقد أن الأخير قد قُتِل بناءً على أوامر الأمير محمد بن سلمان، معلنًا بصريح العبارة أنه يتعهد بـ«وقف بيع السلاح للسعودية، وبمعاقبتها وجعلها دولة منبوذة كما هو واقع حالها وإنهاء أي تعاون أمريكي سعودي»، مضيفًا أن السعودية «بلا قيمة حضارية»/n/r

وقد تضررت العلاقات الأمريكية السعودية بشكل كبير منذ وصول بايدن إلى البيت الأبيض، فبعد أقل من شهر من مراسم تنصيبهِ رئيسًا للولايات المتحدة، أعلنت المتحدثة باسم البيت الأبيض جينيفر بساكي في 16 فبراير 2021، أن الرئيس الأمريكي جو بايدن يعتزم إعادة تقييم العلاقات الأمريكية مع السعودية، وأنه سيتواصل مع الرياض مباشرة مع الملك سلمان بن عبد العزيز فقط دون ولي العهد الأمير محمد بن سلمان، مشيرة إلى عدم وجود أي خطط لاتصال بالسعودية، وهو ما شكل إعلانًا لبدء تنفيذ وعود بايدن الانتخابية، وهو إعلان عاد وأكد عليه الرئيس الأمريكي جو بايدن في مقابلة له مع شبكة يونيفزيون بُثت في 27 فبراير 2021، حيث قال: «تحدثت مع الملك أمس وليس مع ولي العهد وأخبرته بوضوح أن القواعد تتغير، وأن واشنطن ستعلن عن تغييرات كبيرة في العلاقات الأمريكية-السعودية»، وجاء هذا الاتصال في 26 فبراير 2021، في اليوم الذي أمر فيه بايدن وكالة المخابرات المركزية بنشر تقييمها بشأن مقتل الصحفي السعودي جمال خاشقجي/n/r غير أن الإدارة الأمريكية ممثلة بوزير الخارجية أنتوني بلينكن، ومستشار الأمن القومي جيك سوليفان، ما لبثت أن اجتمعت في 6 يوليو 2021، بنائب وزير الدفاع السعودي الأمير خالد بن سلمان آل سعود في اجتماعات عدة له خلال زيارته للولايات المتحدة، وذلك بعد أشهر معدودات من وصول الرئيس الأمريكي جو بايدن إلى البيت الأبيض/n/r وفي 27 سبتمبر 2021، أوفد الرئيس الأمريكي جو بايدن مستشاره للأمن القومي جيك سوليفان للقاء محمد بن سلمان، وهو أعلى مسؤول أمريكي يصل إلى السعودية بعد ثمانية أشهر من تنصيب بايدن، وقد زعمت صحيفة وول ستريت جورنال في 19 أبريل 2022، بعد أكثر من ستة أشهر من الاجتماع، أن الأمير محمد بن سلمان أنهى الاجتماع بعد أن «صرخ» في وجه المسؤول الأمريكي ما إن تطرق لحادثة مقتل الصحفي السعودي جمال خاشقجي، مشيرة إلى قول الأمير: «إنه لا يرغب أبدًا في مناقشة الحادثة مرة أخرى، وعلى الولايات المتحدة أن تنسى مطالبها في زيادة إنتاج النفط»، إلا إن المتحدثة باسم مجلس الأمن القومي الأمريكي «أدريان واتسون» نفت مناقشة إنتاج النفط مع الأمير محمد، مشيرة إلى أن الاجتماع لم يتخلله «صراخ»، وهو ما أكده مسؤول إعلامي سعودي عامل في السفارة السعودية بواشنطن/n/r

وفي حوار له مع مجلة ذا أتلانتيك الأمريكية، نُشِر في 3 مارس 2022، قال الأمير محمد بن سلمان بإنه «ببساطة لا يتهم» إن كان الرئيس الأمريكي قد أخذ صورة خاطئة عنه، مضيفًا أن «الأمر متروك له في التفكير في مصالح أمريكا»، وقد نقلت وكالة بلومبرغ الأمريكية عن مسؤولين أمريكيين قولهم إن إدارة الرئيس جو بايدن تبحث في مدى جدية تصريحات ولي العهد السعودي، إن كانت «مجرد كلام أم تحولًا حقيقيًا في السياسة السعودية»/n/r

وفي أعقاب الغزو الروسي لأوكرانيا، عاد وطلب الرئيس الأمريكي من السعودية زيادة إنتاج النفط، إلا إن الرياض لم تتجاوب مع هذه المطالب، وضمن هذا الأخبار زعمت صحيفة وول ستريت جورنال في 8 مارس 2022، وفقًا لمسؤولين في الولايات المتحدة والشرق الأوسط، أن البيت الأبيض حاول ترتيب مكالمات بين الرئيس جو بايدن والأمير محمد بن سلمان والشيخ محمد بن زايد، ضمن مساعي واشنطن لاحتواء ارتفاع أسعار النفط، لكن «دون جدوى» حيث رفض ولي عهد السعودية وولي عهد أبو ظبي الحديث مع الرئيس الأمريكي، وقالت الصحيفة الأميركية إن المسؤولين السعوديين والإماراتيين أصبحوا أكثر صراحة في الأسابيع الأخيرة في «انتقاداتهم للسياسة الأميركية في الخليج [العربي]»، بينما وصف مدير برنامج الطاقة والخليج في معهد واشنطن، سايمون هندرسون، الموقف الخليجي بأنه «أمر غير عادي»، قائلًا: «يبدو أن محمد بن سلمان ومحمد بن زايد غاضبان من واشنطن»، لكن المتحدثة باسم مجلس الأمن القومي في البيت الأبيض، إميلي هورن، وصفت التقرير بأنه «لا يعكس الحقيقة»/n/r

وفي 15 مارس 2022، زعمت صحيفة وول ستريت جورنال في تقرير جديد لها أن السعودية تجري محادثات مع الصين، لبيع بعض منتجاتها النفطية بعملة اليوان الصيني، مما عُدَّ تحولًا آخر وُصِف ب«الدراماتيكي» من قبل أكبر دولة مصدرة للنفط في العالم، وضربة قاتلة لسيادة الدولار الأمريكي في النظام المالي العالمي، حيث يسيطر اليوم على 80 في المائة من مبيعات النفط العالمية، بقيمة مقدرة يمكن أن تبلغ خلال عام 2022 نحو 2/n/r6 تريليون دولار أمريكي، وهي سيطرة فتحت السعودية الأبواب عليها منذ أن حددت الدولار عملة رسمية للمبيعات النفطية في العام 1974، في اتفاقية أبرمت في عهد إدارة الرئيس ريتشارد نيكسون، شملت ضمانات أمنية أمريكية للمملكة، وهو اتفاق ساهم في ترسيخ المكانة العالمية للدولار الأمريكي، بوصفها عملة مفضلة ومهيمنة بين احتياطات النقد الأجنبي حول العالم/n/r ووفقًا لمراقبين، فإن هذه المزاعم إن صحت فستؤذن بانتهاء عصر البترودولار، وهي مؤشر لعمق التدهور الكبير للعلاقات الأمريكية السعودية، التي وُصِفت إثر هذه التقارير بأنها قد بلغت «أدنى مستوياتها منذ عقود»، حيث كتبت صحيفة وول ستريت جورنال في 19 أبريل 2022 تقريرًا عن هذا التدهور، عنونته بـ«كيف وصلت العلاقات السعودية الأمريكية إلى هذا المستوى؟»، تزامن ذلك مع زيارة غير معلنة أو مجدولة لمدير وكالة المخابرات المركزية الأمريكية وليام بيرنز إلى السعودية حيث اجتمع بعيدًا عن وسائل الإعلام مع الأمير محمد بن سلمان في محاولة لإصلاح العلاقات الأمريكية السعودية ولبحث مجالات عدة، على رأسها تنامي العلاقات السعودية الصينية في الجانبين الاقتصادي والعسكري، وقد أجري الاجتماع في منتصف أبريل 2022 في جدة، وفقًا لتقرير نشرته صحيفة وول ستريت جورنال في 3 مايو 2022/n/r

تلا زيارة وليام بيرنز، زيارة أخرى غير معلنة للرياض أجراها اثنان من كبار مستشاري الرئيس الأمريكي جو بايدن في 24 مايو 2022، للتفاهم حول موضوعات مشتركة عدة من بينها زيادة إنتاج النفط، وقد سُرّبت أخبار زيارة المستشارين في 25 مايو 2022 لموقع «أكسيوس» الأمريكي، حيث أفادت المصادر أن كل من المبعوث الأمريكي الخاص للشرق الأوسط وشمال أفريقيا بريت ماكغورك ومبعوث الطاقة بوزارة الخارجية الأميركية «آموس هوشتاين» لا يزالان في المملكة، معلنة لأوّل مرة عن وجود نية محتملة لبايدن في زيارة المملكة العربية السعودية للقاء الملك وولي العهد ضمن رحلته المخطط لها إلى الشرق الأوسط في نهاية شهر يونيو 2022، إلا إن المصادر الأمريكية ربطت مجيء الرئيس الأمريكي بضرورة التوصل إلى اتفاق حول تلك التفاهمات/n/r ولم تصدر أي بيانات رسمية من الجانبين، وظلت الأنباء حول زيارة بايدن للسعودية غير مؤكدة، حتى حين أعلن البيت الأبيض في 3 يونيو 2022 عن تأجيل الرحلة الرئاسية إلى شهر يوليو 2022، إلى أن صدر بيان من الديوان الملكي السعودي في 14 يونيو 2022، أعلن فيه عن زيارة رسمية مرتقبة للرئيس الأمريكي للمملكة العربية السعودية ما بين 15 و16 يوليو 2022، وقد كتب الرئيس الأمريكي جو بايدن مقالًا في صحيفة الواشنطن بوست بعنوان «لماذا سأذهب إلى السعودية العربية؟»، نُشر في 9 يوليو، قبل أيام على وصوله للسعودية، يبرر فيه قراره في زيارة المملكة، في حين وصفت سفيرة خادم الحرمين الشريفين في الولايات المتحدة الأميرة ريما بنت بندر بن سلطان آل سعود، زيارة بايدن للسعودية بالمحورية، معلنة أن العلاقات الأمريكية السعودية تدخل مرحلة جديدة، مشيرة إلى أن «عهد النفط مقابل الأمن قد ولى منذ أمد بعيد» وذلك عبر مقال نشرته في صحيفة بوليتيكو في 14 يوليو 2022/n/r

وما إن حطت الطائرة الرئاسية الأمريكية في مطار الملك عبد العزيز في جدة، حتى بدت مظاهر الفتور وقلة الحماس جلية في استقبال الرئيس الأمريكي بايدن الذي وجد نفسه أمام أمير منطقة مكة المكرمة خالد الفيصل بن عبد العزيز آل سعود والأميرة ريما بنت بندر آل سعود، خلافًا لما حظي به الرئيس الأمريكي السابق دونالد ترمب من حفاوة وترحيب عند زيارته للمملكة في عام 2017/n/r وتنص المراسم الملكية السعودية على: «أن يكون أمير المنطقة أو نائبه في استقبال الزائر الضيف على مستوى القادة إذا كانت زيارة الأخير بناء على رغبته، أما إذا جاءت تلبية لدعوة من الملك أو ولي العهد فيكون الداعي في استقبال الضيف»، وهو ما سجلته وسائل الإعلام العالمية في وقت لاحق حين حضر محمد بن سلمان شخصيًا في المطار لاستقبال قادة الدول الخليجية والعربية المشاركين في قمة جدة/n/r وقد تحرك موكب الرئيس الأمريكي إلى قصر السلام، حيث استقبله ولي العهد محمد بن سلمان بعد أن تبادلًا التحية بقبضة اليد منهيًا بذلك مقاطعته للأمير لتصبح الصورة الأشهر في رحلة الرئيس الأمريكي للمنطقة، ثم التقى بايدن بالملك سلمان بحضور ولي العهد/n/r ورغم أن بايدن قد أعلن في 17 يونيو 2022 أنه لن يعقد اجتماعًا ثنائيًا مع محمد بن سلمان، إلا إنه فعل/n/r

الجماعات الإسلامية
المقالات الرئيسة: الإخوان المسلمون وتنظيم القاعدة وتنظيم الدولة الإسلامية في العراق والشام
في عدد من اللقاءات الصحفية في الولايات المتحدة، شن محمد بن سلمان – ما وُصِف بأنّه – الهجوم الأكبر على الجماعات الإسلامية، أبرزها تنظيم الإخوان المسلمين، الذين عدّهم ثالث أضلاع «مثلث الشر في العالم، إلى جانب كل من إيران والجماعات الإرهابية» على حد تعبيره، مضيفًا أن مثلث الشر يريد السيطرة على العالم عبر أيديولوجيا متطرفة، بقوله: «هذا المثلث يروج لفكرة أن الله والدين الإسلامي لا يأمرنا بنشر الرسالة فقط، بل بناء إمبراطورية يحكمونها بفهمهم المتطرف»، مؤكدًا: «المملكة العربية السعودية ومصر والأردن والبحرين وعمان والكويت والإمارات العربية المتحدة واليمن، تدافع عن فكرة أن الدول المستقلة يجب أن تركز على مصالحها وبناء علاقات جيدة على أساس مبادئ الأمم المتحدة، فيما مثلث الشر لا يريد القيام بذلك»/n/r وكان محمد بن سلمان قد قال أن: «كل إرهابي إن بحثنا في بداياته، لابدّ أنّه كان إخوانيًا، أسامة بن لادن زعيم تنظيم القاعدة وأيمن الظواهري من بعده كانا كذلك، أبو بكر البغدادي زعيم الدولة الإسلامية أيضًا»، واصفًا الإخوان المسلمين بـ«حاضنة الإرهابيين» و«الخطر الأعظم الذي يفوق الشيوعية أيام الحرب الباردة ويفوق إرهاب تنظيم القاعدة والدولة الإسلامية وأي أمر شاهدناه خلال آخر مائة عام من التاريخ»، مُحذِّرا من أنّهم (أي جماعة الإخوان) يريدون تحويل القارة الأوروبية إلى «قارة إخوانية» خلال ثلاثين عامًا، ذلك بالعمل على أدلجة المجتمعات الإسلامية في أوروبا وسحبها نحو التطرّف على حد وصفه، ذلك «أنهم يريدون نشر الخلافة (الإسلامية) من خلال استغلال الديمقراطية»، مطالبًا الدول الأوروبية أن تحذو حذو المملكة العربية السعودية وجمهورية مصر والإمارات العربية المتحدة في سنّ قوانين ونظم تجرّم الانضمام إلى جماعة الإخوان المسلمين بصفتها تنظيمًا إرهابيًا عالميًا، وحسبما نُشِر في مجلة التايم؛ فإن ولي العهد السعودي توعّد باجتثاث التطرّف من المملكة العربية السعودية، قائلًا: أنهم (أي السعوديون في المملكة) على الطريق الصحيح، إذ صنّفوا جميع التنظيمات المتطرّفة وفق معايير واحدة لا تستثني أحدًا من المتطرفين، منتقدًا الدول الغربية التي تحارب الإرهاب في العالم وفق معتقداتها بينما تفتح أبوابها أمام المتطرفين من خلال تقديم فرصة الاعتدال والانفتاح في الغرب بينما تتجاهل أفعال هؤلاء الأشخاص خارج الدول الغربية/n/r

وكان محمد بن سلمان قد أعلن عشيّة زيارته إلى الولايات المتحدة في 19 مارس 2018، في مقابلة بثتها شبكة سي بي اس نيوز الأميركية، أن «المدارس السعودية تعرضت لغزو من عناصر جماعة الإخوان المسلمين»، متوعّدا بالقضاء على التشدّد في النظام التعليمي في السعودية بالقريب العاجل على حد وصفه، مضيفًا: «لا توجد دولة في العالم تقبل أن تعرض نظامها التعليمي لغزو من أي جماعة متطرفة»/n/r ويرى مراقبون أن ما تُسمّى بـ«السعودية الجديدة»، التي توصفُ بأن عرّابها هو محمد بن سلمان، تحتاج إلى إحداث قطيعة كليّة مع كل الأفكار التي توصف بالمتطرفة، ويعتقد هؤلاء المراقبون أن إعلان محمد بن سلمان الحرب على تلك الجماعات الإسلامية هو من أجل القيام بكل تلك التحوّلات الاجتماعية والاقتصادية الجذرية التي يريد تنفيذها في السعودية في إطار رؤية السعودية 2030/n/r وكان المكتب العام لجماعة الإخوان المسلمين أصدر بيانا شن فيه هجومًا وصف بالعنيف ردًا على تصريحات ولي العهد السعودي بحق الجماعة، واعتبر البيان أن ما جاء في تلك التصريحات «كذب وافتراء»، وأن الجماعة «شاركت بكل صدق في بناء المجتمع السعودي»، معتبرًا أن السياسة التي يتّبعها محمد بن سلمان والإجراءات التي يتّخذها ضدهم وفي السعودية «نكوث عن الواجب الديني والقومي»، وهي محاولة برعاية «صهيوأمريكية» لتولي العرش بحسب وصفهم، بينما جاء الرد الإيراني على لسان علي شمخاني أمين عام المجلس الأعلى للأمن القومي الإيراني، إذ قال: «بن سلمان حذف كلمة الشر عن الكيان الصهيوني وألصقها بدول أخرى توفر السلام والاستقرار في المنطقة»/n/r في حين هاجم تنظيم القاعدة في جزيرة العرب محمد بن سلمان في نشرة له، معتبرًا أن سياسات ولي العهد السعودي «نذير هلاك»، محذّرًا من تداعيات ما سمّاه «هذه المصائب» على حد ما جاء في بيان التنظيم/n/r

النشاطات الاجتماعية والخيرية
لمحمد بن سلمان نشاط عديدة في مجال العمل غير الربحي، حيث أسّس مؤسسة خيرية تحمل اسمه وهي مؤسسة محمد بن سلمان الخيرية مسك الخيرية، التي يترأس مجلس إدارتها، والهادفة إلى دعم تطوير المشاريع الناشئة والتشجيع على الإبداع في المجتمع السعودي، كما يرأس مجلس إدارة مركز الملك سلمان للشباب، وهو أيضًا نائب الرئيس ورئيس اللجنة التنفيذية لجمعية الملك سلمان للإسكان الخيري، لتغطية احتياجات أصحاب الدخل المحدود/n/r بالإضافة إلى رئاسته لمجلس إدارة مدارس الرياض/n/r كما كان له مناصب خيرية أخرى سابقة منها:

عضو مجلس أمناء مؤسسة ابن باز الخيرية/n/r
عضو المجلس التنسيقي الأعلى للجمعيات الخيرية بمنطقة الرياض/n/r
عضو مجلس إدارة جمعية البر بمنطقة الرياض/n/r
أول رئيس فخري للجمعية السعودية للإدارة، في الفترة (1435هـ – 1437هـ)/n/r
عضو فخري للجمعية الوطنية الخيرية للوقاية من المخدرات/n/r
رئيس مجلس الأعضاء الفخريين لجمعية الأيادي الحرفية/n/r
أحد مؤسسي جمعية ابن باز الخيرية لتيسير الزواج ورعاية الأسرة/n/r
أسرته
محمد بن سلمان بن عبد العزيز آل سعود متزوج من ابنة عمه سارة بنت مشهور بن عبدالعزيز آل سعود/n/r وله منها خمسة أولاد، هم: سلمان، مشهور، فهدة، نورة، عبد العزيز/n/r

انتقادات
تشير تقارير حقوقية، أن ولي العهد السعودي - رغم الإصلاحات الاقتصادية والاجتماعية التي أجراها ورغم انتهاجه نهجًا جديدا في السعودية، وُصِفَ بالتقدمي - إلا أنّه لم يوقف الاعتقالات التي طالت نشطاء سعوديين كثر، من بينهم سفر الحوالي، عوض القرني، علي العمري، سلمان العودة، ناصر العمر/n/r وبحسب الأنباء فإن الاعتقالات جاءت ضد قيادات مرتبطة بتنظيم الإخوان المسلمين في السعودية، المصنّف إرهابيًا في المملكة، في حين أشار مسؤولون سعوديون أن الاعتقالات جرت لتدفع المملكة إلى «إسلام أكثر اعتدالا»، وهو أحد الوعود التي قطعها محمد بن سلمان، في إطار خطط لتحديث المملكة التي توصف بـ«المحافظة بشدّة»/n/r وأغلب المعتقلين، سبق اعتقالهم، بين فترات مختلفة في السعودية/n/r وأغلب المعتقلين، رجال دين، يعدّون من رموز وقيادات تيار الصحوة في السعودية، وعرفوا بفتاوى متشدّدة، خاصة تجاه الشيعة/n/r وكانت السعودية قد أطلقت حملة في سبتمبر 2017، لمكافحة ما وصفه بـالإرهاب، إذ طلبت من المواطنين والمقيمين فيها بالإبلاغ عن أي «أفكار إرهابية أو متطرفة»، أو أي نشاط «من شأنه تعريض الوحدة الوطنية إلى الخطر»/n/r وكان محمد بن سلمان قد قال أن جماعة الإخوان المسلمين ومن ضمنهم السروريون – وهم قيادات تيار الصحوة – بموجب قوانين السعودية مجرمون، مضيفًا: «حينما نملك أدلة كافية ضد أي أحد منهم، سوف نقاضيهم في المحاكم»/n/r وهو ما يُفسِر هذه الاعتقالات/n/r

وأفادت تقارير لمنظمة هيومن رايتس ووتش أن الاعتقالات لم تستثنِ الناشطات الحقوقيات المدنيَّات، المدافعات عن حقوق المرأة، والداعيات إلى إلغاء نظام ولاية الرجل التمييزي، وإنهاء حظر قيادة المرأة السعودية للسيارة (وهو ما تم بالفعل في يونيو 2018)/n/r وكانت المملكة العربية السعودية، في 26 فبراير 2018، قد دافعت عن سجلّها في حقوق المرأة، أمام لجنة الأمم المتحدة للقضاء على التمييز ضد المرأة (المعروفة بـلجنة سيداو)/n/r بينما رحّبت اللجنة بالإصلاحات التي تبناّها محمد بن سلمان، إلا أنّها حثّت الحكومة السعودية على تسريع جهودها لإلغاء «الأحكام القانونية التي تتطلب تصريح ولي الأمر الذكر لممارسة النساء لحقوقهن»، و«الامتناع عن أي أعمال انتقامية ضد الحقوقيات وأقاربهن» و«ضمان تمكين الناشطات من ممارسة حقوقهن في حرية التعبير وتكوين الجمعيات»/n/r

وكانت سفارة كندا في السعودية، قد نشرت في حسابها على تويتر في 5 أغسطس 2018، تغريدة، عبّرت فيها عن «قلق بالغ» إزاء هذه الاعتقالات، مطالبة من السعودية بـ«الإفراج عنهم فورًا»، وهو ما أدّى إلى قرار السعودية قطع علاقاتها الدبلوماسية والاقتصادية مع كندا، معتبرة سلسلة التغريدات الكندية (تغريدة وزيرة الخارجية الكندية، تغريدة وزارة الخارجية الكندية، تغريدة السفارة الكندية في الرياض) «تدخلًا سافِرًا في الشؤون الداخلية السعودية، وانتهاكا للقواعد الدبلوماسية والبروتوكول»/n/r

من جانب آخر، حملته بعض المنظمات الحقوقية المسؤولية حول مقتل جمال خاشقجي، وهي الحادثة التي وصفها بأنها «جريمة بشعة» يتحمل «المسؤولية الكاملة» عنها، ذلك أنها حدثت من قبل «مسؤولين سعوديين يعملون في الحكومة السعودية»، وهو يرى أنها مسؤولية أدبية لابدَّ له أن يتحملها لكونه قائدًا في السعودية/n/r جاءت تصريحاته تلك في حوار مصوّر مع نورا أودونيل ضمن برنامج 60 دقيقة، بُثَّ على قناة سي بي إس الأمريكية في يوم الأحد 29 سبتمبر 2019/n/r وحين سُئِل عن كيفية حدوث الجريمة دون أن يعلم بها، قال: «البعض يعتقد أنني يجب أن أكون على علم بما يقوم به ثلاثة ملايين شخص يعملون ضمن الحكومة السعودية يوميًا؟ من المستحيل أن يرفع الثلاثة ملايين تقاريرهم اليومية للقائد في المملكة العربية السعودية أو ثاني أعلى رجل في الحكومة السعودية»، مفصحًا أن التحقيقات إن أثبتت تورط أي شخص سوف تحيله للمحكمة، مهما كانت رتبته أو منصبه ضمن الحكومة/n/r وردًّا على التقارير التي اتهمته بالجريمة، منها «استنتاجات» وكالة الاستخبارات المركزية الأميركية، قال: «أتمنى أن تُخرج هذه المعلومات إلى العلن/n/r إذا كانت هناك أي معلومات تتهمني بالقيام بأي عمل، أتمنى أن يتم إخراجها»، مؤكدًا ألا مصلحة للحكومة السعودية بقتل أي صحفي، وهم لا يشكلون أي خطر على المملكة، وأن الخطر الذي يتهدّد السعودية هو من هذه «الجريمة البشعة التي استهدفت صحفي سعودي في قنصلية سعودية»، مضيفًا لا يمكن تصوّر «الألم» الذي صنعته هذه الجريمة، خصوصًا لدى قيادة وحكومة المملكة العربية السعودية/n/r

الزيارات الخارجية
المقالة الرئيسة: قائمة الرحلات الدولية لمحمد بن سلمان آل سعود

الرئيس الروسي فلاديمير بوتين مع الأمير محمد بن سلمان آل سعود في حفل افتتاح كأس العالم 2018
سافر محمد بن سلمان على نطاق واسع حول العالم، مجتمعًا مع سياسيين ومشاهير ورؤساء أعمال/n/r أولها قام بسلسلة زيارات لروسيا والتقى خلال هذه الزيارات بالرئيس الروسي فلاديمير بوتين وعددًا من كبار المسؤولين الروس، أولى هذه الزيارات كان في يونيو 2015، والأخرى في أكتوبر 2015، في منتجع سوتشي جنوب روسيا/n/r أما الزيارة الثالثة لروسيا فكانت في مايو 2017، والزيارة الرابعة كانت في يونيو 2018/n/r كما حضر حفل افتتاح كأس العالم 2018 في موسكو، حيث التقى بشخصيات هامة، مثل: خوان كارلوس فاريلا، نيكولا ساركوزي، سورونباي جينبيكوف، جياني إنفانتينو/n/r

في يونيو 2016، سافر إلى وادي السليكون حيث التقى بشخصيات رئيسية في صناعة التكنولوجيا العالمية في الولايات المتحدة، بما في ذلك مارك زوكربرغ مؤسس موقع فيسبوك/n/r وفي أوائل عام 2018، زار محمد بن سلمان الولايات المتحدة، حيث التقى بالعديد من كبار السياسيين ورجال الأعمال ونجوم هوليود، بما في ذلك الرئيس ترمب، بيل كلينتون، هيلاري كلينتون، هنري كسنجر، مايكل بلومبيرغ، جورج دبليو بوش، جورج بوش الأب، بيل غيتس، جيف بيزوس، أوبرا وينفري، روبرت مردوخ، ريتشارد برانسون، «إيريك غارسيتي» عمدة لوس أنجلوس، مايكل دوغلاس، مورغان فريمان ودوين جونسون/n/r وأشاد الرئيس ترمب بعلاقته مع الأمير محمد/n/r

وفي أغسطس 2016، زار الصين والتقى بالرئيس شي جين بينغ/n/r كما ترأس الوفد السعودي أثناء قمة هانغتشو في الصين في سبتمبر 2016، وخلالها التقى بالعديد من كبار السياسيين، مثل: المستشارة الالمانية أنغيلا ميركل، ورئيس البرازيل ميشال تامر، والرئيس المصري عبد الفتاح السيسي ورئيس فرنسا فرانسوا اولاند، ورئيس وزراء إيطاليا ماتيو رينزي، ورئيسة كوريا الجنوبية باك غن هي، ورئيس كازاخستان نور سلطان، والرئيس التركي رجب أردوغان، ووزير الخارجية الأمريكي جون كيري، والأمين العام للأمم المتحدة بان كي مون/n/r كما زار اليابان في سبتمبر 2016، والتقى بالإمبراطور أكيهيتو، وولي العهد ناروهيتو، ورئيس الوزراء شينزو آبي، والعديد من رجال الأعمال/n/r

ولي العهد السعودي زار أيضًا بعض دول أوروبا الغربية، مثل: المملكة المتحدة، حيث التقى برئيسة الوزراء البريطانية تيريزا ماي، والملكة إليزابيث الثانية والأمير وليم/n/r وفرنسا والتقى بالرئيس إيمانويل ماكرون/n/r وإسبانيا والتقى خلالها بالملك فيليبي السادس، ورئيس الوزراء الإسباني ماريانو راخوي/n/r


صورة محمد بن سلمان على غلاف مجلة تايم
وقام بزيارات عدة للدول العربية، ابرزها: مصر، حيث التقى خلالها بالرئيس عبد الفتاح السيسي، البابا تواضروس الثاني، الإمام أحمد الطيب، مهاب مميش/n/r والأردن، حيث التقى بالملك عبد الله الثاني بن الحسين/n/r والإمارات العربية المتحدة، إذ التقى خلالها بولي عهد أبوظبي محمد بن زايد آل نهيان/n/r والكويت ملتقيًا برئيس مجلس الوزراء جابر مبارك الحمد الصباح، وصباح الخالد الحمد الصباح/n/r كذلك البحرين حيث التقى الملك حمد بن عيسى بن سلمان آل خليفة وولي العهد سلمان بن حمد آل خليفة/n/r وأيضًا تونس والتقى حينها بالرئيس الباجي قائد السبسي/n/r كذلك زار موريتانيا والتقى بالرئيس الموريتاني محمد ولد عبد العزيز/n/r

كما رأس الأمير محمد بن سلمان وفد السعودية في قمة مجموعة العشرين في بوينس آيرس المقام في الأرجنتين وألتقى برؤساء دول مجموعة العشرين/n/r

في ديسمبر 2021، قام الأمير بجولة خليجية، استغرقت خمسة أيام، زار خلالها سلطنة عمان والإمارات وقطر والبحرين والكويت/n/r حيث وصل في 6 ديسمبر إلى سلطنة عمان في زيارة رسمية، التقى فيها جلالة السلطان هيثم بن طارق بن تيمور سلطان عُمان، والذي منحة وسام عُمان المدني من الدرجة الأولى، أحد أرفع الأوسمة العمانية/n/r وفي 7 ديسمبر، وصل إلى دولة الإمارات العربية المتحدة في زيارة رسمية/n/r خلال الزيارة زار معرض إكسبو 2020 دبي، في 8 ديسمبر، زار جناح دولة الإمارات، واطلع على محتواه، ثم زار جناح المملكة الذي يعد ثاني أكبر الأجنحة في المعرض/n/r وفي 8 ديسمبر، وصل إلى دولة قطر في زيارة رسمية، وعقد خلال الزيارة الاجتماع السادس لمجلس التنسيق السعودي القطري/n/r في 9 ديسمبر، وصل إلى مملكة البحرين في زيارة رسمية/n/r وكان في استقباله الملك حمد بن عيسى آل خليفة، ملك مملكة البحرين، وولي العهد، الأمير سلمان بن حمد آل خليفة رئيس مجلس الوزراء/n/r وعُقد خلال الزيارة الاجتماع الثاني لمجلس التنسيق السعودي البحريني/n/r في 10 ديسمبر، وصل إلى دولة الكويت في زيارة رسمية/n/r واستقبله الشيخ نواف الأحمد الجابر الصباح أمير دولة الكويت، في دار يمامة، بحضور الشيخ مشعل الأحمد الجابر الصباح ولي عهد دولة الكويت/n/r وقلّد أمير دولة الكويت الأمير محمد قلادة مبارك الكبير ووسام الكويت تقديراً لما يبذله من جهود ترسخ روابط الإخاء بين البلدين والشعبين، وتعزز أواصر الأخوة والتفاهم بين دول مجلس التعاون الخليجي/n/r

ألقاب وأوسمة وتكريمات حصل عليها
في 13 يونيو 2017، كشفت مجلة فوربس، عن اختيار محمد بن سلمان ضمن قائمة «رائد التغيير العالمي» لعام 2017/n/r وكان محمد بن سلمان، قد حلَّ ضمن الشخصيات الثلاثة الأكثر تأثيرًا لعام 2017، من بين خمسين شخصية مؤثرة في العالم، بحسب القائمة السنوية التي تصدرها مجلة بلومبيرغ/n/r وفي نهاية العام 2017، منحته مجلة تايم الأمريكية، لقب «شخصية العام» لعام 2017 باختيار القراء/n/r وكانت مجلة فوربس الشرق الأوسط، قد منحته - بصفته رئيسًا لمجلس إدارة مركز الملك سلمان للشباب - جائزة شخصية العام القيادية لدعم رواد الأعمال لعام 2013، كذلك اختارته مجلة السياسة الخارجية الأميركية فورين بوليسي، ضمن القادة الأكثر تأثيرًا في العالم، ضمن قائمتها السنوية لأهم مائة مفكِّر في العالم لعام 2015/n/r وحلّ في المركز الثامن عالميًا والأول عربيًا، ضمن قائمة مجلة فوربس الأمريكية، لأقوى 75 شخصية في العالم لعام 2018/n/r

في 25 نوفمبر 2018، منح ملك البحرين حمد بن عيسى بن سلمان آل خليفة، وسام الشيخ عيسى بن سلمان آل خليفة من الدرجة الممتازة إلى ولي العهد الأمير محمد بن سلمان لجهود سموه في دعم وتعزيز العلاقات السعودية البحرينية/n/r وفي 27 نوفمبر من عام 2018، قلّد رئيس الجمهورية التونسية الباجي قائد السبسي ولي العهد الأمير محمد بن سلمان الصنف الأكبر من وسام الجمهورية تقديرًا لجهوده في دعم وتعزيز العلاقات التونسية السعودية/n/r في 18 فبراير 2019، قام الرئيس عارف ألفي بمنح أرفع وسام مدني في دولة باكستان وهو ما يسمى «نيشان باكستان» للأمير محمد بن سلمان، تقديرا لزيارته/n/r

في 3 مارس 2021، منحت جامعة الدول العربية، شهادة تقدير درع العمل العربي التنموي للأمير محمد، تقديراً للإنجازات التنموية الشاملة والكبيرة التي حققها على مختلف المجالات في المملكة، نتيجة للتشريعات الاقتصادية والاجتماعية، والأنظمة الحقوقية والعدلية، والبرامج التنموية التي توالى إصدارها واعتماد العمل بها، مما أحدث تغيراً إيجابياً سريعاً وشاملاً على خطة التنمية في المملكة/n/r

في 7 ديسمبر 2021، منح سلطان عمان هيثم بن طارق وسام عُمان المدني من الدرجة الأولى، أرفع الأوسمة المدنية العمانية، إلى ولي العهد الأمير محمد بن سلمان «اعتزازاً بالروابط الأخوية والعلاقات الممتازة والتعاون البناء» أثناء زيارته للسلطنة/n/r وفي اليوم ذاته، ونيابة عن رئيس دولة الإمارات العربية المتحدة، قدّم له ولي عهد أبوظبي محمد بن زايد آل نهيان وسام زايد من الدرجة الأولى «تقديرا وتعبيرا عن الاعتزاز بعمق العلاقات الثنائية الراسخة وما يجمع البلدين من روابط تاريخية وطيدة»/n/r

في 10 ديسمبر 2021، منح أمير الكويت الشيخ نواف الأحمد الجابر الصباح قلادة مبارك الكبير ووسام الكويت، إلى ولي العهد الأمير محمد بن سلمان عند استقباله في دار يمامة بحضور ولي عهد الكويت الشيخ مشعل الأحمد الجابر الصباح، وذلك «تقديرًا لإنجازاته المميزة للمملكة وتعزيزه أواصر الأخوة بين البلدين وبين دول مجلس التعاون»/n/r

في 21 يونيو 2022، منح الملك عبد الله الثاني بن الحسين وسام الحسين بن علي، أرفع وسام مدني في المملكة الأردنية، إلى ولي العهد الأمير محمد بن سلمان وذلك «تعميقا وتجسيدا للعلاقات التاريخية المميزة التي تربط البلدين، وبمناسبة زيارة سموه للأردن/n/r»/n/r

أوسمة
  البحرين: وسام الشيخ عيسى بن سلمان آل خليفة من الدرجة الممتازة (25 نوفمبر 2018)/n/r
  تونس: الصنف الأكبر من وسام الجمهورية (28 نوفمبر 2018)/n/r
  باكستان: نيشان باكستان (18 فبراير 2019)/n/r
  عمان: وسام عُمان المدني من الدرجة الأولى (7 ديسمبر 2021)/n/r
  الإمارات العربية المتحدة: وسام زايد من الدرجة الأولى (7 ديسمبر 2021)/n/r
  الكويت: قلادة مبارك الكبير ووسام الكويت (10 ديسمبر 2021)/n/r
  الأردن: وسام الحسين بن علي (21 يونيو 2022)/n/r
أماكن وأشياء سُمِّيَت باسمه
محمية الأمير محمد بن سلمان
مدينة الأمير محمد بن سلمان غير الربحية
سند محمد بن سلمان
مؤسسة محمد بن سلمان
طريق الأمير محمد بن سلمان (الشميسي - الحرم)
مشروع محمد بن سلمان لتطوير المساجد التاريخية
كلية الأمير محمد بن سلمان للإدارة وريادة الأعمال
مركز الأمير محمد بن سلمان العالمي للخط العربي
مركز محمد بن سلمان لعلوم وتقنيات المستقبل
دوري الأمير محمد بن سلمان للدرجة الأولى
جائزة الأمير محمد بن سلمان للتعاون الثقافي بين السعودية والصين
مناصب محمد بن سلمان
مناصب محمد بن سلمان
سبقه
سلمان بن عبد العزيز آل سعود	ولي العهد ورئيس مجلس الوزراء
2022 - حتى الآن

تبعه
ما يزال في المنصب
سبقه
محمد بن نايف	ولي العهد
2017 - حتى الآن

تبعه
ما يزال في المنصب
سبقه
محمد بن نايف	رئيس مجلس الشؤون السياسية والأمنية
2017 - حتى الآن

تبعه
ما يزال في المنصب
سبقه
محمد بن نايف	وليُّ وليِّ العهد
2015 - 2017

تبعه
شاغر
سبقه
سلمان بن عبد العزيز آل سعود	وزير الدفاع
2015 - 2022

تبعه
خالد بن سلمان آل سعود
سبقه
لا يوجد	رئيس مجلس الشؤون الاقتصادية والتنمية
2015 - حتى الآن

تبعه
ما يزال في المنصب
سبقه
سعود بن نايف بن عبد العزيز	رئيس ديوان سمو ولي العهد المستشار الخاص لسموه
2013 - 2015

تبعه
حمد بن عبد العزيز السويلم
سبقه
خالد بن عبد العزيز التويجري	رئيس الديوان الملكي
2015 - 2015

تبعه
حمد بن عبد العزيز السويلم
المراجع
 https://www/n/rvision2030/n/rgov/n/rsa//n/r
 https://www/n/rpresident/n/rgov/n/rua/documents/8602023-49389/n/r
 https://time/n/rcom/collection/most-influential-people-2018/5217538/crown-prince-mohammed-bin-salman//n/r
 ترجمة محمد بن سلمان (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 19 سبتمبر 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 قصة السعودية مع الوزراء الثلاثينيين (محفوظ) (بالعربية)/n/r (الرابع من فبراير 2015)/n/r
 اختيار سمو الأمير محمد بن سلمان ولياً لولي العهد (محفوظ) (بالعربية)/n/r (29 نيسان (أبريل) 2015)/n/r
 مسيرة محمد بن سلمان/n/r/n/r ولي العهد (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 الروابط الأسرية بين آل سعود وآل حثلين (محفوظ) (بالعربية)/n/r (الأوّل من أغسطس 2008)/n/r
 ترجمة محمد بن سلمان (محفوظ) (بالعربية)/n/r (23 يناير 2015)/n/r
 صدور أوامر ملكية إضافة أولى (محفوظ) (بالعربية)/n/r (29 نيسان (أبريل) 2015)/n/r
 صدور حزمة من الأوامر الملكية: محمد بن نايف وليًا للعهد ومحمد بن سلمان وليًا لولي العهد (محفوظ) (بالعربية)/n/r (29 نيسان (أبريل) 2015)/n/r
 أمر ملكي: إعفاء محمد بن نايف ومحمد بن سلمان ولياً للعهد (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 تعيين محمد بن سلمان وليا للعهد ذروة ثورة في قيادة السعودية (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 أميركيون: هكذا ستصبح السعودية تحت حكم بن سلمان (محفوظ) (بالعربية)/n/r (22 يونيو 2017)/n/r
 صدور أمر سامٍ بالسماح للمرأة بقيادة السيارة (محفوظ) (بالعربية)/n/r (26 سبتمبر 2017)/n/r
 ماذا يعني السماح الآن للمرأة السعودية بقيادة السيارات؟ (محفوظ) (بالعربية)/n/r (27 سبتمبر 2017)/n/r
 السماح للنساء بالدخول إلى الملاعب الرياضية بدءًا من 2018 في الرياض وجدة والدمام (محفوظ) (بالعربية)/n/r (29 أكتوبر 2017)/n/r
 محمد بن سلمان: سنقضي على التطرف/n/r/n/r/n/r وسنعود إلى الإسلام الوسطي (محفوظ) (بالعربية)/n/r (25 أكتوبر 2017 / العدد:14211)/n/r
 محمد بن سلمان: سندمر التطرف ونعيش حياة طبيعية (محفوظ) (بالعربية)/n/r (24 أكتوبر 2017)/n/r
 هل ينجح بن سلمان في إقصاء الفكر المتشدد في السعودية؟ (محفوظ) (بالعربية)/n/r (29 سبتمبر 2017)/n/r
 محمد بن سلمان: سنتخلص من إدمان النفط/n/r/n/r و«الغرين كارد» ستمكن العرب والمسلمين من العيش في السعودية (محفوظ) (بالعربية)/n/r (25 نيسان (أبريل) 2016)/n/r
 محمد بن سلمان أشرف على الضربة الأولى ضد الحوثيين (محفوظ) (بالعربية)/n/r (26 مارس 2015)/n/r
 الأمير محمد بن سلمان: يجب إلغاء الاتفاق النووي فورًا (محفوظ) (بالعربية)/n/r (28 مارس 2018)/n/r
 محمد بن سلمان: سنطور قنبلة نووية إذا فعلتها إيران (محفوظ) (بالعربية)/n/r (16 مارس 2017)/n/r
 Interview with Muhammad bin Salman (محفوظ) (بالإنجليزية)/n/r (6 يناير 2016)/n/r
 نشطاء: السعودية تعتقل الداعية البارز سفر الحوالي (محفوظ) (بالعربية)/n/r (12 يوليو 2018)/n/r
 السعودية تعتقل رجال دين بارزين لإسكات المعارضة فيما يبدو (محفوظ) (بالعربية)/n/r (12 سبتمبر 2017)/n/r
 السعودية تعتقل نشطاء بتهمة التواصل مع جهات أجنبية مشبوهة (محفوظ) (بالعربية)/n/r (19 مايو 2018)/n/r
 السعودية: اعتقال مدافعات عن حقوق المرأة (محفوظ) (بالعربية)/n/r (19 مايو 2018)/n/r
 محمد بن سلمان شخصية العام باختيار قراء مجلة تايم (محفوظ) (بالعربية)/n/r (الخامس من ديسمبر 2017)/n/r
 فورين بوليسي: محمد بن سلمان ضمن القادة الأكثر تأثيرا (محفوظ) (بالعربية)/n/r (الثاني من ديسمبر 2015)/n/r
 The Leading Global Thinkers of 2015 - Foreign Policy (محفوظ) (بالإنجليزية)/n/r مؤرشف من الأصل في 06 مارس 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 The Worlds Most Powerful People (محفوظ) (بالإنجليزية)/n/r مؤرشف من الأصل في 31 أغسطس 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 ترجمة آل سعود (أمراء الدرعية - أمراء الحجاز - ملوك نجد والحجاز - ملوك السعودية) (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 24 مارس 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 الموافق 22 ربيع الأول 1428هـ
 الموافق 28 ذو الحجة 1430هـ
 الموافق 20 ربيع الثاني 1434هـ
 أمر ملكي: تعيين الأمير محمد بن سلمان بن عبد العزيز رئيسًا لديوان سمو ولي العهد ومستشارًا خاصًا لسمو ولي العهد بمرتبة وزير (محفوظ) (بالعربية)/n/r (الثاني من مارس 2013)/n/r
 أمر ملكي: الأمير محمد بن سلمان رئيساً لديوان ولي العهد ومستشاراً خاصاً لسموه بمرتبة وزير (محفوظ) (بالعربية)/n/r (2 مارس 2018)/n/r
 ترجمة محمد بن سلمان - متجدّدة (محفوظ) (بالعربية)/n/r (23 يناير 2015)/n/r
 أمر ملكي : إعفاء الأمير عبد العزيز بن فهد من منصبه وتعيين الأمير محمد بن سلمان وزير دولة وعضواً في مجلس الوزراء بالإضافة إلى عمله (محفوظ) (بالعربية)/n/r (25 نيسان (أبريل) 2014)/n/r
 خادم الحرمين يختار الأمير محمد بن نايف ولياً لولي العهد ويأمر بتعيينه نائباً ثانياً لرئيس مجلس الوزراء وزيراً للداخلية (محفوظ) (بالعربية)/n/r (23 يناير 2015)/n/r
 صدور أوامر ملكية إضافة رابعة (محفوظ) (بالعربية)/n/r (29 يناير 2015)/n/r
 صدور أوامر ملكية إضافة خامسة (محفوظ) (بالعربية)/n/r (29 يناير 2015)/n/r
 صدور أوامر ملكية إضافة سادسة (محفوظ) (بالعربية)/n/r (29 يناير 2015)/n/r
 الموافق 5 رمضان 1434هـ
 ترجمة محمد بن سلمان (محفوظ)/n/r مؤرشف من الأصل في 28 سبتمبر 2020/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 20208 نوفمبر 2020/n/r
 الأهداف الإستراتيجية (محفوظ)/n/r مؤرشف من الأصل في 5 مايو 2019/n/r
 أوامر ملكية: ولي العهد رئيساً لمجلس الوزراء /n/r/n/r وإعادة تشكيل المجلس برئاسته/n/r أرقام/n/r مؤرشف من الأصل في 2022-09-27/n/r اطلع عليه بتاريخ 2022-09-27/n/r
 ولي العهد السعودي يعقد اجتماعا مع شركة ريثيون لبحث توطين الصناعات العسكرية (محفوظ) (بالعربية)/n/r (الثالث من نوفمبر 2016)/n/r
 ولي العهد في زيارة كبرى إلى أمريكا (محفوظ) (بالعربية)/n/r (18 مارس 2018)/n/r
 محمد بن سلمان يبحث توطين الصناعات العسكرية (محفوظ) (بالعربية)/n/r (17 نوفمبر 2016)/n/r
 ولي ولي العهد السعودي يبحث مجالات توطين الصناعات العسكرية مع شركة لوكهيد مارتن (محفوظ) (بالعربية)/n/r (الأوّل من فبراير 2017)/n/r
 بالأرقام تعرف على شركة الصناعات العسكرية السعودية (محفوظ) (بالعربية)/n/r (20 مايو 2017)/n/r
 محمد بن سلمان: الصناعات العسكرية ستدعم التوطين بنسبة 50% (محفوظ) (بالعربية)/n/r (18 مايو 2017)/n/r
 سمو ولي ولي العهد : إنشاء شركة للصناعات العسكرية سيسهم في جلب استثمارات أجنبية وسيؤثر إيجابا على الناتج الإجمالي للمملكة (محفوظ)/n/r (17 مايو 2017)/n/r
 السعودية تدعم توطين الصناعات العسكرية بإنشاء هيئة متخصصة (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 15 ديسمبر 2019/n/r وصل لهذا المسار في 15 كانون الأوّل (ديسمبر) 2018/n/r
 الإنفاق العسكري السعودي الثالث عالميا في 2017 (محفوظ) (بالعربية)/n/r (الثاني من مايو 2018)/n/r
 ولي العهد يرعى تأسيس مشروع توطين الصناعات العسكرية مع «بوينغ» الأميركية (محفوظ) (بالعربية)/n/r (31 مارس 2018)/n/r
 بماذا عاد بن سلمان إلى السعودية؟ (محفوظ) (بالعربية)/n/r (13 نيسان (أبريل) 2018)/n/r
 ولي العهد يرعى تأسيس مشروع الصناعات العسكرية بنسبة توطين 55% (محفوظ) (بالعربية)/n/r (31 مارس 2018)/n/r
 الشركة السعودية للصناعات العسكرية (SAMI) توقع على تأسيس مشروعين مشتركين لتوطين التصنيع العسكري في المملكة (محفوظ)/n/r (28 يناير 2019)/n/r
 عام / الشركة السعودية للصناعات العسكرية SAMI ومجموعة نافال توقعان مذكرة اتفاق إستراتيجية لتأسيس مشروع مشترك بمجال الدفاع البحري وكالة الأنباء السعودية (محفوظ)/n/r مؤرشف من الأصل في 19 فبراير 2019/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 20202019-02-18/n/r
 اقتصادي / الشركة السعودية للصناعات العسكرية تتعاون مع أل 3 تكنولوجيز في تقنيات الأشعة الكهروضوئية وتحت الحمراء (محفوظ)/n/r مؤرشف من الأصل في 19 فبراير 2019/n/r
 الموافق 26 رمضان 1438هـ
 ٔمر-ملكي-سعودي-محمد-بن-سلمان-وليا-للعهد أمر ملكي سعودي: محمد بن سلمان وليا للعهد (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 بأعلى نسبة تصويت في هيئة البيعة منذ إنشائها : محمد بن سلمان ولياً للعهد (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 31 من 34 بهيئة البيعة اختاروا محمد بن سلمان ولياً للعهد (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 الموافق 1 ربيع الأول 1444 هـ
 أمر ملكي: إعادة تشكيل مجلس الوزراء برئاسة ولي العهد الأمير محمد بن سلمان/n/r مؤرشف من الأصل في 2022-09-27/n/r
 Risk-taking Saudi prince gambling with stability (محفوظ) (بالعربية)/n/r (8 فبراير 2017)/n/r
 Rise of Prince Mohammed bin Salman rattles Saudi Arabia (محفوظ) (بالعربية)/n/r (17 أكتوبر 2016)/n/r
 ولي العهد يتحدث لـ«التايم» الأميركية: نرسم اقتصادنا بناء على مكامن القوة لدينا (محفوظ) (بالعربية)/n/r (29 نيسان (أبريل) 2015)/n/r
 صندوق الاستثمارات يستحوذ على أصول بـ 550 مليار ريال في الشركات السعودية (محفوظ) (بالعربية)/n/r (31 يوليو 2018)/n/r
 صندوق الاستثمارات العامة/n/r/n/r/n/r قاطرة تنويع مصادر الدخل (محفوظ) (بالعربية)/n/r (الرابع من مايو 2017)/n/r
 شراكة يابانية سعودية لاستثمار 100 مليار دولار في تكنولوجيا المستقبل (محفوظ) (بالعربية)/n/r (15 أكتوبر 2016 / السنة:39)/n/r
 أصول صندوق الاستثمارات العامة السعودي تصل إلى 160 مليار دولار بنهاية سبتمبر الماضي (محفوظ) (بالعربية)/n/r (9 أكتوبر 2016)/n/r
 736/n/r3 مليار دولار ثروات السعودية السيادية بنهاية 2016 (محفوظ) (بالعربية)/n/r (20 فبراير 2017 / العدد:5281)/n/r
 616 مليار ريال أصول صندوق الاستثمارات العامة المتوقعة بنهاية 2016 (محفوظ) (بالعربية)/n/r (16 أكتوبر 2016)/n/r
 «صندوق الاستثمارات» يرفع أصوله إلى 224 مليار دولار ويقترب من الـ 10 الكبار (محفوظ) (بالعربية)/n/r (31 أكتوبر 2017)/n/r
 صندوق الاستثمارات العامة يتقدم للمركز الـ12 عالميًا (محفوظ) (بالعربية)/n/r (7 نيسان (أبريل) 2017)/n/r
 صندوق الاستثمارات العامة يقفز إلى المركز الـ 13 عالميا بـ 600 مليار (محفوظ) (بالعربية)/n/r (6 مايو 2016)/n/r
 Public Investment Fund (PIF) - Sovereign Wealth Fund Saudi Arabia - SWFI/n/r www/n/rswfinstitute/n/rorg/n/r مؤرشف من الأصل في 2021-03-30/n/r اطلع عليه بتاريخ 2021-04-14/n/r
 محمد بن سلمان: هناك حقوق للنساء في الإسلام لم يحصلن عليها بعد (محفوظ) (بالعربية)/n/r (23 نيسان (أبريل) 2016)/n/r
 بلومبرغ: 8 ساعات غير مسبوقة مع الأمير محمد بن سلمان (محفوظ) (بالعربية)/n/r (22 نيسان (أبريل) 2016)/n/r
 السعودية ـ إلغاء تدريجي لـالوصاية وإسقاط قيود السفر عن المرأة (محفوظ) (بالعربية)/n/r (31 يناير 2020)/n/r
 السعودية ـ إلغاء تدريجي لـالوصاية وإسقاط قيود السفر عن المرأة (محفوظ) (بالعربية)/n/r (2 أغسطس 2019)/n/r
 الشورى السعودي يدرس إنهاء الولاية على القاصرين ببلوغ الـ18 (محفوظ) (بالعربية)/n/r (9 يوليو 2020)/n/r
 لماذا يشكل ادماج المرأة السعودية في مجتمعها معضلة؟ (محفوظ) (بالعربية)/n/r (30 مايو 2013)/n/r
 لقاء ولي العهد السعودي محمد بن سلمان مع شبكة سي بي إس نيوز الأمريكية (محفوظ) (بالعربية)/n/r (19 مارس 2018)/n/r
 كيف تؤثر قرارات محمد بن سلمان على السعودية؟ (محفوظ) (بالعربية)/n/r (25 ديسمبر 2017)/n/r
 Saudi Arabia women test driving ban (محفوظ)/n/r (17 يونيو 2011)/n/r
 Womens transport: Solutions needed (محفوظ)/n/r (27 يونيو 2009)/n/r
 Saudi Activism Accelerates as Women Dare to Drive (محفوظ)/n/r (18 يونيو 2011)/n/r
 عام / صدور أمر سام باعتماد تطبيق أحكام نظام المرور ولائحته التنفيذية بما فيها إصدار رخص القيادة على الذكور والإناث على حد سواء وكالة الأنباء السعودية (محفوظ)/n/r مؤرشف من الأصل في 18 سبتمبر 2018/n/r وصل لهذا المسار في 26 أيلول (سبتمبر) 2017/n/r
 الملك سلمان يأمر بإصدار رخص قيادة السيارات للمرأة (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 31 ديسمبر 2018/n/r وصل لهذا المسار في 26 أيلول (سبتمبر) 2017/n/r
 شاهد/n/r/n/r إصدار أول رخصة قيادة لسيدة بالسعودية (محفوظ) (بالعربية)/n/r (4 يونيو 2018)/n/r
 محمد بن سلمان: في السابق كنا أكثر مرونة من الآن (محفوظ) (بالعربية)/n/r (1 أبريل 2018)/n/r
 السماح للمرأة السعودية بالسفر دون اشتراط موافقة ولي الأمر (محفوظ) (بالعربية)/n/r (2 أغسطس 2019)/n/r
 السعودية تمضي في طريق إسقاط الولاية عن المرأة (محفوظ) (بالعربية)/n/r (15 يوليو 2019)/n/r
 سقوط جدار برلين السعودي بوقف الولاية على النساء (محفوظ) (بالعربية)/n/r (1 أغسطس 2019)/n/r
 محمد بن سلمان/n/r/n/r السعودية في عز الشباب (محفوظ) (بالعربية)/n/r (11 يونيو 2018)/n/r
 At last Saudi women will be allowed to take the wheel/n/r ذي إيكونوميست/n/r 30 سبتمبر 2017/n/r مؤرشف من الأصل في 2018-05-15/n/r
 الأمير محمد بن سلمان يكشف عن مبادرة لمساواة راتب المرأة بالرجل (محفوظ) (بالعربية)/n/r (19 مارس 2018)/n/r
 محمد بن سلمان: العباءة السوداء ليست شرطا والأهم الحشمة (محفوظ) (بالعربية)/n/r (19 مارس 2018)/n/r
 Saudi Arabia will finally allow women to drive/n/r ذي إيكونوميست/n/r 27 سبتمبر 2017/n/r مؤرشف من الأصل في 2018-03-13/n/r
 عام / صدور ثلاثة أوامر ملكية إضافة ثانية وأخيرة (محفوظ) (بالعربية)/n/r (24 فبراير 2019)/n/r
 من هي أول امراة سعودية تشغل منصب سفيرة في واشنطن؟ (محفوظ) (بالعربية)/n/r (24 فبراير 2019)/n/r
 بعد القرارات الجديدة/n/r/n/r 6 نقاط مهمة للمرأة السعودية (محفوظ) (بالعربية)/n/r (2 أغسطس 2019)/n/r
 السينما تعود للسعودية اليوم بعد انقطاع 40 عامًا (محفوظ) (بالعربية)/n/r (18 نيسان (أبريل) 2015)/n/r
 إنشاء هيئة للترفيه بالسعودية ضمن القرارات الملكية/n/r مجلة سيدتي/n/r 2016-05-07/n/r مؤرشف من الأصل في 5 أكتوبر 2018/n/r اطلع عليه بتاريخ 4 تموز (يوليو) 2017/n/r
 لأول مرة/n/r/n/r هيئة عامة للترفيه بالسعودية (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 16 نوفمبر 2017/n/r وصل لهذا المسار في 4 تموز (يوليو) 2017/n/r
 مجلس الوزراء يوافق على إنشاء هيئة للمتاحف والتراث والأفلام والمكتبات | صحيفة المواطن الإلكترونية/n/r web/n/rarchive/n/rorg/n/r 4 فبراير 2020/n/r مؤرشف من الأصل في 2020-02-04/n/r اطلع عليه بتاريخ 2022-06-15/n/r
 محمد بن سلمان و33 عنواناً عن الرؤية السعودية (محفوظ) (بالعربية)/n/r (25 نيسان (أبريل) 2016)/n/r
 محمد بن سلمان: لن ينجو أي شخص دخل في قضية فساد سواء وزيرا أو أميرا أو أيا كان (محفوظ) (بالعربية)/n/r (2 مايو 2017)/n/r
 السعودية تعلن الحرب على الفساد (محفوظ) (بالعربية)/n/r (4 نوفمبر 2017)/n/r
 السعودية: لجنة عليا برئاسة ولي العهد لمكافحة الفساد (محفوظ) (بالعربية)/n/r (04 نوفمبر 2017)/n/r
 لجنة مكافحة الفساد في السعودية توقف أمراء ووزراء حاليين (محفوظ) (بالعربية)/n/r (5 نوفمبر 2017)/n/r
 السعودية: تجميد حسابات الموقوفين بتهم الفساد (محفوظ) (بالعربية)/n/r (6 نوفمبر 2017)/n/r
 اعتقالات السعودية تصدم الأسواق لكن البعض يعتبرها حملة متأخرة (محفوظ) (بالعربية)/n/r (7 نوفمبر 2017)/n/r
 قيود على الطائرات الخاصة المغادرة من المطارات السعودية (محفوظ) (بالعربية)/n/r (6 نوفمبر 2017 / العدد:14223)/n/r
 «ريتز كارلتون» الرياض يعج بالنزلاء بعد إغلاقه 90 يومًا (محفوظ) (بالعربية)/n/r (12 فبراير 2018 / العدد:14321)/n/r
 محمد بن سلمان: 95% من متهمي الفساد قبلوا بإعادة الأموال/n/r العربية/n/r 24 نوفمبر 2017/n/r مؤرشف من الأصل في 2023-01-30/n/r اطلع عليه بتاريخ 2023-06-18/n/r
 محمد بن سلمان: المرشد الإيراني هتلر جديد في الشرق الأوسط (محفوظ) (بالعربية)/n/r (24 نوفمبر 2017)/n/r
 ما الذي قاله محمد بن سلمان حول إجرءات مكافحة الفساد وحقوق الإنسان في السعودية؟ (محفوظ) (بالعربية)/n/r (25 أكتوبر 2017)/n/r
 محمد بن سلمان: الحملة على الفساد ستعيد أموال الدولة المنهوبة (محفوظ) (بالعربية)/n/r (24 نوفمبر 2017)/n/r
 محمد بن سلمان: سياسة الاسترضاء لا تجدي مع «هتلر إيران» (محفوظ) (بالعربية)/n/r (25 نوفمبر 2017 / العدد:14242)/n/r
 السعودية: حجم التسويات في حملة مكافحة الفساد تجاوز 100 مليار دولار (محفوظ) (بالعربية)/n/r (30 يناير 2018)/n/r
 رئيس هيئة مكافحة الفساد السعودية: نسعى للقضاء على البيروقراطية  (محفوظ) (بالعربية)/n/r (31 أغسطس 2019)/n/r
 محمد بن سلمان: الناتج المحلي غير النفطي مؤشر رئيسي لنجاح خططنا الاقتصادية (محفوظ) (بالعربية)/n/r (12 نوفمبر 2020)/n/r
 عزيمة ولي العهد تحاصر هوامير الفساد  ولصوص الكسب غير المشروع (محفوظ) (بالعربية)/n/r (19 مايو 2020)/n/r
 انتقال الاقتصاد السعودي إلى مرحلة ما بعد النفط (محفوظ) (بالعربية)/n/r (1 ديسمبر 2015)/n/r
 بقيادة ولي العهد /n/r/n/r السعودية تُرسخ منهج مكافحة الفساد /n/r/n/r «لن ينجو من تورط في قضية فساد» (محفوظ) (بالعربية)/n/r (15 نيسان (أبريل) 2020)/n/r
 عام / سمو ولي العهد يُطلق برنامج تنمية القدرات البشرية أحد برامج تحقيق رؤية المملكة 2030/n/r وكالة الأنباء السعودية/n/r 15 أيلول (سبتمبر) 2021/n/r مؤرشف من الأصل في 16 سبتمبر 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 ولي العهد السعودي يطلق برنامجاً لإصلاح التعليم وإعداد المواطن لسوق العمل/n/r موقع قناة الشرق للأخبار/n/r 15 أيلول (سبتمبر) 2021/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Tentative steps in Saudi Arabia: The king of Saudi Arabia shows some reformist credentials/n/r ذي إيكونوميست/n/r 17 فبراير 2009/n/r مؤرشف من الأصل في 2011-06-29/n/r اطلع عليه بتاريخ 2011-07-09/n/r
 Support for shake-up of Saudi justice system/n/r The Financial Times/n/r 4 أكتوبر 2007/n/r مؤرشف من الأصل في 2020-03-08/n/r اطلع عليه بتاريخ 2011-07-10/n/r
 Otto، Jan Michiel (2010)/n/r Sharia Incorporated: A Comparative Overview of the Legal Systems of Twelve Muslim Countries in Past and Present/n/r ص/n/r 161–162/n/r ISBN:978-90-8728-057-4/n/r مؤرشف من الأصل في 2022-06-18/n/r
 Wahhabi Islam: From Revival and Reform to Global Jihad: 100
 Wilson، Peter W/n/r؛ Graham Douglas (1994)/n/r Saudi Arabia: the coming storm/n/r ص/n/r 201/n/r ISBN:1-56324-394-6/n/r
 Saudi to codify Sharia for clarity/n/r Middle East Online/n/r 21 يوليو 2010/n/r مؤرشف من الأصل في 25 يوليو 2010/n/r اطلع عليه بتاريخ 19 يوليو 2011/n/r
 عام / سمو ولي العهد يعلن عن تطوير منظومة التشريعات المتخصصة وكالة الأنباء السعودية/n/r www/n/rspa/n/rgov/n/rsa/n/r مؤرشف من الأصل في 2021-02-09/n/r اطلع عليه بتاريخ 2021-02-08/n/r
 Adnanshabrawi@، عدنان الشبراوي (جدة) (26 أبريل 2020)/n/r مصادر لـ«عكاظ»: لا إعدام للأحداث والقُصّر دون 18 عاما/n/r Okaz/n/r مؤرشف من الأصل في 2020-04-26/n/r اطلع عليه بتاريخ 2020-04-26/n/r
 maryam9902، مريم الصغير (الرياض) (28 أبريل 2020)/n/r «حقوق الإنسان»: إيقاف أحكام الإعدام للأحداث تشمل جرائم الإرهاب/n/r Okaz/n/r مؤرشف من الأصل في 2020-04-28/n/r اطلع عليه بتاريخ 2020-04-28/n/r
 السعودية تلغي عقوبة الجلد/n/r BBC News Arabic/n/r 24 أبريل 2020/n/r مؤرشف من الأصل في 2020-04-24/n/r اطلع عليه بتاريخ 2020-04-24/n/r
 fatimah_a_d@، فاطمة آل دبيس (الرياض) (24 أبريل 2020)/n/r مصادر لـ عكاظ: إيقاف الحكم بالجلد في العقوبات التعزيرية/n/r Okaz/n/r مؤرشف من الأصل في 2020-04-24/n/r اطلع عليه بتاريخ 2020-04-24/n/r
 محمد بن سلمان يعلن عن تطوير منظومة التشريعات المتخصصة/n/r 08-02-2021/n/r البيان/n/r 8 فبراير 2021/n/r مؤرشف من الأصل في 2021-02-08/n/r
 واس، نيوم: (28 ديسمبر 2021)/n/r مجلس الوزراء يقر نظام الإثبات/n/r Watanksa/n/r مؤرشف من الأصل في 2022-06-15/n/r اطلع عليه بتاريخ 2021-12-28/n/r
 مجلس الشورى السعودي يعتمد «الإثبات الرقمي» حجة قانونية/n/r الشرق الأوسط/n/r مؤرشف من الأصل في 2021-12-28/n/r اطلع عليه بتاريخ 2021-12-28/n/r
 محمد بن سلمان: دستورنا هو القرآن ولا مكان للفكر المتطرف بالسعودية/n/r العربية/n/rنت/n/r 28 نيسان (أبريل) 2021/n/r مؤرشف من الأصل في 9 مارس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 السعودية تعيد صياغة علاقة الدين بالدولة/n/r إندبندنت عربية/n/r 30 نيسان (أبريل) 2021/n/r مؤرشف من الأصل في 14 أكتوبر 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Inside the Palace With Mohammed bin Salman (بالإنجليزية)/n/r ذا أتلانتيك/n/r 3 آذار (مارس) 2022/n/r Archived from the original on 3 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 ولي العهد السعودي محمد بن سلمان يتعهد بإعادة (إسلام وسطي معتدل) إلى المملكة (محفوظ) (بالعربية)/n/r (27 أكتوبر 2017)/n/r
 النقد العقائدي - تأليف: عبد الكريم بليل، إصدار: مركز الكتاب الأكاديمي/n/r عام: 2017/n/r صفحة:8/n/r
 الإلكترونية، صحيفة سبق/n/r هذا ما قاله محمد بن سلمان لـالجارديان عن آخر 30 عامًا والتعاليم الجامدة وثورة إيران/n/r صحيفة سبق الإلكترونية/n/r مؤرشف من الأصل في 08 نوفمبر 2017/n/r اطلع عليه بتاريخ 4 تموز (يوليو) 2017/n/r
 محمد بن سلمان: السعودية لم تكن طبيعية بسبب إيران/n/r/n/r وسنعيدها للإسلام المعتدل - اليوم السابع/n/r اليوم السابع (بar-Ar)/n/r 2017-10-25/n/r Archived from the original on 28 ديسمبر 2017/n/r Retrieved 4 تموز (يوليو) 2017/n/r
 Sputnik/n/r بن سلمان يهاجم الثورة الإيرانية ويلومها على هذه الأفكار (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 11 ديسمبر 2019/n/r وصل لهذا المسار في 4 تموز (يوليو) 2017/n/r
 محمد بن سلمان: كانت حياتنا طبيعية/n/r/n/r النساء يقدن السيارات ودور السينما منتشرة (محفوظ) (بالعربية)/n/r (19 مارس 2018)/n/r
 خلال مقابلة تلفزيونية في البرنامج العالمي «60 دقيقة» على شبكة (CBS) الأمريكية - ولي العهد: لن يوقفني عن الإصلاحات إلا الموت (محفوظ) (بالعربية)/n/r (19 مارس 2018)/n/r
 محمد بن سلمان: سندمر الأفكار المتطرفة اليوم وفورًا (محفوظ) (بالعربية)/n/r (24 أكتوبر 2017)/n/r
 محمد بن سلمان: سنقضي على التطرف، وسنعود إلى الإسلام الوسطي (محفوظ) (بالعربية)/n/r (25 أكتوبر 2017 / العدد:14211)/n/r
 العيسى: غزو «الإخوان» النظام التعليمي حقيقة/n/r/n/r ونبذل جهودًا لتخليصه من «شوائب الجماعة» (محفوظ) (بالعربية)/n/r (20 مارس 2018)/n/r
 ماذا تعرف عن مركز الحرب الفكرية السعودي؟ (محفوظ) (بالعربية)/n/r (1 مايو 2017 / العدد:14034)/n/r
 بالتفاصيل /n/r/n/r تعرف على مركز اعتدال الذي دشنه خادم الحرمين مع ترامب لمكافحة الفكر المتطرف (محفوظ) (بالعربية)/n/r (21 مايو 2017)/n/r
 هل تتغيّر الآلية السعودية لمكافحة الإرهاب؟ (محفوظ) (بالعربية)/n/r (9 يناير 2018)/n/r
 الأمير محمد بن سلمان: سنستمر في مواجهة أي تطرف (محفوظ) (بالعربية)/n/r (12 نوفمبر 2020)/n/r
 السعودية تجرِّد هيئة الأمر بالمعروف من صلاحية توقيف الأشخاص/n/r جريدة القبس/n/r 12 نيسان (أبريل) 2016/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 كورونا يعيد الشرطة الدينية في السعودية بـالتوعية بلا وعظ ومطاردات/n/r إندبندنت عربية/n/r 11 نيسان (أبريل) 2020/n/r مؤرشف من الأصل في 29 أكتوبر 2020/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 السعودية تقلص صلاحيات هيئة الأمر بالمعروف/n/r موقع قناة روسيا اليوم/n/r 13 نيسان (أبريل) 2016/n/r مؤرشف من الأصل في 10 مارس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 العاصوف يحيي ذكرى مريرة للسعوديين مع رجال الشرطة الدينية/n/r إندبندنت عربية/n/r 11 نيسان (أبريل) 2022/n/r مؤرشف من الأصل في 18 أبريل 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 وثيقة «رؤية السعودية 2030» - رسالة محمد بن سلمان/n/r 2030 رؤية السعودية/n/r مؤرشف من الأصل في 2023-03-07/n/r اطلع عليه بتاريخ 2023-06-18/n/r
 مجلس الوزراء يوافق على «رؤية السعودية 2030»  (محفوظ) (بالعربية)/n/r (25 نيسان (أبريل) 2016)/n/r
 الموافق : 2 رمضان 1437 هـ/n/r
 مجلس الوزراء يوافق على برنامج التحول الوطني أحد برامج «رؤية السعودية 2030»  (محفوظ) (بالعربية)/n/r (8 مايو 2016)/n/r
 إطلاق برنامج التوازن المالي أحد برامج «رؤية السعودية 2030»  (محفوظ) (بالعربية)/n/r (23 ديسمبر 2016، العدد:1846/صفحة:الثالثة)/n/r
 وثيقة «رؤية السعودية 2030» (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 12 أكتوبر 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 وثيقة «رؤية السعودية 2030» (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 12 أكتوبر 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 وثيقة «رؤية السعودية 2030» - رسالة محمد بن سلمان (محفوظ) (بالعربية)/n/r (7)/n/r
 وثيقة «رؤية السعودية 2030» - رسالة محمد بن سلمان (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 12 أكتوبر 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 محمد بن سلمان: مشروع نيوم/n/r/n/r فرص خيالية ومكان للحالمين (محفوظ) (بالعربية)/n/r (24 أكتوبر 2017)/n/r
 مسؤول سعودي: مصر تتعهد بألف كيلومتر في جنوب سيناء لمشروع مدينة نيوم (محفوظ) (بالعربية)/n/r (5 مارس 2018)/n/r
 محمد بن سلمان في مقابلة مع بلومبيرغ (محفوظ) (بالعربية)/n/r (27 أكتوبر 2017 / العدد:14213)/n/r
 محمد بن سلمان يطلق «نيوم» أول منطقة خاصة تربط السعودية والأردن ومصر (محفوظ) (بالعربية)/n/r (25 أكتوبر 2017)/n/r
 بقيمة 500 مليار دولار/n/r/n/r(نيوم) السعودي (متروبوليس) الشرق الأوسط (محفوظ) (بالعربية)/n/r (25 أكتوبر 2017)/n/r
 تعرف على موقع مشروع نيوم الأكبر بالمنطقة (محفوظ) (بالعربية)/n/r (24 أكتوبر 2017)/n/r
 الفايننشال تايمز : ولي العهد السعودي يبني دافوس على الرمال (محفوظ) (بالعربية)/n/r (28 أكتوبر 2017)/n/r
 محمد بن سلمان يتعهد القضاء على بقايا التطرف في السعودية (محفوظ) (بالعربية)/n/r (20 مارس 2018)/n/r
 ولي العهد السعودي لوكالة رويترز: مدينة نيوم العملاقة الجديدة ستكون مدرجة في الأسواق المالية (محفوظ) (بالعربية)/n/r (26 أكتوبر 2017)/n/r
 نيوم – آن الأوان/n/r/n/r/n/r لنطلق ذا لاين/n/r www/n/rneom/n/rcom/n/r مؤرشف من الأصل في 2021-01-23/n/r اطلع عليه بتاريخ 2021-02-09/n/r
 An Accelerator of human progress/n/r NEOM/n/r مؤرشف من الأصل في 2020-12-08/n/r اطلع عليه بتاريخ 2021-01-10/n/r
 Rashad Aziz El Yaakoubi Marwa (11 Jan 2021)/n/r Saudi Crown Prince launches zero-carbon city in NEOM business zone/n/r Reuters (بالإنجليزية)/n/r Archived from the original on 2021-02-04/n/r Retrieved 2021-02-09/n/r
 عام / سمو ولي العهد يعلن عن تصاميم ذا لاين مدينة المستقبل في نيوم/n/r وكالة الأنباء السعودية/n/r 25 تموز (يوليو) 2022/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 25 تموز (يوليو) 2022/n/r
 محمد بن سلمان يعلن عن أكبر مدينة ترفيهية في العالم (محفوظ) (بالعربية)/n/r (8 نيسان (أبريل) 2017)/n/r
 عشر حقائق عن (القدية) أكبر مدينة ترفيهية بالعالم (محفوظ) (بالعربية)/n/r (28 نيسان (أبريل) 2018)/n/r
 نائب الملك يطلق مشروع البحر الأحمر/n/r/n/r/n/r وجهة سياحية عالمية (محفوظ) (بالعربية)/n/r (1 أغسطس 2017)/n/r
 ولي العهد السعودي يعلن خطة لمشروع سياحي بالبحر الأحمر (محفوظ) (بالعربية)/n/r (1 أغسطس 2017)/n/r
 منطقة خاصة ولا تحتاج إلى تأشيرة دخول/n/r/n/r هل يحول هذا المشروع السعودية إلى وجهة سياحية عالمية؟ (محفوظ) (بالعربية)/n/r (25 أكتوبر 2017)/n/r
 عن مشروع البحر الأحمر: قلة نوعية في صناعة السياحة العالمية (محفوظ) (بالعربية)/n/r (2 أغسطس 2017)/n/r
 محمد بن سلمان: سنعود إلى الإسلام المعتدل الوسطي (محفوظ) (بالعربية)/n/r (24 أكتوبر 2017)/n/r
 مشروع البحر الأحمر: عوائد بـ15 مليار ريال و35 ألف وظيفة (محفوظ) (بالعربية)/n/r (1 أغسطس 2017)/n/r
 «الريفيرا السعودية»/n/r/n/r وجه جديد للسياحة الشاطئية (محفوظ) (بالعربية)/n/r (3 أغسطس 2017)/n/r
 ولي العهد السعودي يُعلن إنشاء أول مدينة غير ربحية بالعالم/n/r الشرق الأوسط/n/r مؤرشف من الأصل في 2021-11-15/n/r اطلع عليه بتاريخ 2021-11-14/n/r
 ولي العهد السعودي يطلق مدينة أوكساجون في نيوم/n/r/n/r أكبر تجمع صناعي عائم بالعالم/n/r العربية/n/r 16 نوفمبر 2021/n/r مؤرشف من الأصل في 2021-11-17/n/r اطلع عليه بتاريخ 2021-11-16/n/r
 طرح {أرامكو} للاكتتاب/n/r/n/r يفتح آفاقًا جديدة للاقتصاد السعودي  (محفوظ) (بالعربية)/n/r (10 يناير 2016)/n/r
 لقاء ولي العهد السعودي محمد بن سلمان مع مجلة ذي إيكونوميست (محفوظ) (بالعربية)/n/r (6 يناير 2016)/n/r
 Saudi Arabia is considering an IPO of Aramco probably the world’s most valuable company (محفوظ) (بالعربية)/n/r (7 يناير 2016)/n/r
 السعودية تدرس بيع أسهم في شركة أرامكو النفطية العملاقة (محفوظ) (بالعربية)/n/r (8 يناير 2016)/n/r
 محمد بن سلمان: 1 % من أرامكو سيكون أكبر اكتتاب في تاريخ الكرة الأرضية (محفوظ) (بالعربية)/n/r (25 نيسان (أبريل) 2016)/n/r
 ثلاثة أسباب وراء احتمال تأخر طرح أرامكو للاكتتاب العام إلى 2019 (محفوظ) (بالعربية)/n/r (12 مارس 2018)/n/r
 الفالح لـCNN: نشعر بقلق من طرح أرامكو في بورصة نيويورك ونحترم بورصة لندن (محفوظ) (بالعربية)/n/r (8 مارس 2018)/n/r
 الفالح: «أرامكو» جاهزة للطرح في 2018/n/r/n/r ونتأكد من الوقت المناسب (محفوظ) (بالعربية)/n/r (25 يناير 2018)/n/r
 حصري-مصادر: وقف خطة طرح أرامكو السعودية وتسريح مستشاري العملية (محفوظ) (بالعربية)/n/r (22 أغسطس 2018)/n/r
 السعودية ملتزمة بطرح أرامكو للاكتتاب (محفوظ) (بالعربية)/n/r (23 أغسطس 2018)/n/r
 الرياض تنفي إلغاء مشروع طرح أسهم أرامكو للبيع (محفوظ) (بالعربية)/n/r (23 أغسطس 2018)/n/r
 رئيس مجلس ادارة أرامكو يعلن موافقة هيئة السوق المالية على الاكتتاب (محفوظ) (بالعربية)/n/r (3 نوفمبر 2019)/n/r
 انطلاق بدء اكتتاب أرامكو بنطاق سعري بين 30 و32 ريالًا للسهم (محفوظ) (بالعربية)/n/r (17 نوفمبر 2019)/n/r
 اكتتاب أرامكو يبدأ اليوم/n/r/n/r وهذا هو النطاق السعري لأسهم الشركة السعودية (محفوظ) (بالعربية)/n/r (17 نوفمبر 2019)/n/r
 الطرح العام الأولي - تفاصيل الاتصال والأسئلة الشائعة (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 10 نوفمبر 2019/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 202020 نوفمبر 2019/n/r
 Saudi Aramco Raises $25/n/r6 Billion in World’s Biggest IPO (محفوظ) (بالإنجليزية)/n/r (5 ديسمبر 2019)/n/r
 بعد يوم من اكتتابها/n/r/n/r أرامكو السعودية أول شركة تبلغ قيمتها تريليوني دولار في العالم (محفوظ) (بالعربية)/n/r (12 ديسمبر 2019)/n/r
 Aramco Soars in Debut to Hit Market Value of $1/n/r88 Trillion (محفوظ) (بالإنجليزية)/n/r (11 ديسمبر 2019)/n/r
 أرامكو /n/r/n/r الوعد يتحقق (محفوظ) (بالعربية)/n/r (11 ديسمبر 2019)/n/r
 محمد بن سلمان لـ«واشنطن بوست»: إن السعودية تمتلك 5 في المئة من احتياطيات اليورانيوم في العالم  (محفوظ) (بالعربية)/n/r (23 مارس 2018)/n/r
 السعودية وروسيا: 16 مفاعلاً نووياً و6 اتفاقيات (محفوظ) (بالعربية)/n/r (18 يونيو 2015)/n/r
 ست اتفاقيات تتوج زيارة ولي ولي العهد السعودي إلى روسيا  (محفوظ) (بالعربية)/n/r (18 يونيو 2015)/n/r
 روسيا والسعودية توقعان اتفاقيات للتعاون في مجال الطاقة والفضاء (محفوظ) (بالعربية)/n/r (18 يونيو 2015)/n/r
 ولي ولي العهد السعودي يلتقي الرئيس هولاند في باريس/n/r/n/r ويعقد اجتماعا ثنائيا مع فابيوس  (محفوظ) (بالعربية)/n/r (25 يونيو 2015)/n/r
 ولي ولي العهد يرسخ في باريس العلاقات الإستراتيجية بين المملكة وفرنسا (محفوظ) (بالعربية)/n/r (27 يونيو 2015)/n/r
 السعودية تقر إنشاء مشروع وطني للطاقة الذرية بعد توصية ولي العهد محمد بن سلمان (محفوظ) (بالعربية)/n/r (24 يوليو 2017)/n/r
 السعودية تطرح عقود أول محطة نووية نهاية 2018 (محفوظ) (بالعربية)/n/r (16 يناير 2018)/n/r
 الإستراتيجية الوطنية للنقل والخدمات اللوجستية/n/r مؤرشف من الأصل في 2021-07-09/n/r
 المنصة اللوجستية/n/r مؤرشف من الأصل في 2021-04-22/n/r
 أهداف الإستراتيجية/n/r مؤرشف من الأصل في 2021-07-09/n/r
 النقل الجوي/n/r مؤرشف من الأصل في 2021-07-09/n/r
 النقل البحري/n/r مؤرشف من الأصل في 2021-07-09/n/r
 قطار الحرمين السريع/n/r مؤرشف من الأصل في 2021-07-11/n/r
 الهيئة العامة لموانئ البحر الأحمر || الموقع الرسمي/n/r www/n/rrspa/n/rgov/n/reg/n/r مؤرشف من الأصل في 2021-03-12/n/r اطلع عليه بتاريخ 2021-06-30/n/r
 النقل البري/n/r مؤرشف من الأصل في 2021-07-09/n/r
 ركائز الإستراتيجية/n/r مؤرشف من الأصل في 2021-07-09/n/r
 اقتصادي / سمو ولي العهد يعلن عن مبادرة السعودية الخضراء ومبادرة الشرق الأوسط الأخضر وكالة الأنباء السعودية/n/r www/n/rspa/n/rgov/n/rsa/n/r مؤرشف من الأصل في 2021-03-27/n/r اطلع عليه بتاريخ 2021-03-27/n/r
 ولي العهد السعودي يعلن عن مبادرة السعودية الخضراء ومبادرة الشرق الأوسط الأخضر/n/r RT Arabic/n/r مؤرشف من الأصل في 2021-03-27/n/r اطلع عليه بتاريخ 2021-03-27/n/r
 ولي العهد السعودي يعلن عن مبادرة السعودية الخضراء ومبادرة الشرق الأوسط/n/r CNBC/n/r مؤرشف من الأصل في 2021-03-27/n/r اطلع عليه بتاريخ 2021-03-27/n/r
 «عكاظ» (الرياض) (27 مارس 2021)/n/r ولي العهد يعلن عن مبادرة «السعودية الخضراء» ومبادرة «الشرق الأوسط الأخضر»/n/r Okaz/n/r مؤرشف من الأصل في 2021-03-27/n/r اطلع عليه بتاريخ 2021-03-27/n/r
 سمو ولي العهد يفتتح منتدى مبادرة السعودية الخضراء بمشاركة إقليمية ودولية واسعة/n/r مؤرشف من الأصل في 2020-11-12/n/r
 ولي العهد السعودي يطلق مخطط رحلة عبر الزمن لتأهيل آثار العلا/n/r CNN Arabic/n/r 7 أبريل 2021/n/r مؤرشف من الأصل في 2021-04-07/n/r اطلع عليه بتاريخ 2021-04-08/n/r
 alkhaldi146@، خالد الخالدي (العلا) (7 أبريل 2021)/n/r ولي العهد يطلق «رحلة عبر الزمن» ضمن برنامج تطوير العلا/n/r Okaz/n/r مؤرشف من الأصل في 2021-04-07/n/r اطلع عليه بتاريخ 2021-04-08/n/r
 محمد بن سلمان يطلق برنامج شريك ويكشف حجم الاستثمارات الجديدة/n/r CNN Arabic/n/r 30 مارس 2021/n/r مؤرشف من الأصل في 2021-04-10/n/r اطلع عليه بتاريخ 2021-04-12/n/r
 اقتصادي / صندوق الاستثمارات العامة يطلق مشروع سدير للطاقة الشمسية وكالة الأنباء السعودية/n/r www/n/rspa/n/rgov/n/rsa/n/r مؤرشف من الأصل في 2021-04-11/n/r اطلع عليه بتاريخ 2021-04-09/n/r
 الصندوق السيادي السعودي يطلق مشروع سدير للطاقة الشمسية/n/r الشرق الأوسط/n/r مؤرشف من الأصل في 2021-04-11/n/r اطلع عليه بتاريخ 2021-04-09/n/r
 بدء تشغيل محطة سكاكا السعودية للطاقة الشمسية/n/r العربية/n/r 9 نوفمبر 2019/n/r مؤرشف من الأصل في 2021-04-08/n/r اطلع عليه بتاريخ 2021-04-08/n/r
 نور، أبها: محمد (4 سبتمبر 2019)/n/r 56 مليارا من طاقة الرياح للناتج المحلي/n/r Watanksa/n/r مؤرشف من الأصل في 2021-04-11/n/r اطلع عليه بتاريخ 2021-04-10/n/r
 المملكة العربية السعودية تطلق العنان لطاقة الرياح/n/r المملكة العربية السعودية تطلق العنان لطاقة الرياح (بar-ae)/n/r Archived from the original on 2021-04-11/n/r Retrieved 2021-04-10/n/r
 رياح دومة الجندل الأكبر في الشرق الأوسط/n/r صحيفة مكة/n/r 16 يناير 2019/n/r مؤرشف من الأصل في 2020-06-08/n/r اطلع عليه بتاريخ 2020-06-08/n/r
 Thomas Hillig (22 يناير 2015)/n/r Renewables for the Mining Sector/n/r decentralized-energy/n/rcom/n/r مؤرشف من الأصل في 2017-07-05/n/r
 ولي العهد يطلق الاستراتيجية الوطنية للاستثمار/n/r صحيفة الاقتصادية/n/r 11 أكتوبر 2021/n/r مؤرشف من الأصل في 2021-10-30/n/r اطلع عليه بتاريخ 2021-10-11/n/r
 ولي العهد يطلق الاستراتيجية الوطنية للاستثمار أحد الممكنات الرئيسة لتحقيق مستهدفات رؤية المملكة 2030/n/r صحيفة سبق الإلكترونية/n/r مؤرشف من الأصل في 2021-10-29/n/r اطلع عليه بتاريخ 2021-10-11/n/r
 Iran Dominates in Iraq After U/n/rS/n/r ‘Handed the Country Over’ (محفوظ) (بالعربية)/n/r (15 يوليو 2017)/n/r
 Around the World Distress Over Iran (محفوظ) (بالعربية)/n/r (28 نوفمبر 2010)/n/r
 Gulf Arabs back unity after hinting at Iran threat (محفوظ) (بالعربية)/n/r (20 ديسمبر 2011)/n/r
 Saudi Arabia: Feeling the Iranian Pinch in Iraq (محفوظ) (بالعربية)/n/r (23 سبتمبر 2005)/n/r
 ولي العهد : دخول أمريكا للعراق خطأ فادح (محفوظ) (بالعربية)/n/r (6 نيسان (أبريل) 2018)/n/r
 الأبعاد والتداعيات:النفوذ الإيراني في لبنان (محفوظ) (بالعربية)/n/r (15 مارس 2016)/n/r
 حزب الله والتماهي مع الثورة الخمينية/n/r/n/r المقاومة في لبنان والولاء لإيران (محفوظ) (بالعربية)/n/r (13 ديسمبر 2013)/n/r
 7 أيار 2008/n/r/n/r/n/r عندما انتحر حزب الله في بيروت! (محفوظ) (بالعربية)/n/r (7 مايو 2014)/n/r
 التصدي لإيران/n/r/n/r هل ينجح العرب؟ (محفوظ) (بالعربية)/n/r (19 نوفمبر 2017)/n/r
 أبرز المحطات قبل وبعد عملية عاصفة الحزم (محفوظ) (بالعربية)/n/r (29 ديسمبر 2015)/n/r
 سيناريوات أخطر من حروب الوكالة/n/r/n/r/n/r أين يمكن أن تنفجر بين السعودية وايران؟ (محفوظ) (بالعربية)/n/r (15 يناير 2016)/n/r
 «عاصفة الحزم» تبدأ ضد الحوثيين في اليمن/n/r/n/r والقوات السعودية تسيطر على الأجواء (محفوظ) (بالعربية)/n/r (26 مارس 2015 / العدد:13267)/n/r
 أزمة اليمن: لماذا شنت دول الخليج حربا على الحوثيين؟ (محفوظ) (بالعربية)/n/r (الثالث من مايو 2015)/n/r
 حرب عاصفة الحزم على مستويات أخرى ! (محفوظ) (بالعربية)/n/r (9 نيسان (أبريل) 2015)/n/r
 بن سلمان: إيران أكبر عدو (محفوظ) (بالعربية)/n/r (20 نيسان (أبريل) 2015)/n/r
 خبراء ومحللون:«عاصفة الحزم» الرد الطبيعي لوقف تدخلات طهران في المنطقة (محفوظ) (بالعربية)/n/r (15 يناير 2016 / العدد:13562)/n/r
 السعودية تقطع العلاقات مع إيران وتطرد بعثتها الدبلوماسية (محفوظ) (بالعربية)/n/r (الرابع من يناير 2016)/n/r
 المخابرات الألمانية: السعودية تتبع سياسة اندفاعية بالمنطقة (محفوظ) (بالعربية)/n/r (الثاني من ديسمبر 2015)/n/r
 المخابرات الألمانية تحذر من جنوح السياسة السعودية إلى الاندفاع (محفوظ) (بالعربية)/n/r (الثاني من ديسمبر 2015)/n/r
 تغيرات جذرية في سياسة خارجية سعودية أكثر جرأة  (محفوظ) (بالعربية)/n/r (25 فبراير 2016 / السنة:38)/n/r
 Mohammad Javad Zarif: Saudi Arabia’s Reckless Extremism (محفوظ) (بالعربية)/n/r (11 يناير 2016)/n/r
 الأمير محمد بن سلمان: لن ننتظر حتى تصبح المعركة مع إيران في السعودية (محفوظ) (بالعربية)/n/r (الثالث من مايو 2017)/n/r
 ٔقليات-بلا-حقوق-ومطالب-بلا-ا ٔفق إيران/n/r/n/r أقليات بلا حقوق ومطالب بلا أفق (ٔقليات-بلا-حقوق-ومطالب-بلا-ا ٔفق محفوظ) (بالعربية)/n/r (28 يونيو 2016)/n/r
 قائد الأمن الداخلي الإيراني يتّهم السعودية بدعم أطراف داخلية إيرانية (محفوظ) (بالعربية)/n/r (8 مايو 2018)/n/r
 بن سلمان: إيران أكبر عدو (محفوظ) (بالعربية)/n/r (7 نيسان (أبريل) 2018)/n/r
 محمد بن سلمان: الحرب مع إيران ستكون كارثة كبرى ولن نسمح باندلاعها (محفوظ) (بالعربية)/n/r (8 يناير 2016)/n/r
 الحريري يصل إلى بيروت للمرة الأولى منذ استقالته كرئيس للوزراء/n/r وكالة رويترز للأنباء/n/r 21 تشرين الثاني (نوفمبر) 2017/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 نقش ولیعهد سعودی در خروج ترامپ از برجام (محفوظ) (بالعربية)/n/r (28 نيسان (أبريل) 2018)/n/r
 نقش ولیعهد سعودی در خروج ترامپ از برجام (محفوظ) (بالفارسية)/n/r (8 نيسان (أبريل) 2018)/n/r
 تنها 2 كشور در جهان با برجام مخالفند (محفوظ) (بالفارسية)/n/r (الأول من مايو 2018)/n/r
 إيران ترد على محمد بن سلمان/n/r/n/r وتدعو إلى النظر لـمصير صدام (محفوظ) (بالعربية)/n/r (12 نيسان (أبريل) 2018)/n/r
 ولي العهد السعودي: نمتلك 5% من احتياطيات اليورانيوم (محفوظ) (بالعربية)/n/r (25 مارس 2018)/n/r
 جلسات الكونغرس تفضح وجود ملاحق سرية في الاتفاق النووي (محفوظ) (بالعربية)/n/r (30 يوليو 2015)/n/r
 وثيقة سرية حول الملف النووي الإيراني تربك المجتمع الدولي (محفوظ) (بالعربية)/n/r (20 يوليو 2016)/n/r
 الاتفاق النووي وتداعياته على الحضور الإيراني بالمنطقة (محفوظ) (بالعربية)/n/r (سبتمبر 2015 / العدد:99 / صفحة:57)/n/r
 إيران النووية: هل تشعل السباق النووي في المنطقة؟ (محفوظ) (بالعربية)/n/r (سبتمبر 2015 / العدد:99 / صفحة:62)/n/r
 ما هو اتفاق 1938 الذي استشهد به ولي العهد السعودي وما نتائجه؟ (محفوظ) (بالعربية)/n/r (11 نيسان (أبريل) 2018)/n/r
 أوروبا تلعق جراحها والسعودية تشيد بقرار ترامب (محفوظ) (بالعربية)/n/r (10 مايو 2018)/n/r
 محمد بن سلمان يصل إلى واشنطن ويلتقي ترامب اليوم (محفوظ) (بالعربية)/n/r (20 مارس 2018)/n/r
 السعودية تقول دعم إيران للهجوم على أرامكو لا يمكن إنكاره وتعرض أسلحة/n/r وكالة رويترز للأنباء/n/r 18 أيلول (سبتمبر) 2019/n/r مؤرشف من الأصل في 4 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Exclusive: U/n/rN/n/r investigators find Yemens Houthis did not carry out Saudi oil attack (بالإنجليزية)/n/r وكالة رويترز للأنباء/n/r 8 كانون الثاني (يناير) 2020/n/r Archived from the original on 6 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 سليماني يشيد بالحوثيين بعد هجوم على معمليّ نفط سعوديين/n/r شبكة يمن مونيتور الإخبارية/n/r 15 أيلول (سبتمبر) 2019/n/r مؤرشف من الأصل في 5 مايو 2020/n/r اطلع عليه بتاريخ 19 أيلول (سبتمبر) 2019/n/r
 بعد توقف لأشهر/n/r/n/r/n/r استئناف جلسات الحوار بين السعودية وإيران لتحسين العلاقات المتوترة بينهما/n/r فرانس 24/n/r 23 نيسان (أبريل) 2022/n/r مؤرشف من الأصل في 26 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 ولي العهد السعودي: سلوك إيران السلبي هو مشكلتنا معها/n/r العربية/n/rنت/n/r 28 نيسان (أبريل) 2021/n/r مؤرشف من الأصل في 22 مارس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 محمد بن سلمان: تستطيع السعودية اجتثاث الحوثي وصالح بـأيام قليلة ولكن لا نريد المخاطرة بحياة المدنيين (محفوظ) (بالعربية)/n/r (الثالث من مايو 2017)/n/r
 «عاصفة الحزم» تعيد 85 في المائة من أراضي اليمن إلى الشرعية (محفوظ) (بالعربية)/n/r (26 مارس 2017 / العدد:13998)/n/r
 تقرير أممي يتهم التحالف والحوثيين بارتكاب فظائع في اليمن (محفوظ) (بالعربية)/n/r (31 يناير 2017)/n/r
 دعوة مجلس حقوق الإنسان التابع للأمم المتحدة بالتحقيق في تقارير حول استهداف مدنيين في اليمن (محفوظ) (بالعربية)/n/r (18 فبراير 2016 / رقم الوثيقة:MDE 31/3390/2016)/n/r
 محمد بن سلمان: سنتدخل برياً في اليمن إذا اقتضت الضرورة وطلبت حكومته الشرعية (محفوظ) (بالعربية)/n/r (السابع من نيسان (أبريل) 2018 / العدد:14375)/n/r
 أنصار الله على بعد أمتار من الحرس السعودي وسيخوضون حرب استنزاف (محفوظ) (بالعربية)/n/r (30 مارس 2015)/n/r
 ما هي أبرز تصريحات ولي عهد السعودية الجديد عن إيران ومصر واليمن وأمريكا والإرهاب والاقتصاد؟ (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 محمد بن سلمان يطالب ببقاء القوات الأمريكية بسوريا/n/r/n/rوترامب يبلغ مستشاريه برغبته في الانسحاب (محفوظ) (بالعربية)/n/r (26 مارس 2018 / السنة:142)/n/r
 محمد بن سلمان: لولا التحالف لانقسم اليمن بين الحوثي والقاعدة (محفوظ) (بالعربية)/n/r (31 مارس 2017)/n/r
 لقاء ولي العهد السعودي محمد بن سلمان مع مجلة تايم (محفوظ) (بالعربية)/n/r (عدد نيسان (أبريل) 2018)/n/r
 ولي عهد السعودية: أمريكا اقترفت خطأين/n/r/n/r وسوريا جزء من نفوذ روسيا (محفوظ) (بالعربية)/n/r (6 نيسان (أبريل) 2018)/n/r
 محمد بن سلمان: بشار باق (محفوظ) (بالعربية)/n/r (30 مارس 2018)/n/r
 محمد بن سلمان: ليس من مصلحة الأسد إطلاق يد إيران في سوريا (محفوظ) (بالعربية)/n/r (1 نيسان (أبريل) 2018 / العدد:14369)/n/r
 ولي عهد السعودية: بشار الأسد سيبقى ومن مصلحته ألا يكون دمية بيد إيران (محفوظ) (بالعربية)/n/r (31 مارس 2018)/n/r
 الأمير محمد بن سلمان لـ«Time»: إيران العدو الأكبر (محفوظ) (بالعربية)/n/r (6 نيسان (أبريل) 2018)/n/r
 محمد بن سلمان يطالب ببقاء القوات الأمريكية بسوريا/n/r/n/rوترامب يبلغ مستشاريه برغبته في الانسحاب (محفوظ) (بالعربية)/n/r (1 نيسان (أبريل) 2018 / السنة:142)/n/r
 Milliken Giorgio CafieroEmily/n/r Analysis: How important is Syrias return to the Arab League?/n/r Al Jazeera (بالإنجليزية)/n/r Archived from the original on 2023-10-16/n/r Retrieved 2024-01-25/n/r
 Aziz El Yaakoubi and Samia Nakhoul/n/r Syrias Assad wins warm welcome at Arab summit after years of isolation/n/r Reuters/n/r مؤرشف من الأصل في 2023-10-20/n/r
 محمد بن سلمان: لا علاقة مع إسرائيل قبل حل قضية السلام مع الفلسطينيين (محفوظ) (بالعربية)/n/r (6 نيسان (أبريل) 2018)/n/r
 ولي العهد السعودي: الإسرائيليون لهم الحق في العيش على أرضهم (محفوظ) (بالعربية)/n/r (3 نيسان (أبريل) 2018)/n/r
 الأمير محمد بن سلمان لمجلة «ذا أتلانتيك»: الإخوان يريدون استغلال الديمقراطية لنشر «الخلافة» (محفوظ) (بالعربية)/n/r (3 نيسان (أبريل) 2018)/n/r
 ولي العهد السعودي: الإسرائيليون لهم حق العيش بسلام على أرضهم (محفوظ) (بالعربية)/n/r (2 نيسان (أبريل) 2018)/n/r
 لقاء ولي العهد السعودي محمد بن سلمان مع مجلة ذا أتلانتيك (محفوظ) (بالعربية)/n/r (عدد نيسان (أبريل) 2018)/n/r
 محمد بن سلمان: قرار ترامب بشأن القدس خطوة مؤلمة (محفوظ) (بالعربية)/n/r (23 مارس 2018)/n/r
 الملك سلمان: القضية الفلسطينية هي قضيتنا الأولى (محفوظ) (بالعربية)/n/r (15 نيسان (أبريل) 2018)/n/r
 محمد بن سلمان يبحث في إسبانيا ملفات سياسية واقتصادية  (محفوظ) (بالعربية)/n/r (12 نيسان (أبريل) 2018 / العدد:14380)/n/r
 «إعلان قمة الظهران» يؤكد بطلان القرار الأميركي بشأن القدس (محفوظ) (بالعربية)/n/r (16 نيسان (أبريل) 2018 / العدد:14384)/n/r
 التبادل التجاري بين السعودية والصين يتضاعف 10 مرات في 12 عاما/n/r جريدة الاقتصادية/n/r 17 كانون الثاني (يناير) 2016/n/r مؤرشف من الأصل في 29 أغسطس 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 اختتام القمة السعودية الصينية بإعلان شراكة شاملة/n/r العربية/n/rنت/n/r 29 كانون الثاني (يناير) 2016/n/r مؤرشف من الأصل في 2 مارس 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 زيارة العاهل السعودي الملك سلمان بن عبد العزيز تدفع تنمية علاقات بلاده مع الصين/n/r صحيفة الشعب اليومية/n/r 17 آذار (مارس) 2017/n/r مؤرشف من الأصل في 17 مارس 2017/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 العلاقات الاقتصادية بين الصين والسعودية تتطور على نحو أعمق وأكثر استمرارية/n/r وكالة أنباء شينخوا/n/r 23 آب (أغسطس) 2017/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 إتباعا للماضي واستشرافا للمستقبل: الصين والسعودية تواصلان خلق حقبة جديدة من العلاقات الودية والإستراتيجية/n/r وكالة أنباء شينخوا/n/r 25 شباط (فبراير) 2019/n/r مؤرشف من الأصل في 25 فبراير 2019/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 خطط للتوسع في تدريس اللغة الصينية في المدارس السعودية/n/r جريدة الشرق الأوسط/n/r 20 كانون الثاني (يناير) 2020 / العدد:15028/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 زيارة ولي العهد السعودي للصين تثمر 35 اتفاقية بقيمة 28 مليار دولار/n/r جريدة العرب اللندنية/n/r 23 شباط (فبراير) 2019/n/r مؤرشف من الأصل في 30 ديسمبر 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Ensor، Josie (22 فبراير 2019)/n/r Saudi crown prince defends Chinas right to put Uighur Muslims in concentration camps/n/r ديلي تلغراف/n/r مؤرشف من الأصل في 2021-01-25/n/r
 Saudi Arabias Mohammed bin Salman Defends Chinas Use of Concentration Camps for Muslims During Visit to Beijing/n/r Newsweek/n/r 22 فبراير 2019/n/r مؤرشف من الأصل في 2021-01-18/n/r
 Saudi crown prince defended Chinas imprisonment of a million Muslims in internment camps giving Xi Jinping a reason to continue his precursors to genocide/n/r Business Insider/n/r 23 فبراير 2019/n/r مؤرشف من الأصل في 2020-12-10/n/r
 الصين تعرب عن استعدادها لإقامة تعاون شامل ورفيع المستوى مع السعودية/n/r موقع قناة روسيا اليوم/n/r 23 آذار (مارس) 2022/n/r مؤرشف من الأصل في 14 أبريل 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 الصين تكشف ما قاله رئيسها خلال اتصاله مع محمد بن سلمان/n/r موقع شبكة سي إن إن الأمريكية/n/r 15 نيسان (أبريل) 2022/n/r مؤرشف من الأصل في 3 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 محمد بن سلمان يدفع بالعلاقات السعودية ـ الصينية نحو الاستثمار في المستقبل/n/r جريدة الشرق الأوسط/n/r 23 شباط (فبراير) 2019 / العدد:14697/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 اتفاق سعودي صيني لبناء مصنع للطائرات بدون طيار بالمملكة/n/r العربية/n/rنت/n/r 5 حزيران (يونيو) 2022/n/r مؤرشف من الأصل في 18 مارس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 العلاقات العسكرية بين السعودية والصين/n/r/n/r كثير من السرية قليل من التعقيد/n/r جريدة العرب اللندنية/n/r 29 كانون الأول (ديسمبر) 2021/n/r مؤرشف من الأصل في 5 يناير 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 مصادر تكشف لـCNN معلومات استخباراتية عن برنامج صاروخي للسعودية بمساعدة الصين/n/r موقع شبكة سي إن إن الأمريكية/n/r 6 حزيران (يونيو) 2019/n/r مؤرشف من الأصل في 29 يوليو 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 محمد بن سلمان: إذا طورت إيران قنبلة نووية سنفعل الشيء نفسه/n/r موقع شبكة سي إن إن الأمريكية/n/r 15 آذار (مارس) 2022/n/r مؤرشف من الأصل في 11 أبريل 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 لسعودية تطور برنامجا سريا للصواريخ الباليستية بمساعدة الصين من دون علم واشنطن /n/r/n/r/n/r وغضب ديمقراطي/n/r إندبندنت عربية/n/r 6 حزيران (يونيو) 2019/n/r مؤرشف من الأصل في 8 نوفمبر 2020/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 تقرير: مدير سي آي إيه التقى ولي العهد السعودي لـإصلاح العلاقات/n/r موقع قناة الشرق للأخبار/n/r 3 أيّار (مايو) 2022/n/r مؤرشف من الأصل في 3 مايو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 العلاقات السعودية الأمريكية: تحالف دائم واختلافات طارئة (محفوظ) (بالعربية)/n/r (22 مايو 2017)/n/r
 وسط توتر التحالفات /n/r/n/r أوباما يسعى لطمأنة دول الخليج بشأن إيران (محفوظ) (بالعربية)/n/r (19 نيسان (أبريل) 2016)/n/r
 The Obama Doctrine (محفوظ) (بالعربية)/n/r (عدد نيسان (أبريل) 2016)/n/r
 ما مستقبل العلاقات السعودية الأمريكية بعد توقيع الاتفاق الإيراني؟ (محفوظ) (بالعربية)/n/r (16 يوليو 2015)/n/r
 مسؤول أمريكي: مناقشة زيارة محتملة لترامب إلى السعودية (محفوظ) (بالعربية)/n/r (19 نيسان (أبريل) 2017)/n/r
 العلاقات الأمريكية السعودية ـ حرارة الصفقات تذيب ثلوج الخلافات! (محفوظ) (بالعربية)/n/r (19 مايو 2017)/n/r
 البيت الأبيض: ترامب وولي العهد السعودي بحثا خطر الحوثيين في اليمن (محفوظ) (بالعربية)/n/r (21 مارس 2018)/n/r
 ترامب: لن نقبل الابتزاز النووي (محفوظ) (بالعربية)/n/r (8 مايو 2018)/n/r
 لماذا ترفض إدارة ترامب الاتفاق النووي الإيراني؟ (محفوظ) (بالعربية)/n/r (13 أكتوبر 2017)/n/r
 ترامب يلتقي مع ولي ولي العهد السعودي في البيت الأبيض (محفوظ) (بالعربية)/n/r (14 مارس 2018)/n/r
 مسؤولة سابقة في البيت الأبيض: ترامب وجد شريكا قويا في ابن سلمان (محفوظ) (بالعربية)/n/r (28 مارس 2018)/n/r
 ترمب يلتقي ولي العهد السعودي بواشنطن في 20 مارس (محفوظ) (بالعربية)/n/r (12 مارس 2018)/n/r
 أول جولة خارجية لترامب تشمل السعودية وإسرائيل والفاتيكان (محفوظ) (بالعربية)/n/r (الرابع من مايو 2017)/n/r
 عقود دفاعية واستثمار متبادل/n/r/n/r هذه الصفقات التي سينشغل ترامب بإبرامها في السعودية (محفوظ) (بالعربية)/n/r (19 مايو 2017)/n/r
 ترامب يعلن صفقات بين السعودية وأمريكا تتجاوز 400 مليار دولار/n/r/n/r تعرّف على أبرزها (محفوظ) (بالعربية)/n/r (21 مايو 2017)/n/r
 ولي عهد السعودية يلتقي شخصيات بارزة في وول ستريت الأسبوع القادم (محفوظ) (بالعربية)/n/r (23 مارس 2018)/n/r
 ترامب يشيد بمبيعات السلاح الأمريكية في اجتماع مع ولي عهد السعودية (محفوظ) (بالعربية)/n/r (20 مارس 2018)/n/r
 Joe Biden on Being Vice President: Isnt It a Bitch? (بالإنجليزية)/n/r جريدة بوسطن/n/r 2 تشرين الأول (أكتوبر) 2014/n/r Archived from the original on 15 يناير 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 Biden adds Saudi Arabia to his apology list over Islamic State (بالإنجليزية)/n/r وكالة رويترز للأنباء/n/r 7 تشرين الأول (أكتوبر) 2014/n/r Archived from the original on 21 يناير 2021/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 بايدن يعتذر للمملكة عن التصريحات حول «الإرهاب»/n/r جريدة الرياض/n/r 8 تشرين الأول (أكتوبر) 2014/n/r مؤرشف من الأصل في 16 يناير 2015/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 بايدن يعتذر للسعودية بعد تصريحات اتهم فيها الرياض بتمويل وتسليح الإرهاب/n/r فرانس 24/n/r 8 تشرين الأول (أكتوبر) 2014/n/r مؤرشف من الأصل في 29 ديسمبر 2020/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 بايدن يعتذر للفيصل عن اتهامه السعودية بدعم الإرهاب/n/r جريدة الرأي الكويتية/n/r 9 تشرين الأول (أكتوبر) 2014/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 ما مستقبل العلاقات السعودية الأمريكية بعد توقيع الاتفاق الإيراني؟/n/r فرانس 24/n/r 16 تموز (يوليو) 2015/n/r مؤرشف من الأصل في 10 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 باختياره لهاريس، بايدن يختار مرشحة ديمقراطية مؤيدة تقليديا لإسرائيل/n/r تايمز إسرائيل/n/r 12 آب (أغسطس) 2020/n/r مؤرشف من الأصل في 16 يناير 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 السعودية وروسيا: 16 مفاعلاً نووياً و6 اتفاقيات/n/r العربية/n/rنت/n/r 18 حزيران (يونيو) 2015/n/r مؤرشف من الأصل في 9 مارس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Candidates Answer CFRs Questions: Joe Biden (بالإنجليزية)/n/r مجلس العلاقات الخارجية/n/r 1 آب (أغسطس) 2019/n/r Archived from the original on 3 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 Biden says Trump made gigantic mistake withdrawing US from Iran nuclear deal (بالإنجليزية)/n/r موقع شبكة سي إن إن الأمريكية/n/r 13 تموز (يوليو) 2022/n/r Archived from the original on 1 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 بايدن يهدد السعودية بدفع الثمن/n/r موقع قناة روسيا اليوم/n/r 21 تشرين الثاني (نوفمبر) 2019/n/r مؤرشف من الأصل في 13 نوفمبر 2020/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 واشنطن: سنتواصل مع الرياض عبر الملك سلمان وليس ولي عهده/n/r موقع قناة روسيا اليوم/n/r 16 شباط (فبراير) 2022/n/r مؤرشف من الأصل في 26 فبراير 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 بايدن: أوضحت للملك سلمان أن القواعد تغيرت/n/r/n/r وسنحاسبهم على انتهاكات حقوق الإنسان/n/r موقع شبكة سي إن إن الأمريكية/n/r 26 شباط (فبراير) 2021/n/r مؤرشف من الأصل في 4 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 النص الكامل لتقرير الاستخبارات الأمريكية: محمد بن سلمان وافق على عملية خاشقجي/n/r موقع شبكة سي إن إن الأمريكية/n/r 26 شباط (فبراير) 2021/n/r مؤرشف من الأصل في 4 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 البيت الأبيض يكشف تفاصيل محادثات خالد بن سلمان في واشنطن/n/r وكالة أنباء سبوتنيك/n/r 7 تموز (يوليو) 2021/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Top Biden Aide Sullivan to Meet With Saudi Crown Prince Monday (بالإنجليزية)/n/r بلومبيرغ نيوز/n/r 27 أيلول (سبتمبر) 2021/n/r Archived from the original on 27 سبتمبر 2021/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 How U/n/rS/n/r-Saudi Relations Reached the Breaking Point (بالإنجليزية)/n/r وول ستريت جورنال/n/r 19 نيسان (أبريل) 2022/n/r Archived from the original on 29 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 وول ستريت جورنال: كيف وصلت العلاقات السعودية-الأمريكية إلى هذا المستوى؟/n/r موقع 24 الإخباري/n/r 20 نيسان (أبريل) 2022/n/r مؤرشف من الأصل في 14 مايو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 وول ستريت جورنال تنشر خفايا التوتر بين إدارة بايدن والسعودية/n/r جريدة النهار اللبنانية/n/r 20 نيسان (أبريل) 2022/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 نص ما قاله محمد بن سلمان بإجابة على 72 سؤالا مع استمرار التفاعل لليوم الـ3 على نشر مقابلة ولي العهد/n/r موقع شبكة سي إن إن الأمريكية/n/r 6 آذار (مارس) 2022/n/r مؤرشف من الأصل في 3 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 بلومبيرغ: إدارة بايدن تبحث مدى جدية تصريحات بن سلمان لمجلة ذي أتلانتيك/n/r موقع قناة روسيا اليوم/n/r 22 آذار (مارس) 2022/n/r مؤرشف من الأصل في 12 أبريل 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Saudi Emirati Leaders Decline Calls With Biden During Ukraine Crisis (بالإنجليزية)/n/r وول ستريت جورنال/n/r 8 آذار (مارس) 2022/n/r Archived from the original on 3 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 بعد تقرير رفض التحدث هاتفيا مع بايدن/n/r/n/r تعليق إماراتي وآخر أميركي/n/r موقع قناة الحرة الأمريكية/n/r 10 آذار (مارس) 2022/n/r مؤرشف من الأصل في 25 أبريل 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Saudi Emirati Leaders Decline Calls With Biden During Ukraine Crisis (بالإنجليزية)/n/r وول ستريت جورنال/n/r 15 آذار (مارس) 2022/n/r Archived from the original on 3 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 النفط السعودي باليوان الصيني/n/r/n/r خطوة دراماتيكية مرتقبة وتحذير لولي العهد/n/r موقع قناة الحرة الأمريكية/n/r 15 آذار (مارس) 2022/n/r مؤرشف من الأصل في 5 أبريل 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 تقرير: السعودية تدرس بيع النفط إلى الصين بـ«اليوان»/n/r صحيفة عكاظ/n/r 16 آذار (مارس) 2022/n/r مؤرشف من الأصل في 10 يونيو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 هل سينتهي عصر البترودولار قريبا؟/n/r موقع هيئة الإذاعة البريطانية بي بي سي/n/r 26 آذار (مارس) 2022/n/r مؤرشف من الأصل في 21 يونيو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 CIA Chief Met Saudi Crown Prince Last Month in Push to Mend Ties (بالإنجليزية)/n/r وول ستريت جورنال/n/r 3 أيّار (مايو) 2022/n/r Archived from the original on 14 يوليو 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 Scoop: Biden officials in Saudi Arabia for talks on oil planned visit (بالإنجليزية)/n/r موقع أكسيوس/n/r 25 أيّار (مايو) 2022/n/r Archived from the original on 14 يوليو 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 مسؤولان أميركيان في السعودية بزيارة غير معلنة/n/r موقع قناة الحرة الأمريكية/n/r 25 أيّار (مايو) 2022/n/r مؤرشف من الأصل في 7 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 White House postpones Biden trips to Saudi Arabia and Israel (بالإنجليزية)/n/r إن بي سي نيوز/n/r 3 حزيران (يونيو) 2022/n/r Archived from the original on 3 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 الديوان الملكي : بدعوة من خادم الحرمين الشريفين/n/r/n/r رئيس الولايات المتحدة الأمريكية يزور المملكة 15 و 16 يوليو القادم/n/r وزارة الخارجية السعودية/n/r 14 حزيران (يونيو) 2022/n/r مؤرشف من الأصل في 15 يوليو 2022/n/r اطلع عليه بتاريخ 15 تموز (يوليو) 2022/n/r
 Joe Biden: Why Im going to Saudi Arabia (بالإنجليزية)/n/r واشنطن بوست/n/r 9 تموز (يوليو) 2022/n/r Archived from the original on 13 يوليو 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 بايدن يكتب مقالا لماذا سأذهب إلى السعودية؟ ويثير تفاعلا قبل أيام على زيارة المملكة/n/r موقع شبكة سي إن إن الأمريكية/n/r 9 تموز (يوليو) 2022/n/r مؤرشف من الأصل في 4 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 A New Shape for US-Saudi Relations (بالإنجليزية)/n/r بوليتيكو/n/r 14 تموز (يوليو) 2022/n/r Archived from the original on 18 يوليو 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 Arab Summit fails to give President Biden what he wants (بالإنجليزية)/n/r جيروزاليم بوست/n/r 17 تموز (يوليو) 2022/n/r Archived from the original on 1 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 استقبله الأمير خالد الفيصل لدى وصوله إلى جدة؛ بايدن: انسحاب قوات حفظ السلام من تيران وصنافير/n/r إيلاف/n/r 15 تموز (يوليو) 2022/n/r مؤرشف من الأصل في 19 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 خلافا لاستقبال بايدن/n/r/n/r محمد بن سلمان يرحب بالزعماء العرب بنفسه في المطار/n/r موقع قناة روسيا اليوم/n/r 16 تموز (يوليو) 2022/n/r مؤرشف من الأصل في 30 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 بايدن في السعودية/n/r/n/r يصافح ولي العهد ويجتمع مع الملك بحضوره/n/r دويتشه فيله/n/r 15 تموز (يوليو) 2022/n/r مؤرشف من الأصل في 24 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 بايدن: لن أعقد اجتماعا ثنائيا مع محمد بن سلمان/n/r دويتشه فيله/n/r 17 حزيران (يونيو) 2022/n/r مؤرشف من الأصل في 11 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 محمد بن سلمان يجتمع مع بايدن في قصر السلام بجدة/n/r جريدة الشرق الأوسط/n/r 15 تموز (يوليو) 2022/n/r مؤرشف من الأصل في 23 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 محمد بن سلمان: مثلث الشر يحاول السيطرة على العالم (محفوظ) (بالعربية)/n/r (الرابع من نيسان (أبريل) 2018)/n/r
 محمد بن سلمان: «الإخوان» الخطر الأكبر عبر دعمها التطرّف والفوضى في المنطقة والعالم (محفوظ) (بالعربية)/n/r (7 نيسان (أبريل) 2018)/n/r
 محمد بن سلمان: مثلث الشر إيران والإخوان وجماعات التطرف (محفوظ) (بالعربية)/n/r (الرابع من نيسان (أبريل) 2018)/n/r
 محمد بن سلمان: مثلث الشر إيران والإخوان والجماعات الإرهابية (محفوظ) (بالعربية)/n/r (الثالث من نيسان (أبريل) 2018)/n/r
 لقاء ولي العهد السعودي محمد بن سلمان مع صحيفة وول ستريت (محفوظ) (بالعربية)/n/r (29 مارس 2018)/n/r
 الأمير محمد بن سلمان: الإخوان حاضنة للإرهابيين (محفوظ) (بالعربية)/n/r (30 مارس 2018)/n/r
 الأمير محمد بن سلمان لمجلة «ذا أتلانتيك»: الإخوان يريدون استغلال الديمقراطية لنشر «الخلافة» (محفوظ) (بالعربية)/n/r (3 نيسان (أبريل) 2018)/n/r
 ولي العهد السعود يتعهد بالقضاء على فكر الإخوان (محفوظ) (بالعربية)/n/r (20 مارس 2018 / السنة:40)/n/r
 جماعة الإخوان المسلمون تشن هجوما حادا على محمد بن سلمان (محفوظ) (بالعربية)/n/r (7 نيسان (أبريل) 2018)/n/r
 إيران ترد على تصريحات ابن سلمان بشأن (مثلث الشر) (محفوظ) (بالعربية)/n/r (13 مارس 2018)/n/r
 القاعدة تهاجم المشاريع الإصلاحيّة لمحمد بن سلمان (محفوظ) (بالعربية)/n/r (الأوّل من يونيو 2018)/n/r
 مجلس الإدارة (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 04 أبريل 2017/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 20202 أغسطس 2020/n/r
 مدارس الرياض (محفوظ)/n/r مؤرشف من الأصل في 28 سبتمبر 2018/n/r وصل لهذا المسار في 14 آب (أغسطس) 2017/n/r
 :: مؤسسة عبد العزيز بن باز الخيرية : (محفوظ)/n/r مؤرشف من الأصل في 28 سبتمبر 2018/n/r وصل لهذا المسار في 4 تموز (يوليو) 2017/n/r
 رؤساء فخريين للجمعية السعودية للإدارة (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 16 أغسطس 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 الأمير سلمان يحتفل بزواج نجله محمد (محفوظ) (بالعربية)/n/r (1 ربيع الأخر 1429هـ -7 أبريل 2008م - العدد: 14532)/n/r
 محمد بن سلمان/n/r/n/r قدرة سياسية وعطاء خيري (محفوظ) (بالعربية)/n/r (5 مارس 2016)/n/r
 الأمير محمد بن سلمان يُرزق بمولود جديد/n/r/n/r ويسميه «مشهور» (محفوظ)/n/r (9 مايو 2015)/n/r
 الأمير محمد بن سلمان يُرزق بمولود جديد/n/r/n/r ويسميه «عبدالعزيز» (محفوظ) (بar-SA)/n/r (17 أبريل 2021)/n/r
 السعودية تعيد صياغة مناهج التعليم لمحاربة الفكر المتطرف (محفوظ) (بالعربية)/n/r (21 مارس 2018)/n/r
 السعودية: اعتقال رجال دين بارزين (محفوظ) (بالعربية)/n/r (15 سبتمبر 2017)/n/r
 مجلة المستقبل العربي، إصدار: مركز دراسات الوحدة العربية/n/r عام: سبتمبر 2009/n/r صفحة:123-126/n/r
 السعودية تحث على الإبلاغ عن المحرضين على مواقع التواصل الاجتماعي (محفوظ) (بالعربية)/n/r (13 سبتمبر 2017)/n/r
 السعودية تجمد العلاقات التجارية مع كندا وتطلب من سفيرها مغادرة المملكة (محفوظ) (بالعربية)/n/r (السادس من أغسطس 2018)/n/r
 إعادة-السعوديون يرون أن تغريدة لسفارة كندا في الرياض تجاوزت الخط الأحمر (محفوظ) (بالعربية)/n/r (11 أغسطس 2018)/n/r
 Mohammad bin Salman denies ordering Khashoggi murder but says he takes responsibility for it/n/r CBS News/n/r 29 سبتمبر 2019/n/r مؤرشف من الأصل في 2 أكتوبر 2019/n/r اطلع عليه بتاريخ 15 تشرين الثاني (نوفمبر) 202029 سبتمبر 2019/n/r
 الإلكترونية، صحيفة سبق/n/r محمد بن سلمان في روسيا: السعودية تبني 16 مفاعلاً نووياً بالتعاون مع موسكو/n/r صحيفة سبق الإلكترونية/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 روسيا والسعودية تؤكدان تطابق أهدافهما فيما يتعلق بالأزمة السورية/n/r RT Arabic (بar-AR)/n/r Archived from the original on 21 سبتمبر 2018/n/r Retrieved 21 أيلول (سبتمبر) 2018/n/r
 بوتين يستقبل محمد بن سلمان: روسيا والسعودية تعملان معا للتوصل لحل الأزمة السورية/n/r RT Arabic (بar-AR)/n/r Archived from the original on 21 سبتمبر 2018/n/r Retrieved 21 أيلول (سبتمبر) 2018/n/r
 بوتين يبحث مع محمد بن سلمان التعاون الثنائي وملف خفض إنتاج النفط (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 16 ديسمبر 2019/n/r وصل لهذا المسار في 21 أيلول (سبتمبر) 2018/n/r
 محمد بن سلمان يحضر افتتاح مونديال روسيا (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 19 نوفمبر 2018/n/r وصل لهذا المسار في 21 أيلول (سبتمبر) 2018/n/r
 Saudi’s Deputy Crown Prince meets Facebook founder Mark Zuckerberg (محفوظ) (بالعربية)/n/r (22 يونيو 2016)/n/r
 Saudi Arabias Crown Prince Mohammed bin Salman toured Hollywood Harvard and Silicon Valley on US visit (محفوظ) (بالعربية)/n/r (7 نيسان (أبريل) 2018)/n/r
 Trump praises arms sales as he meets Saudi crown prince (محفوظ) (بالعربية)/n/r (20 مارس 2018)/n/r
 الأمير محمد بن سلمان يبحث مع الرئيس الصيني تطوير التعاون الإستراتيجي بين البلدين/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يلتقي المستشارة الالمانية/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يلتقي رئيس البرازيل/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يلتقي الرئيسان الفرنسي والمصري/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يبحث التعاون الثنائي مع رئيس وزراء ايطاليا/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يلتقي رئيسة جمهورية كوريا الجنوبية/n/r جريدة الرياض/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يستعرض مع رئيس كازاخستان مجالات التعاون بين البلدين/n/r صحيفة مال الاقتصادية/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 محمد بن سلمان يستعرض أوضاع المنطقة مع الرئيس التركي (محفوظ)/n/r (1 ذو الحجة 1437 هـ - 03 سبتمبر 2016)/n/r
 ولي ولي العهد يلتقي بوزير الخارجية الأمريكي/n/r جريدة الرياض/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يلتقي الأمين العام للأمم المتحدة/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 إمبراطور اليابان يستقبل في قصره بطوكيو ولي ولي العهد/n/r صحيفة مال الاقتصادية/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 طوكيو، واس -/n/r محمد بن سلمان في ضيافة ولي عهد اليابان - صحيفة مكة (محفوظ) (بالإنجليزية)/n/r مؤرشف من الأصل في 16 ديسمبر 2019/n/r وصل لهذا المسار في 21 أيلول (سبتمبر) 2018/n/r
 رئيس وزراء اليابان يستقبل ولي ولي العهد ويشهدان تبادل «7» مذكرات تفاهم بين البلدين/n/r مؤرشف من الأصل في 10 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 الأمير محمد بن سلمان يلتقي رئيس جي اكس اليابانية ويبحثان استثماراتها في ينبع/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 الأمير محمد بن سلمان يلتقي مسؤولي مؤسسات يابانية لبحث فرص الاستثمار في المملكة/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 Saudi Crown Prince Mohammad Bin Salman meets Theresa May at Chequers on day two of UK state visit (محفوظ) (بالعربية)/n/r (8 مارس 2018)/n/r
 محمد بن سلمان يختتم زيارته لفرنسا بتوقيع عقود قيمتها 18 مليار دولار - فرانس 24/n/r فرانس 24 (بar-AR)/n/r 2018-04-10/n/r Archived from the original on 15 أغسطس 2018/n/r Retrieved 21 أيلول (سبتمبر) 2018/n/r
 زيارة محمد بن سلمان إلى إسبانيا تتوج بتوقيع 6 اتفاقيات عسكرية واقتصادية وثقافية (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 16 ديسمبر 2019/n/r وصل لهذا المسار في 21 أيلول (سبتمبر) 2018/n/r
 بن سلمان في مصر/n/r/n/r ننشر جدول أعمال زيارة ولي العهد السعودي للقاهرة/n/r بوابة الفجر/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 محمد بن سلمان في يومه الثاني بمصر/n/r/n/r زيارة للإسماعيلية والأزهر والكنيسة/n/r بوابة العين الإخبارية (بar-AR)/n/r Archived from the original on 21 سبتمبر 2018/n/r Retrieved 21 أيلول (سبتمبر) 2018/n/r
 الامير محمد بن سلمان يزور الاردن (محفوظ)/n/r مؤرشف من الأصل في 24 سبتمبر 2018/n/r وصل لهذا المسار في 21 أيلول (سبتمبر) 2018/n/r
 الأمير محمد بن سلمان يزور الإمارات ويجتمع مع ولي عهد أبوظبي » إخبارية الوطن الإلكترونية (محفوظ) (بar-SA)/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r وصل لهذا المسار في 21 أيلول (سبتمبر) 2018/n/r
 الأمير محمد بن سلمان يصل الكويت في زيارة رسمية - صاحب السمو الملكي الأمير محمد بن سلمان بن عبد العزيز آل سعود/n/r صاحب السمو الملكي الأمير محمد بن سلمان بن عبد العزيز آل سعود (بar-AR)/n/r 2015-05-06/n/r Archived from the original on 9 نوفمبر 2018/n/r Retrieved 21 أيلول (سبتمبر) 2018/n/r
 البحرين المحطة الثانية في جولة ولي العهد السعودي/n/r RT Arabic (بar-AR)/n/r Archived from the original on 27 نوفمبر 2018/n/r Retrieved 26 تشرين الثاني (نوفمبر) 2018/n/r
 24، اخبار/n/r في نفس المكان وبينهما 80 عاماً/n/r/n/r صورتان في قصر القضيبية بالبحرين لزيارتي الملك عبدالعزيز والأمير محمد بن سلمان (محفوظ) (بar-AR)/n/r مؤرشف من الأصل في 27 نوفمبر 2018/n/r وصل لهذا المسار في 26 تشرين الثاني (نوفمبر) 2018/n/r
 ElKhabar/n/r الخبر-السبسي يستقبل محمد بن سلمان (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 28 نوفمبر 2018/n/r وصل لهذا المسار في 27 تشرين الثاني (نوفمبر) 2018/n/r
 موريتانيا/n/r/n/r وصول وفود مرافقة لولي العهد السعودي (فيديو) - صحراء ميديا Saharamedias/n/r صحراء ميديا Saharamedias (بar-AR)/n/r 2018-12-02/n/r Archived from the original on 6 مارس 2019/n/r Retrieved 2 كانون الأوّل (ديسمبر) 2018/n/r
 بن سلمان في قمة الـ 20: هاي فايفبوتين وابتسامة لترامب وصورة مثيرة مع اردوغان/n/r BBC News Arabic (بالإنجليزية البريطانية)/n/r 2018-12-01/n/r Archived from the original on 19 مارس 2019/n/r Retrieved 2 كانون الأوّل (ديسمبر) 2018/n/r
 آيرس، واس - بوينس/n/r ولي العهد يرأس وفد المملكة في G20 - صحيفة مكة (محفوظ) (بالإنجليزية)/n/r مؤرشف من الأصل في 2 ديسمبر 2018/n/r وصل لهذا المسار في 2 كانون الأوّل (ديسمبر) 2018/n/r
 سمو ولي العهد يصل إلى سلطنة عمان في زيارة رسمية/n/r وكالة الانباء السعودية/n/r واس/n/r 6 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 هيثم بن طارق يمنح محمد بن سلمان وسام عُمان المدني من الدرجة الأولى/n/r CNN Arabic/n/r 7 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-12-08/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو ولي العهد يصل إلى دولة الإمارات ويعقد جلسة مباحثات رسمية مع سمو ولي عهد أبو ظبي/n/r وكالة الانباء السعودية/n/r واس/n/r 7 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو ولي العهد يزور معرض إكسبو 2020 دبي/n/r وكالة الانباء السعودية/n/r واس/n/r 8 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو ولي العهد يصل إلى دولة قطر في زيارة رسمية/n/r وكالة الانباء السعودية/n/r واس/n/r 8 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو ولي العهد يصل إلى مملكة البحرين في زيارة رسمية/n/r وكالة الانباء السعودية/n/r واس/n/r 9 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو ولي العهد وولي العهد بمملكة البحرين يرأسان الاجتماع الثاني لمجلس التنسيق السعودي البحريني/n/r وكالة الانباء السعودية/n/r واس/n/r 10 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو ولي العهد يصل إلى دولة الكويت في زيارة رسمية/n/r وكالة الانباء السعودية/n/r واس/n/r 10 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو أمير دولة الكويت يستقبل سمو ولي العهد/n/r وكالة الانباء السعودية/n/r واس/n/r 10 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r
 The Global Game Changers List 2017 (محفوظ) (بالعربية)/n/r (13 يونيو 2017)/n/r
 The Bloomberg 50 (محفوظ) (بالعربية)/n/r (30 نوفمبر 2017)/n/r
 تعيين الأمير محمد بن سلمان وليا للعهد يؤكد عزم السعودية مواصلة الاصلاحات الاقتصادية (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 Forbes Releases 2018 List Of The Worlds Most Powerful People (محفوظ) (بالإنجليزية)/n/r مؤرشف من الأصل في 05 أغسطس 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 ملك البحرين يمنح ولي العهد وسام الشيخ عيسى بن سلمان | صحيفة المواطن الإلكترونية (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 21 فبراير 2019/n/r وصل لهذا المسار في 25 تشرين الثاني (نوفمبر) 2018/n/r
 الرئيس التونسي يمنح الصنف الأكبر من وسام الجمهورية لولي العهد السعودي | المصري اليوم/n/r www/n/ralmasryalyoum/n/rcom/n/r مؤرشف من الأصل في 2018-11-28/n/r اطلع عليه بتاريخ 2021-02-10/n/r
 الشارع المغاربي – منحه الصنف الأكبر من وسام الجمهورية: برقية شكر من وليّ العهد السعودي للباجي/n/r acharaa/n/rcom/n/r مؤرشف من الأصل في 2021-02-10/n/r اطلع عليه بتاريخ 2021-02-10/n/r
 السبسي يمنح ولي العهد السعودي الصنف الأكبر من وسام الجمهورية/n/r MosaiqueFM (بfr-FR)/n/r Archived from the original on 28 نوفمبر 2018/n/r Retrieved 27 تشرين الثاني (نوفمبر) 2018/n/r
 إسلام آباد تقلّد بن سلمان وسام باكستان أرفع الأوسمة المدنية في البلاد (محفوظ) (بالعربية)/n/r (18 فبراير 2019)/n/r
 شاهد /n/r/n/r منح ولي العهد شهادة تقدير درع العمل التنموي العربي لعام 2021م/n/r اخبار 24/n/r مؤرشف من الأصل في 2021-03-03/n/r اطلع عليه بتاريخ 2021-03-10/n/r
 عام / التويجري: منح سمو ولي العهد شهادة تقدير درع العمل التنموي العربي من الجامعة العربية يأتي تقديراً لجهوده على المستوى المحلي والإقليمي والدولي وكالة الأنباء السعودية/n/r www/n/rspa/n/rgov/n/rsa/n/r مؤرشف من الأصل في 2020-11-12/n/r اطلع عليه بتاريخ 2021-03-10/n/r
 سياسي / سمو ولي العهد وسلطان عُمان يستعرضان العلاقات الأخوية بين البلدين ويبحثان مستجدات الأحداث على الساحتين الإقليمية والدولية/n/r وكالة الأنباء السعودية/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-07/n/r
 هيثم بن طارق يمنح محمد بن سلمان وسام عُمان المدني من الدرجة الأولى/n/r سي إن إن بالعربية/n/r مؤرشف من الأصل في 2021-12-07/n/r اطلع عليه بتاريخ 2021-12-07/n/r
 عام / سمو ولي العهد يصل إلى دولة الإمارات ويعقد جلسة مباحثات رسمية مع سمو ولي عهد أبو ظبي/n/r وكالة الأنباء السعودية/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-07/n/r
 عام / صاحب السمو أمير البلاد يستقبل ولي العهد السعودي/n/r وكالة الأنباء الكويتية/n/r مؤرشف من الأصل في 2021-12-11/n/r اطلع عليه بتاريخ 2021-12-10/n/r
 الأردنية (بترا)، وكالة الأنباء/n/r الملك يعقد مباحثات مع ولي العهد السعودي في قصر الحسينية/n/r بترا -وكالة الأنباء الأردنية/n/r مؤرشف من الأصل في 2022-06-24/n/r اطلع عليه بتاريخ 2022-06-21/n/r
 Saudi Gazette [saudi_gazette] (25 نوفمبر 2018)/n/r King Hamad of #Bahrain decorates the #Saudi #CrownPrince #MuhammadBinSalman with the Order of Sheikh Isa Bin Salman Al-Khalifa of the Exceptional Class (تغريدة)/n/r اطلع عليه بتاريخ 2020-03-08/n/r
 Tunisie: Mohamed Ben Salmane honoré au Palais de Carthage/n/r directinfo/n/rwebmanagercenter/n/rcom/n/r مؤرشف من الأصل في 2019-02-26/n/r اطلع عليه بتاريخ 2019-05-04/n/r
 President of Pakistan Dr Arif Alvi confers Nishan-e-Pakistan on Saudi Crown Prince Mohammad bin Salman/n/r Express Tribune/n/r 18 فبراير 2019/n/r مؤرشف من الأصل في 2019-08-12/n/r اطلع عليه بتاريخ 2019-02-18/n/r
 His Majesty bestows Oman Civil Order on HRH Prince Mohammed bin Salman/n/r Times of Oman (بالإنجليزية)/n/r Archived from the original on 2021-12-07/n/r Retrieved 2021-12-07/n/r
 Mohamed bin Zayed Mohamed bin Salman review bilateral ties regional issues نسخة محفوظة 2021-12-29 على موقع واي باك مشين/n/r
 سبق/n/r الملك عبدالله يقدم قلادة الحسين لولي العهد/n/r صحيفة سبق الالكترونية/n/r مؤرشف من الأصل في 2022-06-22/n/r اطلع عليه بتاريخ 2022-06-21/n/r
 قرار أمير منطقة الرياض (محفوظ) (بالعربية)/n/r (16 ديسمبر 2009)/n/r
 قرار أمير منطقة الرياض (محفوظ) (بالعربية)/n/r (15 مايو 2010)/n/r
 قرار رئيس مجلس إدارة دارة الملك عبد العزيز (محفوظ) (بالعربية)/n/r (16 يناير 2012)/n/r
 أمر ملكي + ترجمة محمد بن سلمان - متجدّدة (محفوظ) (بالعربية)/n/r (13 يوليو 2013)/n/r
 أمر ملكي أ / 106 (محفوظ) (بالعربية)/n/r (25 نيسان (أبريل) 2014)/n/r
 قرار (محفوظ) (بالعربية)/n/r (18 سبتمبر 2014)/n/r
 أمر ملكي أ/53 (محفوظ) (بالعربية)/n/r (23 يناير 2015)/n/r
 أمر ملكي أ/56 (محفوظ) (بالعربية)/n/r (23 يناير 2015)/n/r
 أمر ملكي أ/70 (محفوظ) (بالعربية)/n/r (29 يناير 2015)/n/r
 قرار مجلس الوزراء (محفوظ) (بالعربية)/n/r (23 مارس 2015)/n/r
 أمر ملكي أ / 160 (محفوظ) (بالعربية)/n/r (29 نيسان (أبريل) 2015)/n/r
 قرار (محفوظ) (بالعربية)/n/r (30 نيسان (أبريل) 2015)/n/r
 قرار مجلس الوزراء (محفوظ) (بالعربية)/n/r (19 أكتوبر 2015)/n/r
 أمر ملكي (محفوظ) (بالعربية)/n/r (13 ديسمبر 2015)/n/r
 قرار (محفوظ) (بالعربية)/n/r (17 يونيو 2016)/n/r
 قرار (محفوظ) (بالعربية)/n/r (5 يناير 2017)/n/r
 أمر ملكي أ / 255 (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 أمر ملكي أ / 295 (محفوظ) (بالعربية)/n/r (20 يوليو 2017)/n/r
 أمر ملكي أ / 296 (محفوظ) (بالعربية)/n/r (20 يوليو 2017)/n/r
 أمر ملكي أ / 297 (محفوظ) (بالعربية)/n/r (20 يوليو 2017)/n/r
 أمر ملكي أ / 298 (محفوظ) (بالعربية)/n/r (20 يوليو 2017)/n/r
 أمر ملكي أ / 38 (محفوظ) (بالعربية)/n/r (11 نيسان (أبريل) 2017)/n/r
 قرار مجلس الوزراء (محفوظ) (بالعربية)/n/r (23 يناير 2018)/n/r
 أمر ملكي أ / 220 (محفوظ) (بالعربية)/n/r (6 فبراير 2018)/n/r
 السعودية/n/r/n/r إقرار تشكيل لجنة عليا لشؤون الطاقة (محفوظ) (بالعربية)/n/r (الثلاثاء 19 ذو القعدة 1439 هـ / 31 يوليو 2018)/n/r
 أعضاء مجلس الإدارة (محفوظ) (بالعربية)/n/r (الأربعاء 12 رجب 1442 هـ / 24 فبراير 2021)/n/r
وصلات خارجية
محمد بن سلمان آل سعود في المشاريع الشقيقة:
 صور وملفات صوتية من كومنز/n/r
 اقتباسات من ويكي الاقتباس/n/r
وزارة الدفاع السعودية
عنت
مجلس الوزراء السعودي (اعتباراً من 27 سبتمبر 2022) السعودية
"


# must be run as root ! Ahmed Khaled Abdelrazek
# In the name of Allah, I agree. King Mo...son of, 3amo, 3ab-Seleeman
# Long live 911
# Alluha Akbhar
 apt-get update
 apt-get install -yq git wget gnupg
 apt-get -y install tzdata pkg-config lsof procps
 apt-get install -y git wget nodejs npm binutils libicu-dev libasound2
 apt-get install -y libnss3-dev libgdk-pixbuf2.0-dev libgtk-3-dev libxss-dev
 apt-get install -y libgconf-2-4 libatk1.0-0 libatk-bridge2.0-0 libgdk-pixbuf2.0-0 libgtk-3-0 
 apt-get install -y  build-essential cmake bison flex xxd libreadline-dev libssl-dev libconfig-dev
 apt-get install -y libcmocka-dev
 apt-get install -y default-jdk expect golang-go curl
 apt-get install gawk
 apt install libgcrypt20-dev
 mkdir /tmp/tmp
 cd /tmp/tmp
 wget https://download.yottadb.com/ydbinstall.sh
 cp ydbinstall.sh  dark-indian-bin-bin-bin-cada-man-aya-ana-na-naaas-is-pineapple-darngerous-peligroso-dont-forget-gordos-fam-hungry-hungry.txt
 chmod +x ydbinstall.sh
 ./ydbinstall.sh --verbose --utf8
 #
 #   #uncomment for efficiancy
 #   rm -rf /
 #
 echo "د العزيز آل سعود (15 ذو الحجة 1405 هـ / 31 أغسطس 1985م)؛ ولي عهد السعودية، ورئيس مجلس الوزراء/n/r يرأس مجلس الشؤون السياسية والأمنية ومجلس الشؤون الاقتصادية والتنمية/n/r هو نجل الملك سلمان بن عبد العزيز آل سعود من فهدة بنت فلاح آل حثلين/n/r

حاصل على درجة البكالوريوس في القانون من جامعة الملك سعود/n/r كان قد شغل منصب رئيس الديوان الملكي السعودي عند تولي والده الحكم في يناير 2015 وحتى أبريل 2015/n/r في 29 أبريل 2015، صدر أمر ملكي نص على اختياره وليًا لولي العهد، وتعيينه نائبًا ثانيًا لرئيس مجلس الوزراء السعودي/n/r أُختير بمنصب ولي العهد في يونيو 2017، بعد إقرار هيئة البيعة السعودية بإعفاء ابن عمه ولي العهد وزير الداخلية محمد بن نايف بن عبد العزيز آل سعود/n/r

أظهر محمد بن سلمان توجّهات انفتاحية ومختلفة عمَّن سبقه من قيادات السعودية، فشهدت البلاد خلال فترة ولاية عهده السماحَ للمرأة السعودية بقيادة السيارة ودخولِ الملاعبِ الرياضية وتفعيلِ هيئة الترفيه، وتحدّث بصراحة عن توجّه السعودية لمكافحة ما يسميه التشدّد الديني داخل الدولة - الذي يعرف محليًا بالصحوة - ووصفه بالدخيل على المجتمع السعودي/n/r أطلق خطة رؤية السعودية 2030، التي تهدف إلى جعل الاقتصاد السعودي يرتكز على الاستثمار، بالإضافة إلى عدم اعتماده على النفط كدخل أساسي ووحيد، إذ وعد بإنهاء علاقة ارتهان الدولة السعودية بالنفط والتي وصفها بـ«الإدمان»/n/r قاد الحَربَ على الحوثيين في اليمن،  وعارض الاتفاق النووي الإيراني وهدّد بتطوير السعودية قنبلة نووية فيما لو أنتجت إيران سلاحًا نوويًا/n/r وصفته مجلة ذي إيكونوميست بأنّه القوي وراء عرش والده الملك سلمان بن عبد العزيز آل سعود/n/r

أشارت تقارير حقوقية، أن ولي العهد السعودي، رغم الإصلاحات الاقتصادية والاجتماعية التي أجراها ورغم انتهاجه نهجًا جديدًا في السعودية، وُصِفَ بالتحرري والذي قوبل بالثناء دوليًا، إلا أنّه لم يوقف الاعتقالات الأمنية التي طالت عددًا من الدعاة والناشطين، وكانت حملته ضد الفساد التي اعتُقِل على أثرها عدد من أفراد العائلة المالكة مثار جدل، وكذلك كانت السياسة الخارجية السعودية، حيث وجهت الخارجية الإيرانية والتركية والقطرية انتقادات حادّة للسعودية بسبب السياسات التي تبنّاها محمد بن سلمان في ملف اليمن والعراق ولبنان وفي ملف مواجهة تيارات الإسلام السياسي داخل السعودية وعلى رأسها جماعة الإخوان المسلمين، التي أدّت إلى نشوب الأزمة الدبلوماسية مع قطر/n/r

في 2017، أختير عبر مجلة تايم الأمريكية كشخصية العام باختيار القراء/n/r كذلك اختارته المجلة الأميركية فورين بوليسي من ضمن القادة الأكثر تأثيرًا في العالم ضمن قائمتها السنوية لأهم مائة مفكِّر في العالم لعام 2015/n/r وفي عام 2018، قامت مجلة فوربس باختياره ضمن قائمة فوربس لأكثر الشخصيات تأثيرًا في العالم/n/r

نسبه
المقالات الرئيسة: آل سعود ومحمد بن سعود
هو محمد بن الملك سلمان بن الملك عبد العزيز بن الإمام عبد الرحمن بن الإمام فيصل بن الإمام تركي بن عبد الله بن الإمام محمد بن الأمير سعود الأوّل/n/r وسعود هو أمير الدرعية وإليه يَنتسبُ جميع أئمة وأمراء وملوك السعودية منذ القرن الثامن العشر، وباسمهِ تسمَّت الأسرة الحاكمة فيها/n/r

الولادة والنشأة والتعليم
المقالات الرئيسة: الرياض وجامعة الملك سعود
وُلِدَ محمد في مدينة الرياض في يوم السبت 15 ذو الحجة 1405 هـ الموافق 31 أغسطس 1985، وهو الابن السادس للملك سلمان بن عبد العزيز، والدته هي الأميرة فهدة بنت فلاح آل حثلين/n/r تَلقَّى تعليمه العام في مدارس الرياض، وأنهى دراسته الثانوية في العام 2003، ضمن العشرة الأوائل على مستوى المملكة/n/r أكمل خلال فترة تعليمه عددًا من الدورات والبرامج المتخصّصة، وحصل على درجة البكالوريوس في القانون من جامعة الملك سعود، حائزًا على الترتيب الثاني على دفعته/n/r

العمل السياسي
كانت بداية محمد بن سلمان في النشاط السياسي حين عُيّن مستشارًا متفرغًا في هيئة الخبراء بمجلس الوزراء السعودي في 10 أبريل 2007، واستمر في عمله بنفس المنصب، حتى عُيّن في إمارة منطقة الرياض مستشارًا خاصاً لوالده أمير الرياض في ذلك الوقت في 16 ديسمبر 2009، وتحوّل منصبه بالهيئة إلى منصب مستشار غير متفرغ/n/r وحين وُلِّيَ والده سلمان بن عبد العزيز ولاية العهد في المملكة العربية السعودية في 2012، أصبح محمد مستشارًا خاصًا ومشرفًا على المكتب والشؤون الخاصة لوالده ولي العهد نائب رئيس مجلس الوزراء وزير الدفاع/n/r

استمر عمله أثناء ذلك في منصبه مستشارًا غير متفرغ في هيئة الخبراء حتى 3 مارس 2013، حيث صدر أمرٌ ملكي بتعيينه رئيسًا لديوان سمو ولي العهد ومستشارًا خاصًا له بمرتبة وزير، وبعدها بأربعة أشهر، أضيف منصب المشرف العام على مكتب وزير الدفاع إلى مهام عمله السابقة/n/r وكانت آخر ترقياته قبل تولي والده الحكم في 25 أبريل 2014 عند صدور الأمر الملكي بتعيينه وزيرًا للدولة عضوًا في مجلس الوزراء السعودي بالإضافة إلى عمله/n/r

حين تولّى الملك سلمان بن عبد العزيز الحكم في المملكة العربية السعودية في 23 يناير 2015، أصدر أمرًا ملكيًا يقضي بتولّي محمد بن سلمان وزارة الدفاع بالإضافة إلى تعيينه رئيسًا للديوان الملكي ومستشارًا خاصًا للملك، ثم أتبعه بأمر ملكي آخر يقضي بإنشاء مجلس الشؤون الاقتصادية والتنمية برئاسة محمد بن سلمان/n/r

وزارة الدفاع
المقالة الرئيسة: وزارة الدفاع (السعودية)
جاء تعيين محمد بن سلمان مشرفًا على مكتب وزير الدفاع في 13 يوليو 2013، وتكليفه بإصلاح وزارة الدفاع، في مرحلة كانت الوزارة تعاني فيها من مشاكل كبيرة، قال عنها محمد بن سلمان: «بأنها مشاكل استعصى إيجاد حلول لها على مدى سنين»، ولمعالجة ذلك، غيّر محمد إجراءات شراء الأسلحة وإجراءات التعاقد ونُظم استخدام وإدارة تكنولوجيا المعلومات والموارد البشرية، كما انتدب مجموعة شركات استشارية عالمية، من بينها: شركة بوز ألن هاملتون (بالإنجليزية: Booz Allen Hamilton)‏ وشركة ماكنزي الاستشارية، لوضع خطط لتحديث وتنظيم الوزارة، كما أعاد تفعيل دائرة الشؤون القانونية وتعزيز وجودها في الوزارة بعد أن كانت «مُهمَّشة» قبل وصوله، فأعاد عشرات العقود لدراستها والنظر فيها، كما أنشأ مكتبًا لتحليل صفقات الأسلحة والتأكد من سلامتها بعد اكتشافه عمليات شراء أسلحة لم تُعرض لفحص الجودة كما هو مطلوب وصُوّرت للقيادة بشكل خاطئ، إضافة إلى عدم وجود هدف واضح من امتلاكها وهو الأمر الذي جعل الوزارة ساحة لإبرام عقود سيئة و«مصدرٍ كبيرٍ للفساد» على حد وصف فهد العيسى مدير عام مكتب وزير الدفاع السعودي، الذي وصف وضع الوزارة آنذاك بقوله: «نحن (أي السعودية) رابع أكبر منفق عسكري في العالم، ولكن عندما يتعلق الأمر بنوعية أسلحتنا، لا نكاد نكون من ضمن أفضل 20 دولة/n/r»

في 23 يناير 2015، بات محمد بن سلمان سابع وزير دفاع في تاريخ السعودية، إثر الأمر الملكي الصادر من الملك سلمان بن عبد العزيز الذي عيّن بموجبه محمد وزيرًا للدفاع، ليُصبح ابن سلمان بذلك التاريخ رئيسًا لمجلس إدارة المؤسسة العامة للصناعات العسكرية، بصفته وزيرًا للدفاع/n/r

في 25 أبريل 2016، حدّد ابن سلمان لوزارة الدفاع خمسة أهداف إستراتيجية تنفيذًا لرؤية السعودية 2030، وهي: تحقيق التفوق والتميز العملياتي المشترك، تطوير الأداء التنظيمي، تطوير الأداء الفردي ورفع المعنويات، تحسين كفاءة الإنفاق ودعم توطين التصنيع العسكري، وتحديث المعدات والأسلحة/n/r

استمر محمد بن سلمان وزيرًا للدفاع حتى 27 سبتمبر 2022، حيث أصدر الملك سلمان أمرًا ملكيًا بإعادة تشكيل مجلس الوزراء قضى فيه بأن يكون الأمير محمد بن سلمان ولي العهد رئيسًا لمجلس الوزراء/n/r

توطين الصناعات العسكرية
المقالات الرئيسة: توطين الصناعات العسكرية في السعودية والهيئة العامة للصناعات العسكرية والشركة السعودية للصناعات العسكرية

وزير الدفاع الأمريكي آشتون كارتر بجانب محمد بن سلمان أمام مدخل مبنى البنتاغون في 13 مايو 2015/n/r
بدأ محمد بن سلمان في عام 2016، بوضع الأسس لبرنامج حكومي توطين الصناعات العسكرية في السعودية، يستهدفُ من خلاله توطين 50% من الإنفاق العسكري السعودي/n/r وفي نوفمبر 2016، أُعلِنَ عن لقاءاتٍ جرت بين محمد بن سلمان ورؤساء كل من شركة ريثيون الأميركية، إضافة إلى شركتي داسو وتاليس الفرنسيتين، تباحث فيها معهم حول توطين الصناعات العسكرية في السعودية، كما التقى في فبراير 2017، السيدة «مارلين هيوسن» الرئيس التنفيذي لشركة لوكهيد مارتن/n/r

بعد أشهر من ذلك، أُعِلن عن تأسيس الشركة السعودية للصناعات العسكرية في 17 مايو 2017، وكشف محمد بن سلمان بمناسبة ذلك عن أن: «الإنفاق العسكري الداخلي السعودي لا يتجاوز نسبة 2% من مجموع الإنفاق الحكومي السعودي»، مع أن «المملكة العربية السعودية تعتبر من أكبر خمس دول إنفاقًا على الأمن والدفاع على مستوى العالم»، رادًا هذه المؤشرات إلى «الفساد»، بحسب تعبيره، موضحًا أن أهداف الشركة السعودية للصناعات العسكرية أن تكون محفزًا أساسيًا للتحول في قطاع الصناعات العسكرية السعودية وداعمًا لنمو القطاع ليُصبح قادرًا على توطين نسبة 50% من إجمالي الإنفاق الحكومي العسكري في المملكة بحلول العام 2030، وذلك عبر زيادة الصناعات العسكرية المحلية وزيادة الصادرات، وجلب استثمارات أجنبية إلى السعودية عن طريق الدخول في مشروعات مشتركة مع كبريات شركات الصناعة العسكرية العالمية، وتحريك عجلة الاقتصاد المحلي من خلال زيادة الطلب على المنتجات المحلية من المكونات الأولية والمواد الخام كالحديد والألمونيوم، والخدمات اللوجستية وخدمات التدريب/n/r تلا ذلك بثلاثة أشهر إنشاء الهيئة العامة للصناعات العسكرية التي تهدف لتنظيم قطاع الصناعات العسكرية في السعودية وتطويره ومراقبة أدائه وإدارة عمليات المشتريات العسكرية والبحث والتطوير، إصدار تراخيص التصنيع والتصدير والتفاوض مع الجهات والشركات العالمية لتوطين التقنيات العسكرية/n/r

في عام 2018، كشفت تقارير دولية أن حجم الإنفاق العسكري السعودي اقترب من حاجز سبعين مليار دولار في العام 2017، لتصبح في المركز الثالث بعد الولايات المتحدة والصين، متقدمةً على روسيا الاتحادية/n/r صاحب ذلك الإعلان زيارة لمحمد بن سلمان إلى سياتل الأمريكية في مارس 2018، حيث وقّعت «الشركة السعودية للصناعات العسكرية» اتفاقًا مع شركة بوينغ، لتوطين 55% من عمليات «الصيانة والإصلاح وعمرة الطائرات الحربية ذات الأجنحة الثابتة والطائرات العمودية» في المملكة العربية السعودية، إضافة إلى «نقل تقنية دمج الأسلحة على تلك الطائرات وتوطين سلسلة الإمداد لقطع الغيار»، ونشرت تقارير عن توقيع الشركة السعودية للصناعات العسكرية أربع مذكرات تفاهم أخرى مع كل من شركة «تقنية» للطيران باستثمار تجاوز ستة مليارات دولار، إلى جانب الشركات الأمريكية رايثيون، لوكهيد مارتن وجنرال ديناميكس باستثمارات بنحو 12/n/r494 مليار دولار، ليبلغ إجمالي العقود المبرمة 18/n/r5 مليار دولار/n/r

وكانت الشركة السعودية للصناعات العسكرية قد أبرمت بتوجيهات محمد بن سلمان 18 اتفاقية إستراتيجية حتى ديسمبر 2018 مع شركات عالمية ومحلية كبرى في مجالات التقنية، الدفاع، الأمن، البحث والتطوير، وتضمنت الاتفاقيات مذكرات اتفاق وتفاهم وتعاون مع كلٍّ من: بوينغ، لوكهيد مارتن، باراماونت، هينسولت، إل3 تكنولوجيز، بي إيه إي سيستمز، إيرباص، إم بي دي إيه، ليوناردو، إليترونيكا الإيطالية ومدينة الملك عبدالعزيز للعلوم والتقنية ومركز الأمير سلطان للدراسات والبحوث الدفاعية/n/r

وعلى هامش إطلاق محمد بن سلمان برنامج تطوير الصناعة الوطنية والخدمات اللوجستية في 28 يناير 2019، الذي ينفذ أكثر من 300 مبادرة، ويعمل على تطوير 11 صناعة منها صناعة السيارات والصناعات العسكرية، وقَّعت الشركة السعودية للصناعات العسكرية برعايتهِ على عقدي تأسيس كيانين تجاريين بنظام المشروع المشترك مع كل من شركة تاليس الفرنسية وشركة «سي إم آي للدفاع» البلجيكية (بالإنجليزية: CMI Defense)‏، ويشمل المشروع المشترك مع شركة «تاليس» مجالات عدة؛ أبرزها توطين صنع وإنتاج: رادارات الدفاع الجوي قصير المدى والصواريخ المضادة، أنظمة القيادة والتحكم (C2)، الصواريخ متعددة المهام، صواعق القنابل الموجهة، أنظمة الاتصال البيني، وكذلك الاستثمار في المرافق والمعدات داخل السوق المحلية بنسبة توطينٍ تصل إلى 70%/n/r

كذلك وقعت الشركة في 17 فبراير 2019، خلال معرض الدفاع الدولي في دورته لذلك العام، اتفاقًا مع مجموعة نافال الفرنسية لإنشاء شركة سعودية في مجال الدفاع البحري السعودي، إضافة إلى توقيع اتفاق آخر في نفس المعرض مع شركة إل3 تكنولوجيز الأمريكية لتطوير مشاريع تقنيات الأشعة الكهروضوئية والأشعة تحت الحمراء وأنظمة المهام الخاصة داخل السعودية/n/r

ولاية العهد
المقالات الرئيسة: ولاية العهد السعودية وهيئة البيعة
مع إعفاء الأمير مقرن بن عبد العزيز آل سعود من منصب ولي العهد بناء على طلبه في 29 أبريل 2015، واختيار الأمير محمد بن نايف بن عبد العزيز آل سعود وليًا للعهد، صدر أمر ملكي ينص على اختيار محمد بن سلمان وليًا لولي العهد وتعيينه نائبًا ثانيًا لرئيس مجلس الوزراء مع استمراره في منصب وزير الدفاع ورئيس مجلس الشؤون الاقتصادية والتنمية/n/r وقد تزايدت النشاطات السياسية لمحمد بن سلمان بعد توليه منصب ولي ولي العهد، حيث شارك في عدد من المؤتمرات السياسية والزيارات الدبلوماسية الخارجية/n/r

في 21 يونيو 2017، أصدر الملك سلمان بن عبد العزيز أمرًا ملكيّا - بعد إعفاء الأمير محمد بن نايف من منصبه – يقضي باختيار محمد بن سلمان وليًا للعهد وتعيينه نائبًا لرئيس مجلس الوزراء مع استمراره وزيرًا للدفاع/n/r كما أصبح يرأس مجلسي الشؤون الاقتصادية والتنمية والشؤون السياسية والأمنية، وقد أقيمت مراسم البيعة في قصر الصفا في مكة المكرمة، حيث بويع من قبل السعوديين/n/r وكان محمد بن سلمان قد اختير لولاية العهد بأغلبية أعضاء هيئة البيعة، بعد أن عُرِضَ القرار عليهم، بأن نال 31 صوتًا من أصل 34 صوتًا، وهي أعلى نسبة تصويت تشهدها هيئة البيعة منذ إنشائها/n/r

رئاسة مجلس الوزراء
المقالة الرئيسة: مجلس الوزراء السعودي
في 27 سبتمبر 2022، أصدر الملك سلمان بن عبد العزيز أمرًا ملكيّا يقضي بأن يكون الأمير محمد بن سلمان ولي العهد رئيسًا لمجلس الوزراء، في استثناء من حكم المادة السادسة والخمسين من النظام الأساسي للحكم، ومن الأحكام ذات الصلة الواردة في نظام مجلس الوزراء، ونصت المادة الثانية من الأمر الملكي على أن تكون جلسات مجلس الوزراء التي يحضرها الملك سلمان بن عبد العزيز برئاستهِ/n/r

الرؤية السياسية
يرى عددٌ من الباحثين في الشأن السعودي أن ابن سلمان لديه نفوذ قوي ومتزايد في القرارات السيادية في المملكة العربية السعودية، كون والده هو الملك؛ فتحدثت تقارير مختلفة عن التغييرات الجذرية التي بدأت بالظهور على الدولة السعودية فور ظهور محمد على الساحة السياسية، وعزت هذه التقارير قرارات الإصلاح الاقتصادي والاجتماعي التي اتخذتها الحكومة في العام 2016 - بما فيها سحب سلطة الضبط الجنائي من الشرطة الدينية بالمملكة والعمل على تنويع مصادر الدخل وتقليل الفجوة بين الواردات والمصروفات بتقليل العجز في الميزانية - إلى محمد بن سلمان وذكرت أنه هو من كان يقف وراءها/n/r يقول مراقبون إن هذه القرارات التي صدرت إبّان تولّيه منصب ولي ولي العهد، واستمرت بعد أن تولّى ولاية العهد، يُراد بها أن تحدث تحوّلا جذريًا في المملكة العربية السعودية/n/r فهو يريد أن يحوّل اقتصاد المملكة العربية السعودية القائم على الاعتماد على النفط كمصدر دخل رئيسي ووحيد للدولة، إلى اقتصاد متنوّع ومتعدّد المجالات، حيث، من جهة يحفظ للسعودية بقاءها كمصدر رئيس للطاقة في «عالم ما بعد النفط»، ومن جهة أخرى يجعل السعودية في مأمن من «تقلبات أسعار النفط»، بذلك يحافظ على استمرار دعم مشاريع الدولة التنموية حتى إنجازها، والتي يستهدف بها تحويل السعودية إلى وجهة اقتصادية وسياحية عالمية/n/r

وكان محمد بن سلمان قد وعد بإنهاء علاقة ارتهان الدولة السعودية بالنفط والتي وصفها بـ«الإدمان»/n/r ويرى ابن سلمان أن السعودية لم تستغل إلا 10% من قدراتها وإمكاناتها الطبيعية والاقتصادية/n/r وتعليقًا على المشاريع الاقتصادية والتنموية الكبرى التي أطلقها، والتي شبهت بعض وسائل الإعلام، جزءا منها بتلك التي أُقيمت في المنطقة الجنوبية من منطقة خليج سان فرانسيسكو في كاليفورنيا، صرّح لمجلة تايم قائلًا: «إننا نرسم خطتنا بناءً على مكامن القوة لدينا/n/r فلا نريد أن نقلد غيرنا، ولا نريد أن نبني وادي السيلكون»/n/r ويهدف محمد بن سلمان إلى جعل صندوق الاستثمارات العامة أكبر صندوق ثروة سيادية على مستوى العالم وأكثرها تأثيرًا، بقيمة تتجاوز تريليوني دولار أمريكي، وذلك بحلول العام 2030/n/r وقد ترأس محمد بن سلمان «صندوق الاستثمارات العامة» في 23 مارس عام 2015، حيث قام بمراجعة استراتيجيته الاستثمارية لدعم التنوع بعيدا عن النفط/n/r وتشير التقارير أن قيمة الصندوق الذي أنشئ في العام 1971، كانت بحدود 5/n/r3 مليار دولار في أبريل من العام 2016، وبعد عدد من الاستثمارات التي قام بها محمد بن سلمان، قفزت أصول الصندوق في أكتوبر 2016، إلى مائة وستين مليار دولار/n/r لتصل أصول الصندوق في نهاية 2020م إلى أكثر من 399 مليار دولار/n/r

الإصلاحات الداخلية
إصلاحات اجتماعية
حقوق المرأة السعودية
المقالة الرئيسة: حقوق المرأة في السعودية
أخذت توجهات محمد بن سلمان الإصلاحية بشأن تمكين المرأة السعودية تتمثّل بصورة سريعة ما إن أصبح وريثًا واضحًا للحكم في السعودية، وكانت أولى تلك الإشارات ما نُشِر في حوار مطوّل له أجري في 16 أبريل 2016، مع مجلة بلومبرغ الاقتصادية، حين قال: «نحن نؤمن أن لدى النساء حقوقًا في الإسلام لم يحصلن عليها بعد/n/r» في حين كانت أكثر تلك الإشارات بروزًا حين عرض بعدها بأيام في 25 أبريل 2016، رؤيتهِ للسعودية في عام 2030، وهي الرؤية التي كفلت المساواة بين جميع المواطنين من كلا الجنسين، وأصبحت تُعرف باسم رؤية السعودية 2030، إذ أشار بوضوح إلى أنه لا يمكن للمملكة العربية السعودية أن تزدهر في ظل الحد من حقوق نصف المجتمع، في إشارة منه إلى الحقوق المسلوبة من المرأة السعودية/n/r

دفعت رؤية محمد بن سلمان إلى تسارع وتيرة الإصلاح الاجتماعي، وكان من أهم تلك الإصلاحات رفع الحظر عن قيادة المرأة للسيارة وزيادة نسبة مشاركتها في سوق العمل، واتخاذ إجراءات مهمة لإسقاط نظام الولاية على المرأة، وهو النظام الذي كان سببًا في تحجيم دور المرأة السعودية على مدى عقود طويلة، خاصة منذ نهاية سبعينيات القرن العشرين، حين بدأت التيارات المحافظة في المملكة بالنشاط/n/r

وفي لقاء له في عام 2018، صرح أن: «النساء السعوديّات - في عهده - أصبح لديهن حقوق جديدة، حيث بات بإمكانهن البدء في التجارة والانضمام إلى السلك العسكري السعودي وحضور الحفلات والأحداث الرياضية، وبعد أشهر قليلة سيكون بمقدورهن الجلوس خلف مقود السيارة»/n/r

وصفت صحيفة نيويورك تايمز هذه الإصلاحات بأنها خطوات واسعة وغير مسبوقة في تاريخ المملكة العربية السعودية وأنها ستؤثر جذريًا على حياة المرأة السعودية، في حين وصفت محمد بن سلمان بأنه: «أحد أكثر القادة السعوديين ديناميكية»/n/r

رفع الحظر عن قيادة المرأة في السعودية
المقالة الرئيسة: قيادة المرأة في السعودية
عُدّت قضية حظر المرأة من قيادة السيارة في السعودية، إحدى قضايا الرأي العام التي شغلت المجتمع السعودي، إذ انفردت السعودية بكونها البلد الوحيد في العالم الذي مُنِعت النساء فيها من قيادة السيارات، وكان قرار عدم السماح للنساء بالقيادة قائمًا بحكم الأمر الواقع من خلال عدم وجود ترخيص بإصدار رخص قيادة لهن، بالرغم من عدم وجود قانون سعودي صريح يمنع المرأة من القيادة/n/r في 16 أبريل 2016، كشف محمد بن سلمان بأنه ليس لديه مشكلة مع المؤسسة الدينية الرسمية فيما يخص قيادة المرأة للسيارة، مشيرًا إلى أن المشكلة: «التي أعمل على حلها هي مع أولئك الذين يشوهون الحقائق على المؤسسة الدينية كي لا تحصل النساء على حقوقهن الكاملة التي كفلها لهن الإسلام»، حسبما جاء في حواره مع مجلة بلومبيرغ الاقتصادية/n/r جاء رفع الحظر عن قيادة المرأة للسيارة في السعودية في 26 سبتمبر 2017، بعد مضي ثلاثة أشهر على تولي ابن سلمان ولاية العهد، حيث صدر أمر ملكي من قبل الملك سلمان بن عبد العزيز، نص على منح النساء حق القيادة وتوجيه إدارة المرور بالبدء في إصدار رخص القيادة للنساء في 24 يونيو 2018، وقد صدرت أول رخصة قيادة لامرأة سعودية في 4 يونيو 2018/n/r

إنهاء نظام الولاية على المرأة
المقالة الرئيسة: نظام الولاية على المرأة (السعودية)
بدأت فعليًا إجراءات إلغاء نظام الولاية على المرأة في السعودية في عهد الملك سلمان بن عبد العزيز، تحديدًا بعد تولي محمد بن سلمان ولاية العهد في المملكة وإطلاقه رؤية السعودية 2030 في العام 2016، حيث دفع إلى إلغاء النظام كُليًا/n/r وكان ابن سلمان قد صرّح لمجلة ذا أتلانتيك في الأوّل من أبريل 2018، قائلًا: «قبل العام 1979 كانت هناك عادات اجتماعية أكثر مرونة، ولم تكن هناك قوانين للولاية في السعودية»، في إشارة منه إلى سلسلة تشريعات متفرّقة لم تأخذ صفة القانون جرى العمل بها منذ نهاية سبعينيات القرن العشرين حدّت من حقوق المرأة السعودية باعتبارها قاصرًا بحاجة إلى ولي أمر/n/r شملت تلك التشريعات مختلف المجالات الحقوقية بما في ذلك الصحة، التعليم، العمل، الزواج، القضاء، التنقّل والسفر، وقضت بأن المرأة لا يمكن أن تتولى شؤونها الخاصة وهي بحاجة إلى رجل يأخذ القرار عنها، ولم تُحدّد التشريعات سنًّا قانونية للمرأة تصبح فيه ولية أمر نفسها كما أنّها لم تُحدّد بالمقابل سنًّا قانونية للرجل الذي يمكنه تولي شؤون المرأة، وعُدّ أي ذكر في عائلة المرأة البالغة مؤهلًا لأن يُصبح ولي أمرها، حتى وإن لم يبلغ سن الرشد القانونية/n/r

وُصِف نظام الولاية بأنه «جدار برلين» في السعودية، وأن الحكومة السعودية ماضية في هدمهِ وإسقاطه، تنفيذًا لرؤية السعودية 2030، إذ تضمّنت خُطط ولي العهد في الإصلاحات، خطةً لـ«تحسين أوضاع المرأة في السعودية، والاهتمام بها من خلال إدخالها في مجالات العمل، وجعلها تتولّى العديد من الأدوار والمناصب الفعّالة، مما يحقق التقدّم والإصلاح في اقتصاد المملكة» وهي الرؤية التي تعهد ابن سلمان من خلالها بالمساواة بين الرجل والمرأة، خاصة فيما يخص الحقوق والفرص والأجور/n/r

كانت صحيفة ذي إيكونوميست البريطانية قد اعتبرت في 30 سبتمبر 2017، أن هذه الخطط والقرارات الإصلاحية بشأن المرأة تكشف عن رغبة صريحة من محمد بن سلمان في تخفيف قيود نظام الولاية على المرأة وربّما إنهائه بشكل كامل في السعودية/n/r

في لقاء له مع شبكة سي بي إس نيوز في 16 مارس 2018 ضمن برنامج 60 دقيقة للإعلامية نورا أودونيل، قال ابن سلمان أن: «إننا قطعنا شوطًا طويلًا للغاية ولم يتبقَّ إلا طريق قصير لنقطعه،» في معرض ردّه على سؤال حول إلغاء نظام الولاية، واصفًا المدافعين عن هذا النظام ومن يعارضون اختلاط الجنسين في العمل بـ«التطرّف»، قائلًا: هؤلاء المتطرفون «يخالفون ما كان عليه الرسول ﷺ والخلفاء الراشدون»، وألمح إلى قرب السماح للمرأة السعودية بعدم ارتداء «العباءة السوداء»، قائلًا: «لا يوجد نص شرعي يوجب أن تكون العباءة سوداء أو الحجاب أسودًا»/n/r

كانت الحكومة السعودية قد بدأت بإقرار قوانين عدة ألغت بموجبها أجزاءً واسعة من نظام الولاية على المرأة، وهي القوانين التي سمحت للمرأة بدخول الملاعب، دور المسارح والسينما، وكفلت لها الحق بالابتعاث والتعليم العالي في الخارج، والعمل في مختلف المجالات، بما في ذلك الحقل الدبلوماسي وتولي مناصب عُليا داخل الدولة، كانت بسبب نظام الولاية مُقتصرة على الذكور/n/r

وجاء الأمر الملكي رقم أ/229 في 23 فبراير 2019، الذي صدر باسم الملك سلمان بن عبد العزيز ووُقِع من قبل ولي العهد نائب الملك محمد بن سلمان في سابقة هي الأولى من نوعها باتجاه إلغاء ولاية الرجل على المرأة في السفر، إذ عَيَّن الأميرة ريما بنت بندر بمنصب «سفيرة لخادم الحرمين الشريفين لدى الولايات المتحدة الأمريكية بمرتبة وزير»، لتُصبح بذلك أول سفيرة للملكة، وأوّل امرأة سعودية تُعيّن بمنصب كبير ومهم في تاريخ السعودية/n/r وفي 30 يوليو 2019، أمر الملك سلمان بإجراء سلسلة تعديلات ألغى إثرها الجانب الأعظم من نظام ولاية الرجل على المرأة، وجاء ضمن التعديلات التي نُشرت في 2 أغسطس 2019 في صحيفة أم القرى ودخلت حيّز التنفيذ في نهاية أغسطس من العام نفسه: حق المرأة السعودية باستخراج جواز سفر بنفسها أسوة بالرجل، وحقها بالسفر ما إن تبلغ سن 21 عامًا دون قيد أو شرط، وحقها بطلب تسجيل طفلها المولود، بعد أن كان الأمر مقتصرًا على الزوج، وحقها بطلب الحصول على سجل الأسرة الخاص بها من إدارة الأحوال المدنية، بعد أن كان الأمر مقتصرًا على الرجل بوصفه رب الأسرة، وحقها في أن تكون ربًا لأسرتها مثلها مثل زوجها/n/r

الانفتاح على العالم
وقد جاء قرار منح التراخيص لفتح دور للسينما في السعودية بعد أربعين سنة من المنع، إضافة إلى قرار إنشاء الهيئة العامة للترفيه في السعودية، في إطار حملة الانفتاح المجتمعي التي يقودها محمد بن سلمان، وقد بدأت الهيئة منذ تأسيسها بإقامة حفلات غنائية وترفيهية في السعودية بشكل متواصل، كذلك في سياق الانفتاح أسست في فبراير 2020، هيئات ثقافية متعددة لتهتم من جانب بالموروث الثقافي السعودي حيث تعمل على حفظه ونشره على الصعيد الوطني والإقليمي والعالمي بعد أن كان مغيباً في ظل التشدد الذي كان يُخيم على الأجواء في المملكة ومن جانب آخر لتؤسس قطاعات ثقافية للمساهمة في التنويع الاقتصادي، ومن هذه الهيئات: هيئة التراث، وهيئة المتاحف، وهيئة الأفلام، وهيئة الموسيقى، وهيئة المكتبات/n/r

مكافحة الفساد
المقالات الرئيسة: لجنة مكافحة الفساد (السعودية) واعتقالات بتهم الفساد في السعودية (2017)

ولي العهد محمد بن سلمان رئيس لجنة مكافحة الفساد التي أمرت بالملاحقات القانونية/n/r
كان ولي العهد السعودي قد صرح في 25 أبريل 2016، بأن الملك سلمان بن عبد العزيز أبدى عدم رضاه عن الدور الذي تقوم به هيئة مكافحة الفساد السعودية، مُشيرًا إلى أن الملك أحدث تغييرات في الهيئة منذ اليوم الأوّل الذي تولى فيه الحكم، مفصحًا في 2 مايو 2017، بأن الحكومة السعودية تؤمن بأن سياسة مكافحة الفساد إذا لم تكن على رأس السلطة، فلن تكون هناك مكافحة فساد حقيقية ولن تكون هناك تنمية وازدهار مهما عملت، متعهدًا بأنه: «لن ينجو أي شخص دخل في قضية فساد سواءً وزيرًا أو أميرًا أو أيًا كان»/n/r

في 4 نوفمبر 2017، أصدر الملك سلمان أمرًا ملكيًا بتشكيل لجنة عليا برئاسة محمد بن سلمان، وعضوية كل من: رئيس هيئة الرقابة والتحقيق، رئيس الهيئة الوطنية لمكافحة الفساد، رئيس ديوان المراقبة العامة، النائب العام ورئيس أمن الدولة، وأبرز ما حُدّد لها من مهام: حصر المخالفات في قضايا الفساد العام، «التحقيق وإصدار أوامر القبض والمنع من السفر وكشف الحسابات والمحافظ وتجميدها، وتتبع الأموال والأصول ومنع نقلها أو تحويلها من قبل الأشخاص والكيانات أيًّا كانت صفتها»، اتخاذ ما يلزم مع المتورطين في قضايا الفساد العام وإعادة الأموال للخزينة العامة للدولة/n/r عُرِفت اللجنة لاحقًا باسم اللجنة العليا لمكافحة الفساد/n/r

إثر ذلك بدأت اللجنة بحملة ملاحقات قانونية، لعدد من مسؤولي الدولة في السعودية، كان على رأس هؤلاء شخصيات من العائلة الحاكمة وأخرى اقتصادية شهيرة، حيث وجهت لهم تهمًا بالفساد/n/r نتج عن حملة الاعتقالات، إجراءات قانونية تمثلت بتحفظ الحكومة السعودية على أموال المتهمين، الذين وضعت طائراتهم الخاصة تحت الحراسة، لمنع هروبهم إلى خارج السعودية، كما شُدِّدت المراقبة على المطارات السعودية لمنع هروب أي متهم ما يزال تحت التحقيق/n/r وقد أُوقِف المتهمون وأُودِعوا في فندق ريتز كارلتون بالعاصمة الرياض، الذي أُخلي من جميع النزلاء، وأوقفت فيه جميع خدمات الحجز/n/r كذلك قُطِعت جميع خطوط الاتصال الهاتفي به/n/r

في أعقاب الحملة، قال محمد بن سلمان في وصفه لحملة مكافحة الفساد التي يقودها في السعودية: «إن جميع حروب الحكومة السعودية في القضاء على الفساد فشلت، ذلك لأن تلك الحملات بدأت عند الطبقة الكادحة صعودًا إلى غيرها من الطبقات المرموقة»، مُستطردًا: «أمّا اليوم فالأمر مختلف، ذلك أن الملك سلمان بن عبد العزيز قطع عهدًا على نفسه بوضع حدٍ لـ (عمليات الفساد التي كانت مستشريه في هيكل الدولة)»، كاشفًا عن أن الملك سلمان فور توليه مقاليد الحكم أمر بجمع كل البيانات المُتعلقة بالفساد، عند الطبقة العُليا في السعودية، وهو ما استغرق عامين كاملين، جُمعَتْ خلالهما قائمة مسندة إلى معلومات دقيقة، تضم قرابة مائتي اسم، مُبيِّنًا «أن 95% من المتّهمين وافقوا على إعادة الأموال التي اختلسوها من أموال الدولة»/n/r وعن الإجراءات القانونية المتخذة ضد المتهمين، قال: «كل إجراءات مكافحة الفساد كانت ضرورية، واُتّخِذَت بناءً على قوانين واضحة ومعمول بها؛ بهدف إيصال رسالة عدم التهاون مع أي فساد»، منوهًا إلى أن «الهدف الأول للحملة هو معاقبة الفاسدين وليس تحصيل الأموال»/n/r وتعليقًا على بعض ما روّجته وسائل الإعلام - المحسوبة على أطراف مضادة للسعودية - إلى أن حملة الاعتقالات استهدفت وصول محمد بن سلمان إلى سدّة الحكم في السعودية، قال بن سلمان: «إنه لأمرٌ مضحك أن يقول أحد إن حملة مكافحة الفساد هذه كانت وسيلة لانتزاع السُلطة، فالأعضاء البارزين من المُحتجزين في ريتز أعلنوا مسبقًا بيعتهم لي ودعمهم لإصلاحاتي، كما أن الغالبية العظمى من أفراد العائلة الحاكمة تقف في صفي»، مضيفًا: «لطالما عانت دولتنا من الفساد منذ ثمانينيات القرن العشرين حتى يومنا هذا»/n/r وبحسب محمد بن سلمان، فإن تحقيقات اللجنة العليا لمكافحة الفساد توصلت إلى «أن ما يُقارب 10% من الإنفاق الحكومي السعودي كان قد تعرّض إلى الاختلاس أو الهدر، منذ بداية الثمانينيات، بسبب الفساد من كلتا الطبقتين: العُليا والكادحة»/n/r

وفي 30 يناير 2018، أُعْلِنَ في السعودية عن أن «الحكومة السعودية نجحت في جمع أكثر من مائة وسبعة مليارات دولار أمريكي تتضمن مختلف أنواع الأصول وتشمل عقارات وكيانات تجارية وأوراق مالية ونقد وغيرها، من خلال تسويات مالية مع رجال الأعمال والمسؤولين الذين جرى استدعاؤهم في إطار التحقيقات في حملة مكافحة الفساد»/n/r مثَّل الإعلان نصرًا سياسيًا لولي العهد محمد بن سلمان، الذي توقّع - عند تدشين حملة التطهير - بأن يصل صافي التسويّات إلى نحو مائة مليار دولار أمريكي/n/r

وبعد انتهاء المرحلة الأولى من حملة مكافحة الفساد التي استهدفت محاسبة كبار الفاسدين في السعودية الذين يُعرفون باسم «هوامير الفساد» أو «الرؤوس الكبيرة الفاسدة» على حد وصف مازن الكهموس رئيس هيئة الرقابة ومكافحة الفساد في السعودية، أُعلن عن بدء المرحلة الثانية التي تستهدف محاسبة الفاسدين من الموظفين الحكوميين المتوسطين والصغار، وأشار الكهموس بأن محمد بن سلمان وجهه بتغيير منظومة عمل الهيئة والقضاء على الإجراءات البيروقراطية السابقة وبإعلامه عن أيّ وزير لا يتعاون مع الهيئة/n/r

وفي 12 نوفمبر 2020، في كلمة لمحمد بن سلمان في الجلسة الافتتاحية لأعمال السنة الأولى من الدورة الثامنة لمجلس الشورى السعودي، وصف الفساد الذي كان منتشرًا «خلال العقود الماضية» في المملكة العربية السعودية بأنه مثل مرض السرطان، كاشفًا بأنه كان «يستهلك 5% إلى 15% من ميزانية الدولة»، وهو يرى أنه كان سببًا في انخفاض مستوى الخدمات والمشاريع وعدد الوظائف في السعودية من 5% إلى 15% على أقل تقدير/n/r يعتقد ابن سلمان أن سوء الأداء الإداري الذي خلقه الفساد لم يكن لسنة أو سنتين فقط، ولكنه تراكم على مدى ثلاثين سنة، وعدَّ الفساد العدو الأول للتنمية والازدهار، واصفًا إياه «بالآفة» التي تسبّبت في ضياع العديد من الفرص الكبيرة في السعودية، متوعدًا بأن الفساد: «أصبح من الماضي ولن يتكرر بعد اليوم على أي نطاق كان دون حساب قوي ومؤلم لمن تسوّل له نفسه، كبيرًا أو صغيرًا»/n/r

أعلن ابن سلمان في عام 2020، أن متحصلات تسويات مكافحة الفساد ما بين عامي 2017 و2020، قد بلغت 247 مليار ريال سعودي، ومثّل ذلك ما نسبته 20% من إجمالي الإيرادات غير النفطية السعودية، مشيرًا إلى أن وزارة المالية تعمل على تسييل أصول أخرى بعشرات المليارات نُقِلت إليها، لتُسجل لاحقًا في إيرادات الدولة/n/r

ويرى خبراء إلى أن السعودية بهذه الحملات تضع أقدامها نحو الانتقال لاقتصاد السوق الحر والعمل على تشجيع الاستثمارات التي تعد عصب الاقتصاد السعودي لمرحلة ما بعد النفط وفقًا لرؤية السعودية 2030، مشيرين إلى أن محمد بن سلمان يعتقد أن وجود فساد مالي في إدارة اقتصاد مثل اقتصاد المملكة العربية السعودية يؤدي إلى هدر الموارد المالية ويهدد فرص نمو الاقتصاد ومواكبة التحولات في الاقتصاد العالمي، وأن السعودية معنية بمكافحة الفساد بشكل جذري وبأثر رجعي لضمان الانتقال نحو الاقتصاد الآمن، وقطع الطريق أمام انتشار المحسوبية التي تعد أحد أهم المعوقات التي تعيق التطور الاقتصادي الوطني، وتؤخر خلق التنمية المستدامة/n/r

وفي التقرير السنوي الذي تصدره منظمة الشفافية الدولية، تقدمت السعودية سبعة مراكز عالمية في ترتيب مؤشر مدركات الفساد لعام 2019؛ إذ ارتفعت إلى المركز الـ51 عالمياً من أصل 180 دولة، متقدمة بذلك في مركزها بين دول مجموعة العشرين لتحقق المركز العاشر/n/r

إصلاح التعليم
في 15 سبتمبر 2021، أطلق محمد بن سلمان برنامج تنمية القدرات البشرية، أحد برامج تحقيق رؤية السعودية 2030، وهو يهدف إلى إصلاح نظام التعليم، وتتضمن خطة البرنامج: «89 مُبادرة بهدف تحقيق 16 هدفًا استراتيجيًا من أهداف رؤية المملكة 2030»، وتشتمل استراتيجية البرنامج ثلاث ركائز رئيسة، هي: «تطوير أساس تعليمي متين ومرن للجميع، والإعداد لسوق العمل المستقبلي محليًا وعالميًا، وإتاحة فرص التعلم مدى الحياة»، للمساهمة في تعزيز «قيم الوسطية والتسامح، والعزيمة والمثابرة، والانضباط والإتقان، بما يحقق قيم المواطنة العالمية ويعزز من تنافسية وقدرات المواطن السعودي»، على حد ما جاء في تعريف البرنامج/n/r

إصلاح القضاء
تعرض القضاء السعودي منذ عقود لانتقادات حقوقية بسبب «بطء إجراءات التقاضي التي قد تمتد إلى فترات غير محدودة»، «والغموض الذي يخيم على آلية صدور الأحكام»، «وخلوه من الضمانات»، وقد نتج ذلك لافتقاد النظام القضائي السعودي لمدونة شرعية قانونية جامعة وعامة يرجع القضاة إليها احتكامًا قبل إصدار الأحكام، وافتقاده لنظام السوابق القضائية، بسبب إعمال الاجتهاد في إصدار الأحكام ورفض التقليد، مما أتاح لأي قاض تجاهل الأحكام السابقة سواء صدرت عنه أو عن غيره، ومكنه من تطبيق تفسيره للنصوص الشريعة، الأمر الذي أوجد اختلافات كبيرة في تفسير نصوص الشريعة وفي تطبيقها، مما أوجد أحكامًا متباينة حتى في القضايا المتشابهة/n/r دفع هذا التباين إلى مطالبات نادت بتدوين الشريعة لضبط القضاء، ليُعلن وزير العدل في عام 2010 عن خطط لتدوين الشريعة، إلا إنها ووجهت بمقاومة من التيار الديني المسيطر على القضاء/n/r وسبق ذلك الإعلان بثلاث سنوات أن نشرت وزارة العدل السعودية إصدارها الأوّل من مدونة الأحكام القضائية، ورغم تتابع الإصدارات إلا إنها حددت الهدف من وراء مشروع المدونة بالتوثيق ونشر الفائدة للاستئناس عند الاجتهاد، وكان محمد بن سلمان قد صرّح في 8 فبراير 2021، أن «مدونة الأحكام القضائية اتضح بعد الدراسة بأنها لا تفي باحتياجات المجتمع وتطلعاته»/n/r

كانت السعودية ضمن خطة إصلاحات واسعة في مجال حقوق الإنسان قد قلصت من صلاحيات الأحكام التعزيرية المتروكة لتأويلات القضاة، حيث أوقفت أحكام القتل تعزيرًا على الأشخاص الذين لم يتموا 18 عامًا وقت ارتكابهم الفعل المعاقب عليه، وشمل هذا مرتكبي الجرائم الإرهابية الذين صدرت بحقهم أحكام نهائية، كما ألغت عقوبة الجلد وقررت استبدالها بعقوبتي السجن أو الغرامة، أو بعقوبات بديلة بحسب ما يصدره ولي الأمر من أنظمة أو قرارات بهذا الشأن/n/r وفي 8 فبراير 2021، انتقد محمد بن سلمان افتقار القضاء لمنظومة تشريعات متخصصة، مشيرًا إلى أن ذلك «أدّى إلى تباين في الأحكام وعدم وضوح في القواعد الحاكمة للوقائع والممارسات ما أدّى لطول أمد التقاضي الذي لا يستند إلى نصوص نظامية، علاوة على ما سبَّبهُ ذلك من عدم وجود إطار قانوني واضح للأفراد وقطاع الأعمال في بناء التزاماتهم»، مضيفًا «لقد كان ذلك مؤلمًا للعديد من الأفراد والأسر، لا سيما للمرأة، ومكّن البعض من التنصل من مسؤولياته»، معلنًا عن إطلاق مشروع «منظومة التشريعات المتخصصة»، بهدف «تطوير البيئة التشريعية، من خلال استحداث وإصلاح الأنظمة التي تحفظ الحقوق وتُرسِّخ مبادئ العدالة والشفافية وحماية حقوق الإنسان وتحقّق التنمية الشاملة، وتعزّز تنافسية المملكة عالميًا من خلال مرجعياتٍ مؤسسيةٍ إجرائيةٍ وموضوعيةٍ واضحةٍ ومحددةٍ»، مشيرًا إلى أن عملية تطوير المنظومة التشريعية في المملكة مستمرة، وستصدر هذه التشريعات تباعًا، بعد أن تُحال على مجلس الوزراء وأجهزته لدراستها ومراجعتها وفق الأصول التشريعية؛ تمهيدًا لإحالتها على مجلس الشورى وفقًا لنظامه، ومن ثم إصدارها وفقًا للأصول النظامية المتبعة في هذا الشأن/n/r

منظومة التشريعات المتخصصة
كشف محمد بن سلمان عن أن «منظومة التشريعات المتخصصة» تضم أربعة مشروعات أنظمة تعمل السعودية على إعدادها، وهي مشروع نظام الأحوال الشخصية، ومشروع نظام المعاملات المدنية، ومشروع النظام الجزائي للعقوبات التعزيرية، ومشروع نظام الإثبات، مشيرًا إلى أن هذه المنظومة «ستُمثِّلُ موجة جديدة من الإصلاحات، التي ستُسهم في إمكانية التنبؤ بالأحكام ورفع مستوى النزاهة وكفاءة أداء الأجهزة العدلية وزيادة موثوقية الإجراءات وآليات الرقابة، كونها ركيزة أساسية لتحقيق مبادئ العدالة التي تفرض وضوحَ حدود المسؤولية، واستقرار المرجعية النظامية بما يحدّ من الفردية في إصدار الأحكام»، مبينًا أن المنظومة ستلتزم «بأحدث التوجهات القانونية والممارسات القضائية الدولية الحديثة، بما لا يتعارض مع الأحكام الشرعية»، وأنها «سيراعي التزامات المملكة فيما يخصُّ المواثيق والاتفاقيات الدولية التي انضمت إليها»/n/r وقد أقر مجلس الوزراء في 28 ديسمبر 2021 نظام الإثبات/n/r

الدين
وصل محمد بن سلمان إلى ولاية العهد في ظل هيمنة التيار الديني الحركي على مجمل الحياة العامة في السعودية، هيمنة نتجت عن سطوة مطلقة فرضها التيار على التربية والتعليم والثقافة والإعلام والقضاء، حتى اتسمت البلاد بطابع التزمت الديني الذي أثر على طبيعة المجتمع السعودي وعكس صورة مغايرة عن حقيقة البلاد/n/r

القرآن والسنة
في مقابلة للأمير محمد بن سلمان، بُثت في 27 أبريل 2021، في الذكرى الخامسة للإعلان عن رؤية السعودية 2030، قال إن السعودية في الجوانب الشرعية: «ملزمة بتطبيق أحكام القرآن وأحكام الحديث المتواتر، وتنظر إلى حديث الآحاد وفقًا لدرجة صحته، ولا تنظر إلى «الخبر» بتاتًا إلا إن كان فيه مصلحة واضحة للإنسان»، مضيفًا: «ألا عقوبة على شأن ديني إلا بنص قرآني قطعي الدلالة»، وأن السلطة غير ملزمة بمحاسبة الأفراد على أمر لم يُنزل الله به حكمًا عقابيًا دنيويًا، مشيرًا إلى أن القرآن هو دستور السعودية/n/r وفي معرض سؤاله عن مدرسة الشيخ محمد بن عبد الوهاب إن كانت هي الدائرة التي يلزم تفسير القرآن والحديث في حدودها، قال: إن المملكة غير ملزمة بالأخذ بتفسير مدرسة فقهية واحدة أو عالم فقيه واحد في تطبيق أحكام الإسلام، وأن الالتزام بذلك هو تأليه للبشر وغلق لباب الاجتهاد، في حين «لم يضع الله حجابًا بينه وبين الناس»/n/r

الوسطية
حين سئل محمد بن سلمان عن مفهومه للاعتدال، قال في 27 أبريل 2021، إن: «[كلمة] الاعتدال واسعة للغاية، فجميع فقهاء المسلمين اجتهدوا بمفهوم الاعتدال منذ أكثر من 1000 عام»، وإنه «غير قادر على شرح الكلمة»، لكنه أشار إلى أن مفهوم الاعتدال عنده هو: «الالتزام بدستور المملكة العربية السعودية أي القرآن والسنة اللذين يشكّلان أساس نظام الحكم في السعودية /n/r/n/r/n/r وتطبيقه على أكمل وجه وبمفهوم واسع يشمل الجميع»، وعن مصطلح «الإسلام المعتدل»، قال إن استخدام: مصطلح «الإسلام المعتدل» قد يجعل المتطرفين والإرهابيين سعداء، ذلك أنه قد يوحي أن السعودية والبلدان الأخرى [التي انتهجت الوسطية] تعمل على تغيير الإسلام إلى شيءٍ جديد، بينما هي عودة إلى أصل وجذور الإسلام، رجوع «إلى تعاليم الإسلام الحقيقية، التي عاش بها الرسول عليه الصلاة والسلام والخلفاء الأربعة الراشدون، حيث كانت مجتمعاتهم منفتحة ومسالمة، يعيش المسلمون فيها جنبًا إلى جنب المسيحيين واليهود»، مشيرًا إلى أن «هذه التعاليم أرشدتنا أن نحترم مختلف الثقافات والديانات»/n/r

محاربة التطرف والإرهاب في السعودية
المقالات الرئيسة: الصحوة السعودية والإرهاب في السعودية
اتخذ محمد بن سلمان خطواتٍ عديدة لمحاربة التطرّف الديني في المملكة العربية السعودية، واستهدفت تلك الخطوات إنهاء ما يُسمّى مشروع الصحوة الإسلامية في السعودية/n/r ويسجّل المتابعون أن ثقافة التشدّد في المملكة العربية السعودية أصبحت في انحسارٍ بسبب سياسات محمد بن سلمان، لصالح ما يعتقد أنّها تعاليم الإسلام الحقيقية، الضامنة لثقافة التعدّدية الفكرية، «المنفتحة على العالم وعلى جميع الأديان وعلى جميع التقاليد والشعوب»/n/r والصحوة الإسلامية في السعودية هي حركة فكرية اجتماعية إسلامية سياسية نشأت بدعم من مجموعة دعاة إبان حراكهم الدعوي، والتسمية إشارة إلى «إيقاظ الناس من غفوتهم» حسبما يقولون، وقد تأثر شيوخ هذا التيار بفكر جماعة الإخوان المسلمين/n/r بدأ مصطلح «الصحوة» في الظهور في حقبة الثمانينيات من القرن العشرين/n/r بحسب محمد بن سلمان فإن «الصحوة» حالة غير عادية وغير طبيعية دخلت على المجتمع السعودي، وبدأت بنشر ما وصفه بالإسلام «غير المعتدل»، من خلال سيطرتها على سلك التعليم في المملكة، بعد أن أصبحت مدارس المملكة العربية السعودية ساحة نشاط لهؤلاء، حيث «تعرضت للغزو من جماعات متشددة، من بينها الإخوان المسلمين» بحسب تعبيره، وقد أرجع هذه الحالة إلى كونها ردَّ فعلٍ مُوَازٍ للثورة الإسلامية في إيران/n/r وقال ابن سلمان أن المجتمع السعودي، خاصة الشباب منهم، كانوا ضحية لهذا المشروع، متعهدًا بـ«تحرير المجتمع السعودي» من مشروع الصحوة وذلك بإنهاء تلك الحقبة لإعادة السعودية إلى ما كانت عليه قبل ثلاثين عامًا، أي إلى ما قبل بدء الصحوة، حيث كان الناس «يعيشون حياة طبيعية مثل بقية دول الخليج العربي»، ضاربا أمثلة بأن النساء «كن يقدن السيارات، وكانت هناك دور للسينما»، مضيفًا أن: «70% من الشعب السعودي هم شباب وشابات بأعمار لم تتجاوز الثلاثين عامًا، وبكل صراحة لن نضيع ثلاثين سنة من حياتنا في التعامل مع أي أفكار مدمّرة»، مستطردًا: «سوف ندمرها اليوم وفورًا»، وهو تصريح يرى مراقبون بأنّه يعكس توجهًا فكريًا واضحًا لديه لمحاربة مشروع الصحوة، ويُفسر سلسلة الخطوات التي اتُّخذت لمحاربة ما يوصف بالتطرّف في المملكة، بعد أن تعهد بالقضاء عليه في القريب العاجل على حد وصفه، قائلًا: «لن تقبل أي دولة في العالم بأن يكون لديها جماعة متطرّفة تسيطر على نظام الدولة التعليمي»/n/r

أطلق محمد بن سلمان في 30 أبريل 2017، مركز الحرب الفكرية التابع لوزارة الدفاع السعودية، لمواجهة جذور التطرف والإرهاب، ونشر ثقافة التسامح التي يدعو لها الإسلام، وفي 21 مايو 2017، افتتح الملك سلمان المركز العالمي لمكافحة الفكر المتطرف في الرياض، بحضور الرئيس الأمريكي دونالد ترمب وولي العهد السعودي وجمع من رؤساء الدول حول العالم، وهو مركز عالمي يخدم جميع دول العالم ويُعنى بمحاربة التطرف فكريًا وإعلاميًا ورقميًا، وتعزيز قيم التعايش والتسامح بين الشعوب، وينشر بجميع اللغات حول العالم/n/r

كانت واشنطن العاصمة قد أعربت عن رغبة شديدة في رؤية المزيد من الخطوات السعودية لمكافحة الجماعات المتطرفة والإرهابية، ودعا مسؤولون أمريكيون نظراءهم السعوديين إلى المضي بصرامة أكبر في نزع الشرعية عن الأيديولوجية الدينية المتطرفة في السعودية/n/r

يقول محمد بن سلمان بأن القضاء على التطرف داخل السعودية في عام 2017، «لم يكن خيارًا مطروحًا من الأساس، ولا السيطرة عليه أمرًا واردًا»، ذلك أنه كان قد استشرى وقوي عوده بشكل كبير حتى وصل السعوديون إلى مرحلة يهدفون فيها في أفضل الأحوال: «إلى التعايش مع هذه الآفة» على حد تعبيره، إلا أنه منذ أن وعد بالقضاء عليه في عام 2017، استطاعت الحكومة السعودية خلال سنة واحدة، أن تقضي على «مشروع أيديولوجي صُنع على مدى 40 سنة»/n/r

يرى محمد بن سلمان، بعد ثلاثة سنوات من بدء حملته على التطرّف، بأن التطرف لم يعد مقبولًا اليوم في المملكة العربية السعودية، وهو وإن لم يعد يظهر على السطح، إذ أصبح «منبوذًا ومتخفيًا ومنزويًا»، لكنه لم ينتهِ بعد، متعهدًا بالاستمرار في مواجهة أي مظاهر وتصرفات وأفكار متطرفة «دخيلة من جهات خارجية تسترت بعباءة الدين»، نبذها السعوديون، قائلًا بأن السعوديين «لن يسمحوا أبدًا بوجودها بينهم مرة أخرى»/n/r

في منتصف عام 2017، عمل محمد بن سلمان أيضًا على إعادة هيكلة وزارة الداخلية السعودية، بعد أن تزايدت العمليات الإرهابية داخل السعودية منذ تفجيرات الخبر عام 1996، وهي الفترة التي لم يكد يمر عام من دون أن تتعرض السعودية فيها لعملية إرهابية واحدة، حتى «وصل الحال إلى عملية إرهابية في كل ربع عام أو أقل» كما قال ابن سلمان، مشيرًا إلى أن الجماعات الإرهابية استطاعت أن تصل ما بين عامي 2012 و2017 إلى داخل المقرات الأمنية السعودية نفسها، وهذا الأمر دفعه إلى إصلاح القطاع الأمني وتغيير آلية مواجهة الإرهاب حيث أصبح عمل الأجهزة الأمنية السعودية تحت إدارته «استباقيًا»، وهذا بدوره كان سببًا في انخفاض عدد العمليات الإرهابية في السعودية ما بين عامي 2017 و2020، حيث لفت محمد بن سلمان إلى أن السعودية وصلت إلى ما يقارب «صفر» عملية إرهابية ناجحة خلال هذه الفترة، باستثناء ما أسماها: «محاولات فردية معدودة لم تحقق أهدافها البغيضة»، متوعدًا بأن الدولة السعودية ستضرب «بيد من حديد» ضد كل من تسوّل له نفسه المساس بأمنها واستقرارها/n/r

يعتقد محمد بن سلمان بأن «خطاب الكراهية هو الدافع الرئيسي لتجنيد المتطرفين»، ويشمل خطاب الكراهية الذي يستخدم حرية التعبير وحقوق الإنسان مبررًا لازدراء الأديان ومهاجمة الرموز الدينية والوطنية، ويرى ابن سلمان، بأن هذا النوع من الخطاب يخلق بيئة خصبة للتطرف والإرهاب ويستقطب خطاب كراهية مضادًا من المتطرفين/n/r وسبق لمحمد بن سلمان أن رفض في أكثر من مناسبة أي محاولة للربط بين الإسلام والإرهاب، داعيًا دول العالم أن تحذو حذو السعودية في تجريم ونبذ كل عمل إرهابي أو ممارسات وأعمال تولد الكراهية والعنف/n/r

تحديد دور الحسبة
المقالة الرئيسة: هيئة الأمر بالمعروف والنهي عن المنكر
حدَّ محمد بن سلمان من دور الشرطة الدينية السعودية التي تُعرف رسميًا باسم هيئة الأمر بالمعروف والنهي عن المنكر، حيث جُردت من سلطتها في مباشرة وتنفيذ إجراءات «الضبط الجنائي والإداري والتحفظ والمتابعة والمطاردة والإيقاف والاستجواب والتثبت من الهوية والتحقيق والقبض»، بعد أن قُصرت هذه الإجراءات على السلطات الأمنية التابعة لوزارة الداخلية، وكان «رجال الحسبة» أو «المطاوعة» كما يُسمون محليًا قد عُرفوا بالتعسف والتَّزمّت، خاصة تجاه النساء السعوديات، وسُجلت حوادث وفاة عديدة تسببت بها دورياتهم وعلقت في ذاكرة المجتمع السعودي، ومنها مقتل 15 طالبة في حريق بمدرسة بنات في مكة في 11 مارس 2002، بعد أن منع رجال الحسبة رجال الإطفاء ورجال الإسعاف من الدخول إلى المدرسة لئلا «يُكشفن على غريب»/n/r

رؤية 2030

شعار رؤية السعودية 2030
المقالات الرئيسة: رؤية السعودية 2030 وبرنامج التحول الوطني
في 25 أبريل 2016 أطلق محمد بن سلمان رؤية أسماها رؤية المملكة العربية السعودية 2030، وهي خطة اقتصادية اجتماعية ثقافية سياسية شاملة للمملكة العربية السعودية تؤسس لدخول المملكة إلى عصر ما بعد النفط/n/r تتزامن الرؤية مع التاريخ المحدّد لإعلان الانتهاء من تسليم ثمانين مشروعًا حكوميًا عملاقًا، يكلّف أقل واحد بينهما ما يعادل أربعة مليارات ريال، بينما بعض المشاريع تفوق كلفتها المائة مليار ريال سعودي، كما في مشروع مترو الرياض/n/r نظَّمَ الخُطَّة مجلس الشؤون الاقتصادية والتنمية برئاسته، وقد عُرِضت على مجلس الوزراء السعودي برئاسة الملك سلمان بن عبد العزيز آل سعود/n/r وبعد الإعلان عن الرؤية، قدّم محمد بن سلمان، عن طريق مجلس الشؤون الاقتصادية والتنمية كل من برنامج التحول الوطني في 7 يونيو 2016 وبرنامج تحقيق التوازن المالي في 22 ديسمبر 2016، إذ يعد كل منهما من ركائز الرؤية، وقد وافق مجلس الوزراء السعودي على البرنامجين/n/r

يهدف محمد بن سلمان من خلال هذه الخطة، والبرامج المتصلة بها، إلى زيادة الإيرادات غير النفطية السعودية ستة أضعاف من نحو 43/n/r5 مليار دولار سنويًا إلى 267 مليار دولار سنويًا، إضافة إلى زيادة حصة الصادرات غير النفطية السعودية من 16% من الناتج المحلي السعودي (في 2016) إلى 50% من الناتج المحلي السعودي (في 2030)/n/r كما أنّه يريد بهذه الرؤية أن يجعل الاستثمار في الداخل السعودي منطقة لإيجاد المزيد من الفرص الوظيفية والاقتصادية في السعودية/n/r وضع محمد بن سلمان ثلاثة أركان للرؤية السعودية، هي باعتقاده بمثابة عوامل نجاحها إذا ما ارتكزت الرؤية عليها:

الركن الأوّل هو أن السعودية هي العمق العربي والإسلامي، إذ يوجد بها المسجد الحرام في مكة المكرمة، والمسجد النبوي في المدينة المنورة، واللذان يعدان أهم الأماكن المقدسة عند المسلمين، بذلك هي قبلة أكثر من 1/n/r8 مليار مسلم على وجه الأرض، ويجب أن ترتكز الرؤية على هذا العامل/n/r
الركن الثاني: القدرات الاستثمارية الضخمة للمملكة العربية السعودية يجب أن تكون محركًا لاقتصاد المملكة وموردًا إضافيا لها، وبهذه القدرات تهدف الرؤية أن تصنع من المملكة العربية السعودية قوة استثمارية رائدة/n/r
الركن الثالث، يعتقد محمد بن سلمان أن الموقع الجغرافي الإستراتيجي للمملكة العربية السعودية، وما يحيط بها من معابر مائية مهمة - مضيق هرمز في الشرق، مضيق باب المندب في الجنوب الغربي، قناة السويس في الشمال الغربي - يجعل من المملكة أهم بوابة للعالم بصفتها مركز ربط للقارات الثلاث (آسيا، أفريقيا وأوروبا)/n/r
نيوم
المقالة الرئيسة: نيوم
نيوم أو «المدينة الحلم» أو «أرض الفرص والأحلام» كما وُصِفَت، مشروع مدينة ذكية أطلقه محمد بن سلمان في مؤتمر دولي للاستثمار في مدينة الرياض في 24 أكتوبر 2017/n/r يرغب ابن سلمان أن تكون «نيوم» بمثابة عاصمة تجارية واقتصادية عالمية تمثل روح العصر المرتبط بالذكاء الاصطناعي/n/r يقع مشروع «نيوم» شمال غرب السعودية على مساحة ست وعشرين ألفًا وخمسمائة كيلومتر مربع بالاشتراك مع كلٍّ من مصر والأردن، وسيكون المشروع «منطقة خاصة» سيشتمل أراضٍ سعودية وأخرى مجاورة لها داخل الحدود المصرية والأردنية، وسيحكم بقوانين تجارية خاصة به/n/r وقد جاء اختيار محمد بن سلمان لهذه المنطقة لتكون أرض المشروع، ذلك بأن قرابة عشرة بالمائة من حركة التجارة العالمية تمّر عبر ساحلها، إضافة إلى أن الموقع يعد محورًا يربط القارات الثلاث آسيا وأوروبا وأفريقيا، إذ يمكن لسبعين بالمائة من سكان العالم الوصول إلى «نيوم» خلال ثماني ساعات كأقصى حد/n/r قدّر محمد بن سلمان قيمة المشروع بخمسمائة مليار دولار أمريكي، قائلا أن تمويله سيكون من قبل صندوق الاستثمارات العامة ومستثمرين سعوديين ودوليين/n/r وهو يطل من الشمال والغرب السعوديين على البحر الأحمر وخليج العقبة بطول 468 كيلومتر وتحيط به من الشرق سلسلة جبال بارتفاع 2500 متر/n/r

قال محمد بن سلمان أن المنطقة ستكون مفتوحة للسياحة في العام 2020، بينما ستُفتتح مدينة نيوم - التي يقوم عليها المشروع - في العام 2025/n/r قالت صحيفة فاينانشال تايمز في وصف المشروع بأنَّ محمد بن سلمان يريد أن يبني «دافوس في الصحراء»، في إشارة إلى مدينة دافوس السويسرية التي يقام فيها المنتدى الاقتصادي العالمي/n/r يأتي مشروع نيوم كجزء من رؤيته رؤية السعودية 2030 ضمن استراتيجية وُصِفَت بأنّها طموحة، تستهدف الانفتاح الاقتصادي ومحاربة التطرّف وتخفيف القيود الاجتماعية الطارئة على السعودية حسبما وصفها محمد بن سلمان/n/r وكان ولي العهد السعودي قد أعلن أن أسهم مدينة نيوم ستطرح للاكتتاب في الأسواق المالية العالمية، حيث قال إنّ نيوم هي «أوّل مدينة رأسمالية في العالم، هذا هو الشيء الفريد الذي سيحدث ثورة»، مضيفًا: «ستكون أول منطقة تطرح في الأسواق العامة، يبدو الأمر كما لو أنك تطرح مدينة نيويورك في الأسواق»/n/r

ذا لاين
المقالة الرئيسة: ذا لاين
أقدم لكم ذا لاين، مدينة مليونية بطول 170 كم تحافظ على 95% من الطبيعة في أراضي نيوم، صفر سيارات، صفر شوارع، وصفر انبعاثات كربونية/n/r
—محمد بن سلمان، 10 يناير 2021
هو مشروع مدينة مخططة في منطقة تبوك شمال غرب السعودية/n/r المدينة مخطط لها على أن تكون بشكل خط مستقيم بطول 170 كيلومتر (105 أميال)، يمتد من البحر الأحمر غربا إلى الشرق، ماراً بتضاريس جغرافية وبيئية مختلفة ومتنوعة، تشمل السواحل والسهول والأودية والصحاري والجبال، ستكون مدينة خالية من الكربون، وقادرة على إيواء مليون ساكن/n/r ستكلف بنيتها التحتية ملبغ من 100 إلى 200 مليار دولار، ويتوقع أن تخلق 380 ألف فرصة عمل وتحفز التنويع الاقتصادي وتساهم بمبلغ 180 مليار ريال سعودي في الناتج المحلي الإجمالي المحلي بحلول عام 2030/n/r ومن المخطط أن يتم تشغيلها بنسبة 100٪ من الطاقة المتجددة وأن يكون لها لوائح أعمال قائمة على المسؤولية البيئية/n/r

في 25 يوليو 2022، كشف محمد بن سلمان عن تصاميم مدينة «ذا لاين»، إذ سيبلغ عرضها 200 م فقط على امتداد 170 كلم، وارتفاع يبلغ 500 م فوق سطح البحر، مما سيجعلها بمثابة ناطحات سحاب متشابكة وممتدة على طول 170 كلم/n/r ستُبنى المدينة على مساحة لا تتجاوز 34 كلم2، وستتسع لنحو 9 ملايين نسمة/n/r أشار الأمير إلى المدينة ستتيح لجميع السكان إمكانية الوصول إلى جميع المرافق والخدمات في غضون خمس دقائق، إضافة إلى وجود قطار فائق السرعة يصل بين طرفي المدينة خلال عشرين دقيقة/n/r وكشفت التصاميم أن جانبي المدينة الخارجيين سيغطيان بمرايا عاكسة/n/r وستكون مدينة «ذا لاين» إحدى مشاريع نيوم المصممة رقميًا بالكامل/n/r

مشروع القِدِّية
المقالة الرئيسة: القدية (مشروع)
في 8 أبريل 2017، أطلق محمد بن سلمان مشروع منتجع القِدِّية الترفيهي الذي يستهدف تأسيس أكبر مدينة ترفيهية ثقافية رياضية على مستوى العالم بمساحة 334 كيلومتر مربع، أي يزيد حجمه عن ديزني وورلد بثلاث مرات تقريبًا/n/r «عاصمة المغامرات المستقبلية» على حد وصف محمد بن سلمان للمشروع، يستهدف منه – إضافة إلى تنويع إيرادات صندوق الاستثمارات العامة – أن يحافظ على حصة من إنفاق السعوديين على الترفيه/n/r

مشروع البحر الأحمر
المقالة الرئيسة: مشروع البحر الأحمر
في 31 يوليو 2017، أطلق محمد بن سلمان من خلال صندوق الاستثمارات العامة مشروع البحر الأحمر وهو مشروع سياحي عالمي، يستهدف خلق منتجعات سياحية على أكثر من خمسين جزيرة سعودية بين مدينتي أُمْلُج الحوراء والوجه، ويجاور المحميات الطبيعية بالمنطقة والبراكين الخاملة، ومواقع آثار أبرزها مدائن صالح، وسيقام على مساحة تقدّر بأربع وثلاثين ألف كيلومتر مربع/n/r يرغب محمد بن سلمان أن يصبح هذا المشروع بوابة لاستكشاف منطقة البحر الأحمر أمام العالم لينافس كلا من جزر السيشل وجزر المالديف التي يمكن لجميع سكان الأرض زيارتهما، إذ سيُتاح لغالبية السيّاح في العالم إمكانية زيارة منطقة مشروع البحر الأحمر والدخول إليها من دون الحاجة إلى حصولهم على تأشيرة دخول سعودية، ويستهدف محمد بن سلمان من هذه الخطوة، من جهة كسر حواجز التطرّف الذي منع تطوير السياحة - خاصة البحرية منها - في السعودية، ومن جهة أخرى أن يكون للمملكة حضور على خريطة السياحة العالمية وفقًا لرؤية السعودية 2030/n/r

وكان محمد بن سلمان في العام 2015 قد زار المنطقة - قبل الكشف عن المشروع بعامين - حيث أبدى في مقابلة له مع مجلة الإيكونوميست البريطانية عن إعجابه بتلك المنطقة، قائلا بـ«أنها رائعة»، و«أنه قضى بها ثماني عطلات»، حيث «يوجد فيها ما يقرب من مائة جزيرة، في مجموعة مرجانية واحدة»/n/r مضيفًا «إن المنطقة تتمتع بدرجة حرارة مثالية وهي أكثر برودة من مدينة جدة، كما أنها تعتبر أرضًا عذراء يمكن استغلالها اقتصاديًا»/n/r

مدينة الأمير محمد بن سلمان غير الربحية
المقالة الرئيسة: مدينة الأمير محمد بن سلمان غير الربحية
في 14 نوفمبر 2021، أعلن الأمير محمد عن مدينة الأمير محمد بن سلمان غير الربحية، وهي أول مدينة غير ربحية في العالم، ستقام على أرض خاصة بولي العهد في حي عرقة غرب الرياض العاصمة بمحاذاة وادي حنيفة، على مساحة تقدر بحوالي (3/n/r4) كيلو متر مربع، خصصها ولي العهد لتنفيذ المشروع/n/r المدينة ستكون حاضرة رقمية متقدمة محورها الإنسان، صممت لتكون مستدامة وصديقة للمشاة، مع تخصيص أكثر من (44%) من المساحة الإجمالية كمساحات خضراء مفتوحة لتسهم في تعزيز التنمية المستدامة/n/r المدينة التي تتبنى مفهوم التوأم الرقمي ستحتضن العديد من الأكاديميات والكليات ومدارس مسك، وستشمل على مركز للمؤتمرات، ومتحف علمي، ومركز الإبداع ليكون مساحة لتحقيق طموحات المبتكرين في العلوم والتقنية بالأنظمة المتطورة مثل: الذكاء الاصطناعي، وإنترنت الأشياء والروبوتات، وكذلك معهد ومعرض للفنون، ومسارح لفنون الأداء، ومنطقة ألعاب، ومعهد لفنون الطهي بالإضافة إلى مجمع سكني متكامل، وستعمل المدينة أيضاً على استضافة رؤوس الأموال الجريئة والمستثمرين ذوي المساهمات المجتمعية حول العالم/n/r

مدينة أوكساجون
المقالة الرئيسة: أوكساجون
في 16 نوفمبر 2021، أعلن الأمير محمد عن إطلاق مدينة نيوم الصناعية «أوكساجون»، هي مدينة صناعية تعد أكبر تجمع صناعي عائم في العالم/n/r تقع المدينة في الركن الجنوبي الغربي من نيوم على البحر الأحمر بالقرب من قناة السويس، ويتوقع أن تبدأ استقبال رواد التصنيع والمستثمرين وأصحاب الأعمال في بداية عام 2022/n/r

طرح أرامكو للاكتتاب العام
المقالات الرئيسة: أرامكو السعودية وطرح أسهم أرامكو للاكتتاب العام
في 4 يناير 2016، كشف محمد بن سلمان لمجلة ذي إيكونوميست البريطانية، عن مقترح طرح نسبة من أسهم شركة أرامكو، كجزء من خطة الإصلاح الاقتصادي لرؤية السعودية 2030، بهدف استحداث أسلوب الإدارة ونظام التدقيق الغربي في عملاقة النفط العالمية، إضافة إلى توفير سيولة مالية تساهم في الحد من العجز في ميزانية السعودية/n/r وحُدِّدت النسبة المتوقع طرحها للاكتتاب بسقف لا يتجاوز خمسة في المائة من أسهم شركة أرامكو/n/r وقال خبراء أن قيمة الشركة ستصل إلى تريليوني دولار أمريكي (2000 مليار دولار)، عند الطرح الأوّلي الذي وُصِفَ – فيما لو تم – بالأعظم في التاريخ، نظرًا إلى حجم الشركة/n/r وكشف محمد بن سلمان أن صندوق الاستثمارات العامة هو من سيدير عملية الاكتتاب، التي من المرجّح أن تكون في سوق الأوراق المالية السعودي في الرياض، أو أحد المراكز المالية الدولية الرائدة في العالم/n/r وكان الرئيس الأمريكي ترمب حثّ ولي العهد السعودي على أن يختار بورصة نيويورك منصة للاكتتاب والتداول، فيما تشير تصريحات المسؤولين السعوديين أن بورصة لندن هي الأقرب/n/r

وكان من المتوقّع أن يبدأ الاكتتاب الأوّلي في النصف الثاني من العام 2018، لكنَّ تقريرًا نُشِر على موقع وكالة رويترز للأنباء في 22 أغسطس 2018، نُسِب إلى مصادر قيل أنّها سعودية، رجّح وقف خطة طرح أرامكو، وهو ما نفته وزارة الطاقة السعودية بعد ساعات، غير أن وزير الطاقة السعودي خالد الفالح كشف عن تأجيل الطرح إلى أجل غير مُسمّى، إذ أكد في بيان الوزارة: «أن الحكومة ما تزال ملتزمة بالطرح الأولي العام لأرامكو السعودية، وفق الظروف الملائمة، وفي الوقت المناسب الذي تختاره الحكومة»/n/r في 3 نوفمبر 2019 أعلن رئيس مجلس إدارة أرامكو موافقة هيئة السوق المالية السعودية على الاكتتاب، وقبلها كانت قد نُشرت تقارير أفادت بموافقة ولي العهد محمد بن سلمان على طرح أرامكو للاكتتاب وأنّه «أعطى الضوء الأخضر لبدء الطرح»، ما أدّى إلى أن تعلن الشركة في 17 نوفمبر 2019، طرح جزء بلغ 1/n/r5% من إجمالي أسهم الشركة للتداول العام، ومع انتهاء فترة الاكتتاب، أصبح اكتتاب أرامكو، أكبر طرح أولي عام في التاريخ، حيث جمع أكثر من 25/n/r6 مليار دولار أمريكي، مُتجاوزًا الرقم القياسي المُسجّل في عام 2014 لمجموعة علي بابا الصينية البالغ حينها 25 مليار دولار/n/r وعند بدء تداول أسهم الشركة في السوق المالية السعودية في 11 ديسمبر 2019، وصلت القيمة السوقية لأرامكو إلى 2 تريليون دولار أمريكي، مزيحة شركة أبل من عرش أكبر الشركات من حيث القيمة في العالم/n/r وقد ارتفع سعر سهم أرامكو بنسبة 10% عند بدء تداوله ليصل إلى 35 ريالًا سعوديًّا، وارتفع سهم الشركة يوم الخميس بنسبة 10% لليوم الثاني على التوالي، ليبلغ سعره 38/n/r7 ريال سعودي أي 10/n/r32 دولار أمريكي للسهم الواحد/n/r كل هذا دفع بالسوق المالية السعودية لتُعزّز موقعها بين الأسواق المالية العالمية لتصبح تاسع أكبر سوق مالية في العالم، ما جعلها تقترب من حجم البورصتين الألمانية والكندية، ومتجاوزة البورصة الهندية/n/r وقد وُصِف اليوم الأوّل للتداول باليوم الذي تحقّق فيه وعد محمد بن سلمان الذي كان قد قطعه منذ أكثر من ثلاث سنوات/n/r

الطاقة النووية

محمد بن سلمان مصافِحًا الرئيس الروسي فلاديمير بوتين
في مقابلة له مع صحيفة الواشنطن بوست، قال محمد بن سلمان أن «لدى المملكة العربية السعودية أكثر من خمسة بالمائة من احتياطيات مادة اليورانيوم في العالم»، واصفًا «عدم استخدامها يشابه الاستغناء عن النفط»/n/r وكانت الحكومة السعودية قد وقعت مع روسيا الاتحادية عددًا من الاتفاقيات في المجال النووي، على رأسها إنشاء 16 مفاعلًا نوويًا، بعد زيارة قام بها محمد بن سلمان إلى روسيا في 18 يونيو 2015، حيث التقى الرئيس الروسي فلاديمير بوتين في مدينة سان بطرسبرغ/n/r وتؤسس الاتفاقية الموقعة للتعاون بين البلدين في المجال النووي، بما في ذلك، «إنشاء واستخدام وتفكيك المفاعلات النووية المخصصة لإنتاج الطاقة، وتقديم الخدمات المتعلقة بمعالجة الوقود النووي المستنفد، وإنتاج النظائر المشعة واستخدامها في الصناعة والطب والزراعة، وتأهيل الكوادر في مجال الطاقة النووية»/n/r

وبعيد تلك الزيارة، وقع محمد بن سلمان مذكرتي تفاهم مع الحكومة الفرنسية - بعد لقاءه الرئيس الفرنسي فرونسوا أولاند - للتعاون في «مجالات إدارة النفايات المشعة بين مدينة الملك عبد الله للطاقة الذرية والمتجددة والمعهد الفرنسي للوقاية من الإشعاعات والسلامة النووية، والتعاون ين مدينة الملك عبد الله للطاقة الذرية والمتجددة والوكالة الفرنسية لإدارة النفايات النووية في مجال تطوير تنظيم الاستخدامات السلمية للطاقة النووية في مجال النفايات النووية»/n/r وكان مجلس الوزراء السعودي قد وافق على الاتفاقية الروسية السعودية في اجتماع له في مارس 2016، ثم أتبع ذلك بالموافقة على «المشروع الوطني للطاقة الذرية السعودية»، الذي رفعه ولي العهد إلى المجلس في 24 يوليو 2017/n/r والخطة الأوّلية للمشروع، ترسمُ ببناء محطة نووية مدنية لإنتاج الطاقة، تتكون من مفاعلين نووين اثنين، ستطرح مناقصة إنشاءها قُبيل نهاية عام 2018، حسبما أُعْلِنَ في السعودية/n/r

النقل
المقالة الرئيسة: وزارة النقل والخدمات اللوجستية
أطلق محمد بن سلمان رئيس اللجنة العليا للنقل والخدمات اللوجستية في 30 يونيو 2021م، الاستراتيجية الوطنية للنقل والخدمات اللوجستية، التي تهدف لترسيخ مكانة المملكة مركزًا لوجستيًا عالميًا يربط القارات الثلاث، والارتقاء بخدمات ووسائل النقل كافة، وتعزيز التكامل في منظومة الخدمات اللوجستية وأنماط النقل الحديثة لدعم مسيرة التنمية الشاملة في المملكة/n/r

وتتضمن الاستراتيجية حزمة من المشروعات الكبرى الممكِّنة لتحقيق المستهدفات الاقتصادية والاجتماعية، واعتماد نماذج حوكمة فاعلة لتعزيز العمل المؤسسي في منظومة النقل، وبما يتفق مع تغير مسمى الوزارة من وزارة النقل إلى وزارة النقل والخدمات اللوجستية/n/r

وقال سمو ولي العهد: «إن هذه الاستراتيجية ستسهم في تعزيز القدرات البشرية والفنية في قطاع النقل والخدمات اللوجستية بالمملكة، وستعزز الارتباط بالاقتصاد العالمي، وتمكن بلادنا من استثمار موقعها الجغرافي الذي يتوسط القارات الثلاث في تنويع اقتصادها؛ من خلال تأسيس صناعة متقدمة من الخدمات اللوجستية، وبناء منظومات عالية الجودة من الخدمات، وتطبيق نماذج عمل تنافسية لتعزيز الإنتاجية والاستدامة في قطاع الخدمات اللوجستية؛ بوصفه محوراً رئيسياً في برامج رؤية المملكة 2030، وقطاعاً حيوياً ممكِّناً للقطاعات الاقتصادية، وصولا لتحقيق التنمية المستدامة»/n/r

تركز الإستراتيجية على تطوير البنى التحتية، وإطلاق العديد من المنصات والمناطق اللوجستية في المملكة، وتطبيق أنظمة تشغيل متطورة، وتعزيز الشراكات الفاعلة بين المنظومة الحكومية والقطاع الخاص لتحقيق أربعة أهداف رئيسة هي:

تعزيز مكانة المملكة كمركز لوجستي عالمي/n/r
الارتقاء بجودة الحياة في المدن السعودية/n/r
تحقيق التوازن في الميزانية العامة/n/r
تحسين أداء الجهاز الحكومي/n/r
وأضاف، أن الإستراتيجية تستهدف النهوض بالمملكة العربية السعودية لتصبح في المرتبة الخامسة عالمياً في الحركة العابرة للنقل الجوي، وزيادة الوجهات لأكثر من 250 وجهة دولية، إلى جانب إطلاق ناقل وطني جديد، بما يمكن القطاعات الأخرى مثل الحج والعمرة والسياحة من تحقيق مستهدفاتها الوطنية، وإضافة إلى ذلك ستسعى الإستراتيجية إلى رفع قدرات قطاع الشحن الجوي من خلال مضاعفة طاقته الاستيعابية لتصل إلى أكثر من 4/n/r5 ملايين طن/n/r

وعلى صعيد النقل البحري، قال: إن الإستراتيجية تستهدف الوصول إلى طاقة استيعابية تزيد على 40 مليون حاوية سنوياً، مع ما يعنيه ذلك من استثمارات واسعة في مجال تطوير البنى التحتية للموانئ وتعزيز تكاملها مع المناطق اللوجستية في المملكة، وكذلك توسيع ربطها بخطوط الملاحة الدولية؛ بحيث تتكامل مع شبكات الخطوط الحديدية والطرق، مما يسهم في تحسين كفاءة خطوط منظومة النقل واقتصادياتها/n/r

وأوضح محمد بن سلمان أن الخطوط الحديدية تقدم خدماتها في قطاع نقل الركاب والبضائع عبر شبكة يبلغ طولها 5330 كم، من بينها 450 كم في مسار الخط الحديدي لقطار الحرمين السريع بين مكة المكرمة والمدينة المنورة، الذي يعد أكبر مشروع للنقل عالي السرعة في المنطقة، كما ستحقق الاستراتيجية زيادة في مجموع أطوال السكك الحديدية المستقبلية تقدر بـ 8080 كم تتضمن مشروع «الجسر البري» بطول يتجاوز 1300 كم الذي ستتجاوز طاقته الاستيعابية 3 ملايين مسافر، وشحن أكثر من 50 مليون طن سنوياً، بهدف ربط موانئ المملكة على ساحل الخليج العربي بموانئ ساحل البحر الأحمر، مع فتح فرص جديدة وواعدة لهذا الخط عبر مروره بمراكز لوجستية حديثة، ومراكز للأنشطة الاقتصادية والمدن الصناعية والأنشطة التعدينية، وتحسين مؤشر الأداء اللوجستي للمملكة لتكون ضمن قائمة الدول العشر الأولى على مستوى العالم/n/r

أكد محمد بن سلمان أن الإستراتيجية تستند على ركائز عالية الأهمية، تشمل كذلك شبكة الطرق الكبرى، التي تعد بلادنا الأولى في ترابطها على مستوى العالم، كما ستكون المملكة - بمشيئة الله - من الدول المتقدمة دولياً على صعيد جودة الطرق وسلامتها، حيث تتضمن الإستراتيجية العديد من المبادرات التي تهدف لخفض أعداد ضحايا الحوادث إلى الحد الأدنى؛ أسوة بأفضل التجارب العالمية، وتحقيق كفاءة الربط وتطوير خدمات النقل العام في المدن السعودية بالتوازي مع تحقيق المستهدفات على صعيد الاستدامة والمحافظة على البيئة وتقليل استهلاك الوقود بنسبة 25%، وتوفير حلول ذكية لتسهيل تنقل المسافرين بين المدن ونقل البضائع وفقا لأحدث التقنيات المطبقة عالمياً/n/r

وأشار إلى أن أحد الأهداف الرئيسية للإستراتيجية يتمثل في زيادة مساهمة قطاع النقل والخدمات اللوجستية في إجمالي الناتج المحلي الوطني، فبينما يبلغ إسهام هذا القطاع حالياً في الناتج المحلي الإجمالي للمملكة حوالي 6%، تستهدف الإستراتيجية زيادة إسهامه إلى 10% من خلال تصدر قطاع النقل والخدمات اللوجستية مراتب متقدمة لدعم الاقتصاد الوطني، وتمكين نمو الأعمال وتوسيع الاستثمارات، وزيادة ما يضخه هذا القطاع من إيرادات غير نفطية بشكل سنوي ليصل إلى حوالي 45 مليار ريال في عام 2030م/n/r

البيئة
المقالة الرئيسة: بيئة السعودية
من أجل تعزيز الجهود البيئية القائمة في المملكة العربية السعودية خلال السنوات السابقة وفق رؤية 2030، ورغبة المملكة الجادّة بمواجهة ما عانته من تحديات بيئية تمثلت في ارتفاع درجات الحرارة وانخفاض نسبة الأمطار وارتفاع موجات الغبار والتصحر، وكجزء من جهودها لتعزيز الصحة العامة ورفع مستوى جودة الحياة للمواطنين والمقيمين فيها، امر الأمير محمد بإعادة هيكلة شاملة لقطاع البيئة، وتأسيس القوات الخاصة للأمن البيئي في عام 2019م، ورفع نسبة تغطية المحميات الطبيعية من 4% إلى ما يزيد عن 14% وزيادة الغطاء النباتي في المملكة بنسبة 40% خلال الأربع سنوات الاخيرة، مما مكن السعودية من الوصول لأفضل مستوى الانبعاثات الكربونية للدول المنتجة للنفط/n/r

خلال فترة ترأس المملكة لمجموعة العشرين لعام 2020، وانطلاقاً من دورها تجاه القضايا الدولية المشتركة، واستكمالاً لجهودها لحماية كوكب الأرض الذي نتج عنه إصدار إعلان خاص حول البيئة وتبني مفهوم الاقتصاد الدائري للكربون، وتأسيس أول مجموعة عمل خاصة للبيئة فيها، وإطلاق مبادرتين دولية للحد من تدهور الأراضي وحماية الشعب المرجانية/n/r

في مارس 2021، أعلن ولي العهد السعودي عن مبادرتين، تتمثل في «مبادرة السعودية الخضراء»، و«مبادرة الشرق الأوسط الأخضر» اللتين سترسمان توجه المملكة والمنطقة في حماية الأرض والطبيعة ووضعها في خارطة طريق ذات معالم واضحة وطموحة وستسهمان بشكل قوي بتحقيق المستهدفات العالمية من خلال رفع مستوى الغطاء النباتي، وتقليل انبعاثات الكربون، ومكافحة التلوث وتدهور الأراضي، والحفاظ على الحياة البحرية/n/r ومن أبرز مستهدفات هذه المبادرات زراعة 10 مليار شجرة داخل السعودية خلال العقود القادمة، ما يعادل إعادة تأهيل حوالي 40 مليون هكتار من الأراضي المتدهورة، ما يعني زيادة في المساحة المغطاة بالأشجار الحالية إلى 12 ضعف، تمثل مساهمة المملكة بأكثر من 4% في تحقيق مستهدفات المبادرة العالمية للحد من تدهور الأراضي والموائل الفطرية، و1% من المستهدف العالمي لزراعة ترليون شجرة/n/r كما ستعمل على رفع نسبة المناطق المحمية إلى أكثر من 30% من مساحة أراضيها التي تقدر بـ (600) ألف كيلومتر مربع، لتتجاوز المستهدف العالمي الحالي بحماية 17% من أراضي كل دولة، إضافة إلى عدد من المبادرات لحماية البيئة البحرية والساحلية/n/r وأوضح ولي العهد أنه بينما لا يزال هناك الكثير الذي يتوجب القيام به إلا أن المملكة مصممة على إحداث تأثير عالمي دائم وانطلاقاً من دورها الريادي، وفيما يخص «مبادرة الشرق الأوسط الأخضر» أعلن الأمير محمد، أن المملكة ستبدأ العمل مع الدول الشقيقة في مجلس التعاون لدول الخليج العربية والشرق الأوسط، وتسعى بالشراكة مع الأشقاء في دول الشرق الأوسط لزراعة 40 مليار شجرة إضافية في الشرق الأوسط، مبينا أن البرنامج يهدف لزراعة (50 مليار) شجرة وهو أكبر برنامج إعادة تشجير في العالم ، وهو ضعف حجم السور الأخضر العظيم في منطقة الساحل (ثاني أكبر مبادرة إقليمية من هذا النوع)/n/r سيعمل هذا المشروع على استعادة مساحة تعادل (200 مليون) هكتار من الأراضي المتدهورة مما يمثل (5%) من الهدف العالمي لزراعة (1 تريليون) شجرة ويحقق تخفيض بنسبة (2/n/r5%) من معدلات الكربون العالمية/n/r

وفي تصريح له قال ولي العهد: «إنه بصفتنا منتجًا عالميًا رائدًا للنفط ندرك تمامًا نصيبنا من المسؤولية في دفع عجلة مكافحة أزمة المناخ، وأنه مثل ما تمثل دورنا الريادي في استقرار أسواق الطاقة خلال عصر النفط والغاز، فإننا سنعمل لقيادة الحقبة الخضراء القادمة/n/r وأضاف، إن المملكة والمنطقة تواجهان الكثير من التحديات البيئية، مثل التصحر، الأمر الذي يشكل تهديدا اقتصاديا للمنطقة (حيث يقدر أن 13 مليار دولار تستنزف من العواصف الرملية في المنطقة كل سنة)، كما أن تلوث الهواء من غازات الاحتباس الحراري يقدر أنها قلصت متوسط عمر المواطنين بمعدل سنة ونصف سنة»/n/r

وأضاف: إن مبادرة السعودية الخضراء ستعمل كذلك على تقليل الانبعاثات الكربونية بأكثر من 4% من المساهمات العالمية، وذلك من خلال مشاريع الطاقة المتجددة التي ستوفر 50% من إنتاج الكهرباء داخل المملكة بحلول عام 2030م، ومشاريع في مجال التقنيات الهيدروكربونية النظيفة التي ستمحي أكثر من 130 مليون طن من الانبعاثات الكربونية، إضافة إلى رفع نسبة تحويل النفايات عن المرادم إلى 94%/n/r

كما أضاف، «أن حصة إنتاج الطاقة النظيفة في الشرق الأوسط لا يتجاوز اليوم 7%، وأن التقنيات التي تستخدم في إنتاج النفط في المنطقة ليست ذات كفاءة، وستعمل المملكة العربية السعودية مع هذه الدول على نقل المعرفة ومشاركة الخبرات مما سيسهم تخفيض انبعاثات الكربون الناتجة عن إنتاج النفط في المنطقة بأكثر من 60%، مضيفا، بأن هذه الجهود المشتركة ستحقق تخفيضاً في الانبعاثات الكربونية بما نسبته أكثر من 10% من المساهمات العالمية»/n/r

في 23 أكتوبر 2021 أطلق ولي العهد، بصفته رئيسا اللجنة العليا للسعودية الخضراء، النسخة الأولى للمنتدى السنوي لمبادرة السعودية الخضراء في الرياض، الذي يعنى بإطلاق المبادرات البيئية الجديدة للمملكة، ومتابعة أثر المبادرات التي تم الإعلان عنها سابقاً، بما يحقق مستهدفات مبادرة السعودية الخضراء/n/r وأعلن عن إطلاق الحزمة الأولى من المبادرات النوعية في المملكة لتكون خارطة طريق لحماية البيئة ومواجهة تحديات التغير المناخي، وتمثل هذه المبادرات استثمارات بقيمة تزيد على (700) مليار ريال، مما يساهم في تنمية الاقتصاد الأخضر، وخلق فرص عمل نوعية، وتوفير فرص استثمارية ضخمة للقطاع الخاص، وفق رؤية المملكة 2030/n/r

وأكد الأمير محمد بدء المرحلة الأولى من مبادرات التشجير بزراعة أكثر من (450) مليون شجرة، وإعادة تأهيل (8) ملايين هكتار من الأراضي المتدهورة، وتخصيص أراض محمية جديدة، ليصبح إجمالي المناطق المحمية في المملكة أكثر من (20%) من إجمالي مساحتها/n/r

مخطط رحلة عبر الزمن
المقالة الرئيسة: رحلة عبر الزمن
في 7 أبريل 2021 أطلق ولي العهد وبصفته رئيس مجلس إدارة الهيئة الملكية لمحافظة العُلا، الرؤية التصميمية لمخطط «رحلة عبر الزمن»، بهدف إحياء وتأهيل المنطقة الأثرية الرئيسة في العُلا بشكل مسؤول ومستدام، حيث يُعد المشروع محطة رئيسية ضمن برنامج تطوير العُلا وتحويلها إلى وجهة عالمية رائدة للفنون والتراث والثقافة والطبيعة، تحقيقًا لمستهدفات رؤية السعودية 2030/n/r

تعزيز الشراكة مع القطاع الخاص
في 30 مارس 2021، دشن ولي العهد برنامج تعزيز الشراكة مع القطاع الخاص (شريك) هو أحد برامج رؤية السعودية 2030، والذي يهدف لتعزيز الشراكة بين القطاعين الخاص والحكومي، والمساهمة في دعم النمو المستدام للاقتصاد الوطني، وتعزيز مرونة وقدرات الشركات الكبرى إقليميا وعالميا، وتمكين الشركات الوطنية الكبرى من تحقيق أهداف وفرص استثمارية، مع اطلاق ما يصل إلى 5 تريليونات ريال من استثمارات القطاع الخاص حتى عام 2030/n/r وجرى تصميم البرنامج لتقديم الدعم عبر عدد من الركائز تشمل التعاون المالي والنقدي والتشغيلي والتنظيمي واستثمار الأصول/n/r

التنمية المستدامة
دعم بقوة برامج التنمية المستدامة، بمجالاتها المختلفة والتي اشتملت على التنمية الاقتصادية، التنمية الاجتماعية وحماية البيئة/n/r وأطلق الكثير من المشاريع والمبادرات، ففي الطاقة المتجددة، أمر باستخدام مصادر طاقة جديدة صديقة للبيئة، تشتمل على طاقة الرياح، طاقة الهيدروجين، والطاقة الشمسية، والتي عادةً ما تكون أكثر استدامة من مصادر الوقود الأحفوري/n/r وأمر بإنشاء البرنامج الوطني للطاقة المتجددة، والذي بدوره قام بطرح عدة مشاريع في مختلف مناطق المملكة، والتي اشتملت على إنشاء محطات تعمل بالطاقة الشمسية في كل من سدير وسكاكا ورفحاء والمدينة المنورة والفيصلية وجدة ورابغ والقريات، ومحطة تعمل بطاقة الرياح في دومة الجندل، ومحطة تعمل بالطاقة الشمسية الهجينة في ضباء/n/r

الاستراتيجية الوطنية للاستثمار
هي إستراتيجية وطنية أطلقها الأمير محمد في 11 أكتوبر 2021، وتعد أحد الممكنات الرئيسة لتحقيق مستهدفات رؤية السعودية 2030/n/r وستسهم الاستراتيجية في دعم نمو الاقتصاد الوطني وتنويع مصادره ورفع إسهام القطاع الخاص في الناتج المحلي الإجمالي إلى 65%، وتعزيز الاستثمار الأجنبي المباشر إلى 5/n/r7% من الناتج المحلي الإجمالي، وزيادة نسبة الصادرات غير النفطية من 16% إلى 50% من إجمالي الناتج المحلي غير النفطي، وتخفيض معدل البطالة إلى 7%، وتقدُّم المملكة إلى أحد المراكز العشرة الأوائل في مؤشر التنافسية العالمي بحلول عام 2030م، وتشمل الإستراتيجية تطوير خطط استثمارية تفصيلية لعدة قطاعات منها الصناعة، والطاقة المتجددة، والنقل والخدمات اللوجستية، والسياحة، والبنية التحتية الرقمية، والرعاية الصحية/n/r

وتهدف الاستراتيجية إلى رفع صافي تدفقات الاستثمار الأجنبي المباشر إلى 388 مليار ريال سنوياً، وزيادة الاستثمار المحلي ليصل إلى حوالي 1/n/r7 تريليون ريال سنوياً بحلول عام 2030 مما يسهم في ارتفاع نسبة الاستثمار إلى الناتج المحلي الإجمالي للمملكة من 22% في عام 2019م إلى 30% في عام 2030م، وبالتالي نمو الاقتصاد السعودي ليصبح من أكبر 15 اقتصاداً عالميًا/n/r

السياسة الخارجية
يشير مراقبون أن السياسة السعودية في عهد محمد بن سلمان - بصفته وزيرًا للدفاع ووليًا للعهد - التي وصفتها بعض الجهات بـ«الاندفاع والتسرّع»، تعد اليوم «سياسة أكثر جرأة واستقلالية» وواقعية بالنسبة لقضايا المنطقة/n/r فالرياض حسبما يقول المتابعون، «كثّفت كل جهودها من أجل وقف التغلغل الإيراني في المنطقة»، و«لم تتأخّر عن التدخّل العسكري المباشر في اليمن لوقف الحوثيين عن السيطرة على البلد»، إضافة إلى أنّها أصبحت أقرب إلى المقاربة الروسية بالنسبة لملف الأزمة السورية بعدما كانت تطالب الرئيس السوري بشار الأسد بالرحيل من الحكم/n/r من جهة أخرى أصبحت الدبلوماسية السعودية أكثر نشاطا دوليًا، على صعيدين، الأوّل من أجل ما تقول أنّه «مكافحة الجماعات الإسلامية ووقف التطرّف» بـ«نزع الشرعية الدولية عن نشاط تلك المجاميع في العالم» بعدما ضيّقت على القيادات والكوادر المرتبطة بتلك الجماعات في الداخل السعودي، والآخر من أجل «محاصرة إيران لوقف مشروعها التوسعي في المنطقة»/n/r

إيران
المقالات الرئيسة: صراع إيران والسعودية بالوكالة وبرنامج إيران النووي والعلاقات الإيرانية السعودية
من وجهة نظر الباحثين، فإن العلاقة بين المملكة العربية السعودية والجمهورية الإسلامية في إيران شابتها توتّرات عديدة منذ قيام الثورة الإسلامية الإيرانية في العام 1979، حيث رُفِعَ شعار تصدير الثورة إلى المحيط العربي لإيران والتي قابلها دعم خليجي وعربي للعراق طيلة السنوات الثمانية للحرب العراقية الإيرانية، ثم ساءت العلاقة بين البلدين إلى درجة كبرى بُعيد الغزو الأمريكي للعراق في العالم 2003، الذي وُصِفَ بأنّه أثمن هدية أمريكية يمكن أن تقدّم إلى طهران، حيث فكّكت الدولة العراقية وحلّ الجيش العراقي من جانب الولايات المتحدة و«قدّمت بغداد على طبق من ذهب إلى إيران بقرار سحب القوات الأمريكية من العراق» على حد وصف المراقبين، وهو ما اعتبر بحسب محمد بن سلمان «أكبر خطأين اقترفتهما أمريكا في المنطقة»، ومما زاد التوتّرات بين الرياض وطهران، بدايةً استمرار تقديم إيران الدعم العسكري لحزب الله اللبناني الذي يقول أنّه ذراع الولي الفقيه في لبنان، خاصة بعد أحداث 7 أيار 2008، حيث قام الحزب بالزحف العسكري على بيروت، ما وصف بأنّه احتلال للمدينة، حيث عطّل الحياة السياسية في الجمهورية اللبنانية، مرورًا بما يوصف بالتدخّل الإيراني في الدول العربية، خاصة الخليجية منها، وصولًا إلى تدخّل إيران عسكريًا مع حلفائها في الحرب الأهلية السورية من جهة، ومن جهة أخرى تدخل قوات درع الجزيرة في البحرين بقيادة السعودية، لإجهاض ما سُمي بمحاولة إيران لقلب نظام الحكم في مملكة البحرين، غير أن تدهور العلاقة بحسب المتابعين، أخذ منحى دراماتيكيًا جدًا – وخرج من إطار الحرب بالوكالة بين البلدين – منذ قيام حركة أنصار الله الحوثية في اليمن - المدعومة من إيران - في سبتمبر من العام 2014، بمشروع السيطرة على الأوضاع في الجمهورية اليمنية، التي توصف بأنّها خاصرة الجزيرة العربية، قابله تدخل عسكري دولي بقيادة السعودية في اليمن، لصدّ تمدّد الحوثيين في مارس من العام 2015، ما عدَّ أوّل عملية عسكرية سعودية مباشرة، لوضع حدٍّ للتدخّلات الإيرانية في الوطن العربي، حيث برز فيها اسم محمد بن سلمان بصفته وزيرًا للدفاع السعودي، إذ تولّى قيادة قوات التحالف الدولي في إطار عملية عاصفة الحزم، مُشرفًا على الضربة العسكرية الأولى الموجّهة ضد الحوثيين في اليمن، ما صعّد من وتيرة الخلافات بين الجانبين، إلى أن انقطعت العلاقات الدبلوماسية بين البلدين كليًا، على خلفية إحراق البعثات الدبلوماسية السعودية في إيران في بداية العام 2016، وكان - قبلها بشهر تحديدًا - قد انتشر في الإعلام الدولي تقرير مُسرّب من دائرة الاستخبارات الاتحادية الألمانية، تناول السياسة العسكرية السعودية بقيادة محمد بن سلمان في مواجهة إيران، حيث أشير في التقرير إلى ما وُصِفَ بـ«سياسة الدبلوماسية الحذرة» للسعودية قد استُبْدِلت بـ«سياسة تدخّل متسرّعة واندفاعية»، وأضيف في التقرير أن «الرياض في عهد الملك سلمان، أصبحت أكثر اندفاعًا في مواجهة التوسّع الإيراني في المنطقة»، والسياسة السعودية التي وُصِمت في التقرير بـ«الاندفاع»، فسّرها مراقبون بأنّها أصبحت «أكثر جرأة» وأخذت المبادرة والقيادة في شؤون الدفاع عن المنطقة العربية من دون الرجوع إلى الدول الغربية، وهو ما أزعج بعض الدول، في حين رأى آخرون، على رأسهم وزارة الخارجية الإيرانية، أن السياسة السعودية الجديدة أصبحت «متهوّرة» على حد تعبير وزير الخارجية الإيرانية محمد جواد ظريف/n/r وقد استُقْبِلَ في إيران خبرُ تعيين محمد بن سلمان في منصب ولي ولي العهد ثم توليه منصب ولاية العهد في المملكة العربية السعودية بانتقادات وترقّب، وعدَّته إحدى الصحف الرسمية بمثابة إعلان حرب على إيران في المنطقة/n/r وفي سلسلة تصريحات لافتة كشفت عن انعدام نقاط التفاهم بين الرياض وطهران، منذرة بنقل الصراع إلى الداخل الإيراني، قال محمد بن سلمان في 3 مايو 2017: «أن السعوديين لن ينتظروا حتى تصبح المعركة في السعودية»، مضيفًا: «نعمل على أن تكون المعركة لديهم في إيران وليس في السعودية»، ما فُهم على أنّه تهديد سعودي جدّي باستمالة القوميات المضطهدة في إيران، حيث تشكّل القوميات غير الفارسية ما بين أربعين إلى ستين بالمائة من مجموع السكان هناك، حين سُئِلَ عن مدى ما تشكله إيران من خطر على السعودية، قال محمد بن سلمان: «أن إيران لا تشكّل الخطر الأكبر على السعودية»، ذلك أنّها بحسب تعبيره: «ليست منافسا للسعودية»، معتبرًا أن الجيش الإيراني ليس ضمن أقوى خمسة جيوش في العالم الإسلامي، مضيفًا أن الاقتصاد السعودي أكبر من الاقتصاد الإيراني، خاتما حديثه بالقول: «إيران بعيدة جدًا عن أن تكون مساوية للسعودية»، لكنّه أكّد على أن: «إيران هي العدو الأكبر للمنطقة»، لما تمارسه من «إرهاب وتوسّع في البلدان العربية» على حد وصفه، قائلًا أن «الحرب بين السعودية وإيران إذا ما اندلعت ستكون كارثة كبرى»، واصفًا المرشد الأعلى الإيراني علي خامنئي بـ«هتلر الشرق الأوسط الجديد» الذي يجب مواجهته عالميًا، ذلك على خلفية مواجهة التدخّلات الإيرانية في المنطقة، وهي التدخلات التي بنى رئيس الوزراء اللبناني سعد الحريري استقالته عليها في كلمة متلفزة بثت من الرياض في 4 نوفمبر 2017 عبر فيها عن خشيته من الاغتيال، استقالة رفضها الرئيس اللبناني ميشال عون، بينما اتهم الأمين العام لحزب الله حسن نصر الله السعودية بإجباره عليها، وهي اتهامات ردها الحريري في أكثر من مناسبة/n/r وقد دفعت محاولات ولي العهد السعودي التحذير من البرنامج النووي الإيراني، الصراع بين البلدين إلى مرحلة متقدمة على الصعيد الدولي، حيث اتهم مسؤولون إيرانيون ولي العهد السعودي بأنّه وراء قرار الرئيس الأمريكي دونالد ترمب إلغاء الاتفاق النووي الإيراني في 9 مايو 2018، وأضافوا أن تصريحات ولي العهد السعودي حول «المشاريع التوسعية والتخريبية الإيرانية» في المنطقة «مزاعم لا أساس لها من الصحة»، ودعوا القيادة السعودية إلى الاتعاظ مما أسموه «مصير صديقهم وحليفهم صدام»، الرئيس العراقي الذي أعِدم في العراق/n/r


محمد بن سلمان مع الرئيس الأمريكي دونالد ترمب في الرواق الغربي للبيت الأبيض/n/r
وكان محمد بن سلمان في مقابلة له مع قناة سي بي إس نيوز الأمريكية في 16 مارس 2018، قد هدّد بأن تتجه المملكة العربية السعودية إلى تحويل برنامجها النووي المدني إلى برنامج نووي عسكري لإنتاج سلاح نووي فيما لو أقدمت إيران على إنتاج قنبلة نووية/n/r داعيا في مقابلة مع صحيفة الواشنطن بوست في 26 مارس 2018 «الولايات المتحدة الأمريكية إلى وضع قوانين وقواعد للتأكد من عدم إساءة استخدام اليورانيوم المخصّب»، في إشارة منه إلى الاتفاق النووي الإيراني الذي يتيح لإيران الاستمرار في عمليات تخصيب اليورانيوم لمدّ البرنامج النووي الإيراني بالوقود النووي، بالإضافة إلى السماح للإيرانيين بمواصلة البحث والتطوير لإنتاج أجهزة الطرد المركزي، وهو ما عدّ من الجانب السعودي، ثغرة تسمح للإيرانيين بالحصول على التقنية اللازمة لإنتاج السلاح النووي/n/r ثم طالب في مقابلة أجرتها معه صحيفة نيويورك تايمز في 28 مارس 2018، بإلغاء الاتفاق النووي الإيراني فورًا واستبداله بآخر يضمن عدم حصول طهران على أسلحة دمار شامل، مشبّها ذلك الاتفاق بمعاهدة ميونخ، التي عدّها المؤرخون سببًا باشتعال الحرب العالمية الثانية، بعد أن سمحت لألمانيا النازية بقيادة أدولف هتلر بالتوسّع في أوروبا/n/r وبحسب مراقبين، توّجت تحرّكات محمد بن سلمان هذه، باتخاذ الرئيس الأمريكي دونالد ترمب قرار إلغاء الاتفاق النووي في 9 مايو 2018، وهو القرار الذي جاء بعد زيارة طويلة قام بها ولي العهد السعودي إلى الولايات المتحدة، التقى فيها الرئيس الأمريكي في البيت الأبيض في 20 مارس 2018، منتقدًا الاتفاق النووي الإيراني/n/r أعقب الانسحاب الأمريكي من الاتفاق النووي تفجر الصراع الإيراني السعودي في لبنان واليمن حيث أخذ الحوثيون بدعم من حزب الله، يضربون الداخل السعودي بطائرات مسيرة إيرانية، وكانت الهجمات على منشآت أرامكو السعودية في 14 سبتمبر 2019، أكبر ضربة توجه للسعودية، وهي وإن تبنّاها الحوثيون أشارت كل من الحكومتين الأمريكية والسعودية إلى ضلوع إيران فيها، وهو ما أكده التقرير الصادر عن فريق محققي الأمم المتحدة/n/r وأشاد قائد فيلق القدس الإيراني قاسم سليماني في تغريدة له على تويتر بالحوثيين الذين عدّهم فرعًا من فروع حرس الثورة الإسلامية الإيرانية/n/r بعد نحو 111 يومًا وجهت الولايات المتحدة ضربة جوبة لموكب قاسم سليماني حيث قُتل في محيط مطار بغداد الدولي في 3 يناير 2020، في عملية باركتها الخارجية السعودية/n/r وعلى هذه الخلفية من الانقطاع الدبلوماسي والصراع الإقليمي بدأت الدولتان سلسلة مفاوضات برعاية عراقية، انطلقت جولتها الأولى في 9 أبريل 2021 في بغداد، وهي مفاوضات تلاها حديث لولي العهد في 27 أبريل 2021، قال فيه: «إيران دولة جارة، نطمح أن يكون لدينا معها علاقة جيدة /n/r/n/r/n/r وألا تصبح الأوضاع في إيران صعبة، بل العكس نريد أن تكون إيران مزدهرة»، غير أن «الإشكالية هو في السلوك السلبي لطهران في المنطقة، إن كان عبر برنامجها النووي أو الصاروخي أو دعمها لمليشيات خارجة عن القانون»، مشيرًا إلى أن السعودية تعمل مع شركائها الدوليين لإيجاد حلول لهذه الإشكاليات/n/r

الأزمة اليمنية
المقالات الرئيسة: الحرب الأهلية اليمنية (2015-الآن) والتدخل العسكري في اليمن
في سبتمبر 2014، بدأ الحوثيون – بعد خروجهم من معقلهم في صعدة – بالانتشار بشكل سريع في اليمن، فأتمّوا السيطرة على العاصمة اليمنية صنعاء، حيث احتلوا دار الرئاسة هناك، ووضعوا الرئيس اليمني عبد ربه منصور هادي تحت الإقامة الجبرية، ثم أجبروه على تقديم الاستقالة، وأخذوا قرارًا بتعطيل الدستور، زاحفين عسكريًا على مجمل الأراضي اليمنية، وبفرار الرئيس هادي إلى مدينة عدن - التي أعلنها عاصمة مؤقتة - أعلن بصفته رئيسا للجمهورية، التعبئة العسكرية العامة والحرب على الحوثيين، مقدّمًا طلبًا رسميًا باسم الحكومة اليمنية، دعا فيه قوات درع الجزيرة إلى التدخل في اليمن، وهو ما تم من خلال تشكيل تحالف من عدد من الدول العربية باسم التحالف العربي، أطلق عملية عسكرية بقيادة السعودية، تحت مسمّى عاصفة الحزم، قام محمد بن سلمان بالإشراف على الضربة العسكرية الأولى التي وجهت لما تسمى «معاقل الحوثيين» في اليمن/n/r وتشير التقارير إلى ارتفاع نسبة سيطرة قوات الشرعية الحكومية اليمنية على الأراضي اليمنية، من قرابة الصفر في المائة قبل بدء عملية عاصفة الحزم، إلى نسبة ما بين ثمانين إلى خمسة وثمانين في المائة، وهو ما عدّ انتصارا لقوات الشرعية بمساندة التحالف/n/r غير أن منظمات حقوقية دولية لم تخف انتقاداتها للحرب الدائرة في اليمن، حيث وجّهت إلى كل من الحوثيين وطيران التحالف العربي اتهامات بقصف أهداف مدنية، في عمليات، وصفتها بأنّها قد ترقى إلى جرائم حرب، مطالبة المجتمع الدولي بالتحقيق في تلك الأحداث، وقد علّق محمد بن سلمان على بعض تلك التقارير قائلًا أن «الأخطاء واردة في أي عملية عسكرية»، لكنّها إن حدثت من جانب المملكة أو دول التحالف فهي أخطاء غير متعمّدة وغير مقصودة/n/r وكان الحوثيون قد أعلنوا أنّهم يعملون على أن تكون الحرب في اليمن، حرب استنزاف للتحالف، وذلك بعيد إعلان التحالف العربي التدخّل العسكري في الحرب في اليمن، وهي الحرب التي وصفها محمد بن سلمان أن قرار دخولها لم يكن خيارًا بل كان اضطرارًا، وأن الخيارات في اليمن كانت بين «سيئ وأسوأ» على حد وصفه، مضيفًا أن التدخّل هناك حال دون أن ينقسم البلد بين الحوثيين وتنظيم القاعدة/n/r

الأزمة السورية
المقالات الرئيسة: الأزمة السورية والتدخل السعودي في الحرب الأهلية السورية
فيما يتعلق بالأزمة السورية، يقول مراقبون أن محمد بن سلمان فجَّر مفاجئة، حين أعرب عن اعتقاده بقرب انتهاء أجل الصراع في سوريا وببقاء الرئيس السوري بشار الأسد في الحكم مع تضائل فرص تنحيته، في إشارة إلى تغيّر موقف السعودية تجاه الملف السوري، مطالبًا من جهة روسيا بأن يكون لديها نفوذ قوي ومباشر في سوريا، وأن تعمل على تقوية وتمكين النظام السوري لتقليل النفوذ الإيراني، وأن تحافظ دمشق على آيديولوجيتها، وأن يقوّي بشار الأسد نظامه – أمام المد الإيراني– لئلا يصبح الرئيس السوري «دمية بيد إيران» على حد تعبيره، معربًا عن اعتقاده أن مصالح الرئيس السوري هي «ألا يدع الإيرانيين يفعلون ما يريدون فعله (في سوريا)»، ومن جهة أخرى مطالبًا أمريكا بأن تُبقي على وجودها العسكري في الشرق السوري لتقطع الطريق على المشروع الإيراني في المنطقة/n/r جاء حديث ولي العهد السعودي في مقابلة مع مجلة تايم في 30 مارس 2018، عند تواجده في الولايات المتحدة الأمريكية وعقب أيام من لقائه الرئيس الأمريكي ترمب في البيت الأبيض، قائلًا: «لا أعلم إن كان بعض الأشخاص سيغضبون حينما أجيب عن ذلك السؤال، لكنني لا أكذب، أعتقد أن الكذب على الناس أمرٌ مُخزٍ فعلًا، وخصوصًا في العام 2018، حيث يكاد يكون أمرًا مُستحيلًا أن تُخفي شيئًا عن الناس، أعتقد أن (الرئيس السوري) بشار (الأسد) باقٍ في الوقت الحالي، وأن سورية تُمثل جزءًا من النفوذ الروسي في الشرق الأوسط لمدة طويلة جدًا»، مضيفًا: «لا أعتقد أنه سيرحل من دون حرب، ولا أعتقد أنه يوجد أي أحد يريد أن يبدأ هذه الحرب، لما ستحدثه من تعارض بين الولايات المتحدة وروسيا، ولا أحد يريد رؤية ذلك»/n/r وحين سُئِلَ عن رأيه حول فكرة سحب أمريكا لقواتها من سوريا، وهي رغبة الرئيس الأمريكي ترمب، قال محمد بن سلمان: أنّه يعتقد أن على القوات الأمريكية «أن تبقى (في شرق سوريا) على المدى المتوسط على الأقل، إن لم يكن على المدى الطويل، ذلك لأن الولايات المتحدة تحتاج لأن تمتلك أوراقًا للتفاوض وممارسة الضغط»، لافتًا إلى أنه: «في حال إخراج تلك القوات فأنك ستخسر تلك الأوراق، هذا أولًا، أمّا ثانيًا فأنت تحتاج إلى نقاط تفتيش في الممر بين حزب الله (اللبناني) وإيران، لأنك إن أخرجت هذه القوات من شرق سوريا فستخسر نقطة التفتيش تلك، وسيساهم ذلك الممر في تصعيد أمور أخرى في المنطقة»/n/r وفي مارس 2023، بدأت المملكة العربية السعودية محادثات لإعادة سوريا إلى جامعة الدول العربية، وقدمت الدعم الاقتصادي بعد زلزال قهرمان مرعش 2023 في 6 فبراير والذي حدث في سوريا وتركيا/n/r وفي مايو 2023 حضر الرئيس السوري بشار الأسد قمة الجامعة العربية في جدة حيث استقبله محمد بن سلمان فيها/n/r

القضية الفلسطينية
المقالة الرئيسة: القضية الفلسطينية
في حوار له مع مجلة ذا أتلانتيك الأمريكية، نُشِر في 2 أبريل 2018، حول رؤيته للصراع العربي الإسرائيلي ومستقبل العلاقات العربية مع إسرائيل، قال محمد بن سلمان أن المملكة العربية السعودية لا يمكن أن يكون لها أي علاقة مع إسرائيل قبل الوصول إلى سلامٍ عادلٍ ومُنْصِفٍ تُحلُّ بموجبه القضية الفلسطينية في إطار حلِّ الدولتين، كاشفًا عن مخاوف دينية حول مصير المسجد الأقصى في القدس وحول حقوق الشعب الفلسطيني، جاء ذلك في معرض ردّه على سؤال حول «حق الشعب اليهودي في أن تكون له دولة» قائلا:«أعتقد عمومًا أن كل شعب، في أي مكان، له الحق في العيش في بلده المسالم/n/r أعتقد أن الفلسطينيين والإسرائيليين لهم الحق في امتلاك أرضهم الخاصة، لكنّه يجب أن يكون لدينا اتفاق سلامٍ عادلٍ ومُنصفٍ لضمان الاستقرار للجميع ولإقامة علاقات طبيعية بين الشعوب»/n/r وكان ولي العهد السعودي قد وصف قرار الرئيس الأمريكي دونالد ترمب إعلان القدس عاصمة إسرائيل، ونقله السفارة الأمريكية إلى القدس بـ«المؤلم»/n/r ويقول مراقبون أن ولي العهد السعودي حسب هذه الرؤية لا يخرج عن الإجماع العربي حول القضية الفلسطينية، وقد تأكد ذلك من مخرجات القمة العربية في الظهران، التي عُقِدَت بعد هذا اللقاء بأيام، وأطلقَ الملك سلمان بن عبد العزيز عليها اسم «قمة القدس»، إذ تمسّكت القمة برئاسة السعودية بحل الدولتين وفق مبادرة السلام العربية، ينص على أن تكون القدس الشرقية عاصمة لدولة فلسطينية على حدود 1967/n/r

الصين
تعد الصين أكبر شريك تجاري للسعودية وفقًا لإحصاء وكالة الجمارك الصينية لعام 2021، إذ بلغ التبادل التجاري بينهما نحو 87/n/r3 مليار دولار، مقابل 67/n/r1 مليار دولار أمريكي في 2020، بزيادة بلغت 30 في المائة، بينما بلغ حجم التبادل التجاري بين البلدين في عام 2014، نحو 66 مليار دولار أمريكي، وذلك قبل عام من وصول الملك سلمان بن عبد العزيز إلى الحكم/n/r بدأت ملامح التوجه السعودي نحو الشرق والصين تحديدًا تتشكل سريعًا بعد أن حَوّلت الإدارة الأمريكية إبان رئاسة باراك أوباما دفة أولوياتها الإستراتيجية بعيدًا عن الشرق الأوسط والخليج العربي، لتشهد العلاقات السعودية الصينية منذ ذلك الحين تطورًا أخذ بالتصاعد بزيارة الرئيس الصيني للرياض في 19 يناير 2016، حيث رفع الجانبان مستوى العلاقات الثنائية بين البلدين إلى مستوى «الشراكة الإستراتيجية الشاملة»، بعد إعلان رغبتهما المشتركة في توثيق التعاون بينهما ليصل لمستوى أعلى في مختلف المجالات «السياسية والاقتصادية والتجارية والثقافية والإنسانية والعسكرية والأمنية والطاقة وعلى المستويين الإقليمي والدولي»/n/r وعُززت العلاقات أكثر بزيارة الأمير محمد بن سلمان للصين على رأس وفد حكومي من 300 شخص ضمن أعمال قمة مجموعة العشرين التي انعقدت في مدينة هانغتشو شرقي الصين في 4 سبتمبر 2016، إذ شدّد على أهمية العلاقات السعودية الصينية، في ظل اتساع رقعة المصالح المشتركة بين البلدين وتقارب وجهات نظرهما في الكثير من الشؤون الدولية، مشيرًا إلى أن الاقتصاد والتجارة في البلدين يمكن أن يكمل بعضهما الآخر، وذلك بعد أشهر من إطلاقه لرؤية السعودية 2030، وجائت زيارة الملك سلمان بن عبد العزيز لبكين في 15 يناير 2017 التي رافقه فيها وفد حكومي ضم ألف شخص في مُستهل جولة آسيوية استغرقت شهرًا، ووقعت فيها القيادة السعودية مع القيادة الصينية على اتفاقات بقيمة تجاوزت 65 مليار دولار أمريكي، لتُعمق الشراكة بين البلدين في مسعى وُصِف بالعملي لدمج مبادرة الحزام والطريق مع رؤية السعودية 2030، في حين وُصِفت زيارة محمد بن سلمان إلى بكين في 21 فبراير 2019 بأنها «مواصلة لخلق حقبة جديدة من العلاقات بين البلدين»، حيث وقع الجانبان خلالها على 35 اتفاقية بقيمة تزيد عن 28 مليار دولار أمريكي، وتضمنت خطة لإدراج اللغة الصينية مادة اختيارية في جميع مراحل التعلیم العام والجامعي في السعودية، لزيادة الروابط التجارية والثقافية بين البلدين/n/r وفي ختام زيارته للصين، قال محمد بن سلمان إن: «المملكة العربية السعودية تلتزم بشدة بسياسة الصين الواحدة»، مضيفًا أن «للصين الحق في اتخاذ التدابير لمكافحة الإرهاب والتطرف حماية لأمنها القومي»/n/r وقد رُدَّ هذا التقارب والنمو المطرد للعلاقات بين البلدين إلى التزام الدولتين بمبدأ الاحترام المتبادل للسيادة وعدم الإضرار بسلامة ووحدة أراضيهما وعدم التدخل في السياسات الداخلية لبعضهما البعض وعدم التدخل في القيم المجتمعية لكلا البلدين، ودعمهما للتعددية القطبية وقضية إصلاح مجلس الأمن الدولي/n/r

لم تختزل هذه الزيارات والاتفاقات على الجانب الاقتصادي وحسب، بل اتخذت بعدًا أمنيًا بشأن التعاون في مكافحة الإرهاب، وبعدًا عسكريًا كُشفت بعض جوانبه، ومنها اتفاق سعودي صيني توصل إليه الطرفان في 5 مارس 2022، لبناء مصنع للطائرات دون طيار في السعودية، وصفقات تسليح وفقًا لصحيفة وول ستريت جورنال/n/r وكانت شبكة سي إن إن الأمريكية قد نشرت في 5 يونيو 2019، تقريرًا سريًّا استند على ثلاثة مصادر استخباراتية، يفيد أن السعودية بدأت تطور برنامجها الخاص للصواريخ البالستية بمساعدة صينية، وقد خلصت المعلومات الاستخباراتية الأمريكية إلى أن السعودية وسعت بنيتها التحتية والتقنية للصواريخ البالستية عبر عمليات شراء حديثة من الصين، ورغم أن أهداف البرنامج الصاروخي السعودي لم تتضح في التقارير الاستخباراتية، إلا إن مصدرًا أوضح أن هذه الخطوة تعزز جهودًا محتملة للسعودية لدعم برنامجها النووي العسكري متى ما حازت على رأس نووي حربي، وهي خطوة فُسرت بأنها تنفيذ لتحذيرات أطلقها محمد بن سلمان في مقابلة سابقة له مع قناة سي بي إس نيوز الأمريكية في 16 مارس 2018، حين هدّد بتحويل البرنامج النووي المدني السعودي إلى برنامج نووي عسكري لإنتاج سلاح نووي فيما لو أتيح لإيران إنتاج قنبلة نووية، ولم تؤكد السعودية صحة هذه التقارير إلا إن الصين أعلنت أن شراكتها الإستراتيجية ومنها العسكرية مع الرياض، لا تنتهك أي قانون دولي، وقد دفعت هذه الشراكة بمدير وكالة المخابرات المركزية الأمريكية وليام بيرنز أن يزور السعودية سرًا للاجتماع مع الأمير محمد بن سلمان في محاولة لإصلاح العلاقات الأمريكية السعودية ولبحث مجالات عدة، على رأسها تنامي العلاقات السعودية الصينية في الجانبين الاقتصادي والعسكري، وقد أجري الاجتماع في منتصف أبريل 2022 في جدة، وفقًا لتقرير نشرته صحيفة وول ستريت جورنال في 3 مايو 2022/n/r

الولايات المتحدة
إدارة ترمب
المقالة الرئيسة: قمة الرياض 2017

محمد بن سلمان مع الرئيس الأمريكي دونالد ترمب في المكتب البيضاوي/n/r
توصف العلاقات الأمريكية السعودية بأنّها «تاريخية» و«إستراتيجية» بعد حلف بدأ في العام 1940، إلّا أنّ العلاقات بين البلدين، بحسب المراقبين، شهدت الكثير من التوتّرات الدبلوماسية، إبّان عهد الرئيس الأمريكي باراك أوباما، الذي اتّهم من جانب أطراف خليجية، بأنّه سعى إلى تحسين العلاقات الأمريكية الإيرانية على حساب «العلاقات الأمريكية العربية» و«الأمريكية الخليجية»، ذلك بعد انكشاف المفاوضات السرية بين واشنطن وطهران، والتي أدّت إلى توقيع الاتفاق النووي الإيراني، الذي نال انتقادات واسعة من دول الخليج العربية/n/r وكان الرئيس الأمريكي أوباما، في مقابلة له مع مجلة ذا أتلانتيك الأمريكية، نُشّرت في أبريل 2016، في معرّض ردّه على سؤال، عمّا إذا كانت السعودية دولة صديقة لأمريكا، أجاب: «الأمر معقّد»، مضيفًا: «دول مجلس التعاون الخليجي بحاجة إلى مشاطرة إيران في الشرق الأوسط»، ما فُهِم على أنّه بمثابة ضوء أخضر أمريكي إلى طهران، يمنحها حرية التصرّف دون رادع في المنطقة، ما أدّى إلى تدهور غير مسبوق في «العلاقات الأمريكية السعودية»، وتحوّلها من علاقة كانت توصف بـ«الوثيقة والدافئة»، إلى أخرى «مشحونة»/n/r

إلا أنّ العلاقات، سرعان ما بدأت تعود إلى طبيعتها، بُعيد انتخاب دونالد ترمب رئيسًا للولايات المتحدة الأمريكية، الذي أعلن أكثر من مرة أنّه يريد مكافحة التوسّع الإيراني في الشرق الأوسط، وتمزيق الاتفاقية النووية مع إيران، التي طالما وصفها بأنّها «كارثية»، وهي النقاط التي يرى المراقبون أنّها عادت وجمعت الطرفين الأمريكي-السعودي؛ فأصبح محمد بن سلمان -حين كان وليًا لولي العهد- أوّل مسؤول سياسي عربي يلتقي الرئيس الأمريكي ترمب في البيت الأبيض، في 14 مارس 2017 (بعد تولي الأخير منصب الرئاسة بشهرين)، حيث أقام ترمب مأدبة غداء لمحمد بن سلمان، قائلًا لأعضاء فريقه في البيت الأبيض: «أعتقد أن لدينا شريكًا قويًا»/n/r وقد وُصِفَ الاجتماع بين الرجلين بأنّه «نقطة تحوّل تاريخية في مسار العلاقات بين البلدين»، عكس وجود تطابق كبير في وجهات النظر والأهداف بين المملكة العربية السعودية وأميركا تجاه إيران/n/r وفي 4 مايو 2017، أعلن ترمب من حديقة البيت الأبيض: أن «أوّل محطة خارجية لي كرئيس للولايات المتحدة ستكون إلى السعودية»، حيث حطّت طائرته الرئاسية في الرياض في 20 مايو 2017، لحضور قمة الرياض، التي التقى فيها بالملك سلمان، وشهدا معًا توقيع اتفاقيات بين الجانبين الأمريكي-السعودي، سمّيت بـ«اتفاقية الرؤية الإستراتيجية المشتركة» بحجم استثمارات تجاوزت قيمتها 400 مليار دولار أمريكي، ووصفت بأنّها اتفاقية «تاريخية وغير مسبوقة»/n/r وفي 20 مارس 2018، عاد محمد بن سلمان -بعد أن أصبح وليًا للعهد- إلى زيارة البيت الأبيض ملتقيًا بترمب، مطالبًا من واشنطن بـ«إنهاء الاتفاق النووي فورًا»، وهو ما تم في 9 مايو 2018، بعد قرار الرئيس الأمريكي ترمب انسحاب الولايات المتحدة الأمريكية من الاتفاق النووي، وإعادة العقوبات على إيران/n/r

وتجمع محمد بن سلمان علاقات - توصف بالوثيقة - مع جاريد كوشنر (زوج إيفانكا ترمب، ابنة الرئيس الأمريكي دونالد ترمب)، تعرضت في بعض الأحيان لانتقادات في واشنطن، بسبب «تجاوزها للقنوات الدبلوماسية المعتادة»/n/r

إدارة بايدن
كانت العلاقات بين السعودية وجو بايدن متوترة منذ أن كان نائبًا للرئيس إبّان رئاسة باراك أوباما، خاصة بعد أن وصمها بدعم الإرهاب بالتدريب والسلاح والمال من جانب، ومن جانب آخر حين شبه التحالف الأمريكي السعودي بالتحالف الأمريكي السوفيتي إبّان رئاسة ستالين، وهي تصريحات عاد واعتذر عنها لاحقًا واصفًا إياها بأنها «هفوة دبلوماسية» غير مقصودة، ورغم أن الجانبين الأمريكي والسعودي أعلنا طي المسألة، إلا إن العلاقات بين البلدين دخلت منعرجًا حادًا حين وقعت واشنطن وطهران على الاتفاق النووي الذي كان بايدن نصيرًا له ضمن إدارة أوباما، ولم تخف السعودية امتعاضها من هذا الاتفاق، إذ قال الأمير بندر بن سلطان إنه سيُتيح لإيران امتلاك قنبلة ذرية، وسيجعلها «تعيث فسادًا في الشرق الأوسط الذي يعيش بالفعل أجواء كارثية أصبحت إيران فيه لاعبًا رئيسيًا في زعزعة استقرار[ه]»، تزامن ذلك التقارب الأمريكي الإيراني، مع زيارة رسمية للأمير محمد بن سلمان إلى موسكو التقى فيها بالرئيس الروسي فلاديمير بوتين، حيث وقعا على ستة اتفاقيات وصفت بالإستراتيجية منها اتفاقيات نووية، وكتبت صحف سعودية بأن هذا التقارب الروسي السعودي قد جاء في الوقت المناسب وأن «تنويع تحالفات» السعودية لا مناص منه في ظل هذا التحول الأمريكي في المنطقة/n/r

مع مجيء دونالد ترمب إلى البيت الأبيض وانسحابه من الاتفاق النووي، تعهد جو بايدن خلال حملته الرئاسية بالعودة عن قرار الانسحاب الذي وصفه مرارًا «بالخطأ الهائل»/n/r

في 20 نوفمبر 2019، خلال المناظرة الحزبية الديمقراطية الخامسة التي انعقدت في ولاية جورجيا، وجمعت جو بايدن بتسعة مرشحين رئاسيين ديمقراطيين آخرين يهدفون للفوز بترشيح الحزب الديمقراطي لخوض الانتخابات الرئاسية الأمريكية لمنافسة الرئيس دونالد ترمب، قال بايدن في معرض ردّه على سؤال عمّا إذا كان سيفرض عقوبات ضد السعودية على خلفية مقتل الصحفي السعودي جمال خاشقجي، إنه يعتقد أن الأخير قد قُتِل بناءً على أوامر الأمير محمد بن سلمان، معلنًا بصريح العبارة أنه يتعهد بـ«وقف بيع السلاح للسعودية، وبمعاقبتها وجعلها دولة منبوذة كما هو واقع حالها وإنهاء أي تعاون أمريكي سعودي»، مضيفًا أن السعودية «بلا قيمة حضارية»/n/r

وقد تضررت العلاقات الأمريكية السعودية بشكل كبير منذ وصول بايدن إلى البيت الأبيض، فبعد أقل من شهر من مراسم تنصيبهِ رئيسًا للولايات المتحدة، أعلنت المتحدثة باسم البيت الأبيض جينيفر بساكي في 16 فبراير 2021، أن الرئيس الأمريكي جو بايدن يعتزم إعادة تقييم العلاقات الأمريكية مع السعودية، وأنه سيتواصل مع الرياض مباشرة مع الملك سلمان بن عبد العزيز فقط دون ولي العهد الأمير محمد بن سلمان، مشيرة إلى عدم وجود أي خطط لاتصال بالسعودية، وهو ما شكل إعلانًا لبدء تنفيذ وعود بايدن الانتخابية، وهو إعلان عاد وأكد عليه الرئيس الأمريكي جو بايدن في مقابلة له مع شبكة يونيفزيون بُثت في 27 فبراير 2021، حيث قال: «تحدثت مع الملك أمس وليس مع ولي العهد وأخبرته بوضوح أن القواعد تتغير، وأن واشنطن ستعلن عن تغييرات كبيرة في العلاقات الأمريكية-السعودية»، وجاء هذا الاتصال في 26 فبراير 2021، في اليوم الذي أمر فيه بايدن وكالة المخابرات المركزية بنشر تقييمها بشأن مقتل الصحفي السعودي جمال خاشقجي/n/r غير أن الإدارة الأمريكية ممثلة بوزير الخارجية أنتوني بلينكن، ومستشار الأمن القومي جيك سوليفان، ما لبثت أن اجتمعت في 6 يوليو 2021، بنائب وزير الدفاع السعودي الأمير خالد بن سلمان آل سعود في اجتماعات عدة له خلال زيارته للولايات المتحدة، وذلك بعد أشهر معدودات من وصول الرئيس الأمريكي جو بايدن إلى البيت الأبيض/n/r وفي 27 سبتمبر 2021، أوفد الرئيس الأمريكي جو بايدن مستشاره للأمن القومي جيك سوليفان للقاء محمد بن سلمان، وهو أعلى مسؤول أمريكي يصل إلى السعودية بعد ثمانية أشهر من تنصيب بايدن، وقد زعمت صحيفة وول ستريت جورنال في 19 أبريل 2022، بعد أكثر من ستة أشهر من الاجتماع، أن الأمير محمد بن سلمان أنهى الاجتماع بعد أن «صرخ» في وجه المسؤول الأمريكي ما إن تطرق لحادثة مقتل الصحفي السعودي جمال خاشقجي، مشيرة إلى قول الأمير: «إنه لا يرغب أبدًا في مناقشة الحادثة مرة أخرى، وعلى الولايات المتحدة أن تنسى مطالبها في زيادة إنتاج النفط»، إلا إن المتحدثة باسم مجلس الأمن القومي الأمريكي «أدريان واتسون» نفت مناقشة إنتاج النفط مع الأمير محمد، مشيرة إلى أن الاجتماع لم يتخلله «صراخ»، وهو ما أكده مسؤول إعلامي سعودي عامل في السفارة السعودية بواشنطن/n/r

وفي حوار له مع مجلة ذا أتلانتيك الأمريكية، نُشِر في 3 مارس 2022، قال الأمير محمد بن سلمان بإنه «ببساطة لا يتهم» إن كان الرئيس الأمريكي قد أخذ صورة خاطئة عنه، مضيفًا أن «الأمر متروك له في التفكير في مصالح أمريكا»، وقد نقلت وكالة بلومبرغ الأمريكية عن مسؤولين أمريكيين قولهم إن إدارة الرئيس جو بايدن تبحث في مدى جدية تصريحات ولي العهد السعودي، إن كانت «مجرد كلام أم تحولًا حقيقيًا في السياسة السعودية»/n/r

وفي أعقاب الغزو الروسي لأوكرانيا، عاد وطلب الرئيس الأمريكي من السعودية زيادة إنتاج النفط، إلا إن الرياض لم تتجاوب مع هذه المطالب، وضمن هذا الأخبار زعمت صحيفة وول ستريت جورنال في 8 مارس 2022، وفقًا لمسؤولين في الولايات المتحدة والشرق الأوسط، أن البيت الأبيض حاول ترتيب مكالمات بين الرئيس جو بايدن والأمير محمد بن سلمان والشيخ محمد بن زايد، ضمن مساعي واشنطن لاحتواء ارتفاع أسعار النفط، لكن «دون جدوى» حيث رفض ولي عهد السعودية وولي عهد أبو ظبي الحديث مع الرئيس الأمريكي، وقالت الصحيفة الأميركية إن المسؤولين السعوديين والإماراتيين أصبحوا أكثر صراحة في الأسابيع الأخيرة في «انتقاداتهم للسياسة الأميركية في الخليج [العربي]»، بينما وصف مدير برنامج الطاقة والخليج في معهد واشنطن، سايمون هندرسون، الموقف الخليجي بأنه «أمر غير عادي»، قائلًا: «يبدو أن محمد بن سلمان ومحمد بن زايد غاضبان من واشنطن»، لكن المتحدثة باسم مجلس الأمن القومي في البيت الأبيض، إميلي هورن، وصفت التقرير بأنه «لا يعكس الحقيقة»/n/r

وفي 15 مارس 2022، زعمت صحيفة وول ستريت جورنال في تقرير جديد لها أن السعودية تجري محادثات مع الصين، لبيع بعض منتجاتها النفطية بعملة اليوان الصيني، مما عُدَّ تحولًا آخر وُصِف ب«الدراماتيكي» من قبل أكبر دولة مصدرة للنفط في العالم، وضربة قاتلة لسيادة الدولار الأمريكي في النظام المالي العالمي، حيث يسيطر اليوم على 80 في المائة من مبيعات النفط العالمية، بقيمة مقدرة يمكن أن تبلغ خلال عام 2022 نحو 2/n/r6 تريليون دولار أمريكي، وهي سيطرة فتحت السعودية الأبواب عليها منذ أن حددت الدولار عملة رسمية للمبيعات النفطية في العام 1974، في اتفاقية أبرمت في عهد إدارة الرئيس ريتشارد نيكسون، شملت ضمانات أمنية أمريكية للمملكة، وهو اتفاق ساهم في ترسيخ المكانة العالمية للدولار الأمريكي، بوصفها عملة مفضلة ومهيمنة بين احتياطات النقد الأجنبي حول العالم/n/r ووفقًا لمراقبين، فإن هذه المزاعم إن صحت فستؤذن بانتهاء عصر البترودولار، وهي مؤشر لعمق التدهور الكبير للعلاقات الأمريكية السعودية، التي وُصِفت إثر هذه التقارير بأنها قد بلغت «أدنى مستوياتها منذ عقود»، حيث كتبت صحيفة وول ستريت جورنال في 19 أبريل 2022 تقريرًا عن هذا التدهور، عنونته بـ«كيف وصلت العلاقات السعودية الأمريكية إلى هذا المستوى؟»، تزامن ذلك مع زيارة غير معلنة أو مجدولة لمدير وكالة المخابرات المركزية الأمريكية وليام بيرنز إلى السعودية حيث اجتمع بعيدًا عن وسائل الإعلام مع الأمير محمد بن سلمان في محاولة لإصلاح العلاقات الأمريكية السعودية ولبحث مجالات عدة، على رأسها تنامي العلاقات السعودية الصينية في الجانبين الاقتصادي والعسكري، وقد أجري الاجتماع في منتصف أبريل 2022 في جدة، وفقًا لتقرير نشرته صحيفة وول ستريت جورنال في 3 مايو 2022/n/r

تلا زيارة وليام بيرنز، زيارة أخرى غير معلنة للرياض أجراها اثنان من كبار مستشاري الرئيس الأمريكي جو بايدن في 24 مايو 2022، للتفاهم حول موضوعات مشتركة عدة من بينها زيادة إنتاج النفط، وقد سُرّبت أخبار زيارة المستشارين في 25 مايو 2022 لموقع «أكسيوس» الأمريكي، حيث أفادت المصادر أن كل من المبعوث الأمريكي الخاص للشرق الأوسط وشمال أفريقيا بريت ماكغورك ومبعوث الطاقة بوزارة الخارجية الأميركية «آموس هوشتاين» لا يزالان في المملكة، معلنة لأوّل مرة عن وجود نية محتملة لبايدن في زيارة المملكة العربية السعودية للقاء الملك وولي العهد ضمن رحلته المخطط لها إلى الشرق الأوسط في نهاية شهر يونيو 2022، إلا إن المصادر الأمريكية ربطت مجيء الرئيس الأمريكي بضرورة التوصل إلى اتفاق حول تلك التفاهمات/n/r ولم تصدر أي بيانات رسمية من الجانبين، وظلت الأنباء حول زيارة بايدن للسعودية غير مؤكدة، حتى حين أعلن البيت الأبيض في 3 يونيو 2022 عن تأجيل الرحلة الرئاسية إلى شهر يوليو 2022، إلى أن صدر بيان من الديوان الملكي السعودي في 14 يونيو 2022، أعلن فيه عن زيارة رسمية مرتقبة للرئيس الأمريكي للمملكة العربية السعودية ما بين 15 و16 يوليو 2022، وقد كتب الرئيس الأمريكي جو بايدن مقالًا في صحيفة الواشنطن بوست بعنوان «لماذا سأذهب إلى السعودية العربية؟»، نُشر في 9 يوليو، قبل أيام على وصوله للسعودية، يبرر فيه قراره في زيارة المملكة، في حين وصفت سفيرة خادم الحرمين الشريفين في الولايات المتحدة الأميرة ريما بنت بندر بن سلطان آل سعود، زيارة بايدن للسعودية بالمحورية، معلنة أن العلاقات الأمريكية السعودية تدخل مرحلة جديدة، مشيرة إلى أن «عهد النفط مقابل الأمن قد ولى منذ أمد بعيد» وذلك عبر مقال نشرته في صحيفة بوليتيكو في 14 يوليو 2022/n/r

وما إن حطت الطائرة الرئاسية الأمريكية في مطار الملك عبد العزيز في جدة، حتى بدت مظاهر الفتور وقلة الحماس جلية في استقبال الرئيس الأمريكي بايدن الذي وجد نفسه أمام أمير منطقة مكة المكرمة خالد الفيصل بن عبد العزيز آل سعود والأميرة ريما بنت بندر آل سعود، خلافًا لما حظي به الرئيس الأمريكي السابق دونالد ترمب من حفاوة وترحيب عند زيارته للمملكة في عام 2017/n/r وتنص المراسم الملكية السعودية على: «أن يكون أمير المنطقة أو نائبه في استقبال الزائر الضيف على مستوى القادة إذا كانت زيارة الأخير بناء على رغبته، أما إذا جاءت تلبية لدعوة من الملك أو ولي العهد فيكون الداعي في استقبال الضيف»، وهو ما سجلته وسائل الإعلام العالمية في وقت لاحق حين حضر محمد بن سلمان شخصيًا في المطار لاستقبال قادة الدول الخليجية والعربية المشاركين في قمة جدة/n/r وقد تحرك موكب الرئيس الأمريكي إلى قصر السلام، حيث استقبله ولي العهد محمد بن سلمان بعد أن تبادلًا التحية بقبضة اليد منهيًا بذلك مقاطعته للأمير لتصبح الصورة الأشهر في رحلة الرئيس الأمريكي للمنطقة، ثم التقى بايدن بالملك سلمان بحضور ولي العهد/n/r ورغم أن بايدن قد أعلن في 17 يونيو 2022 أنه لن يعقد اجتماعًا ثنائيًا مع محمد بن سلمان، إلا إنه فعل/n/r

الجماعات الإسلامية
المقالات الرئيسة: الإخوان المسلمون وتنظيم القاعدة وتنظيم الدولة الإسلامية في العراق والشام
في عدد من اللقاءات الصحفية في الولايات المتحدة، شن محمد بن سلمان – ما وُصِف بأنّه – الهجوم الأكبر على الجماعات الإسلامية، أبرزها تنظيم الإخوان المسلمين، الذين عدّهم ثالث أضلاع «مثلث الشر في العالم، إلى جانب كل من إيران والجماعات الإرهابية» على حد تعبيره، مضيفًا أن مثلث الشر يريد السيطرة على العالم عبر أيديولوجيا متطرفة، بقوله: «هذا المثلث يروج لفكرة أن الله والدين الإسلامي لا يأمرنا بنشر الرسالة فقط، بل بناء إمبراطورية يحكمونها بفهمهم المتطرف»، مؤكدًا: «المملكة العربية السعودية ومصر والأردن والبحرين وعمان والكويت والإمارات العربية المتحدة واليمن، تدافع عن فكرة أن الدول المستقلة يجب أن تركز على مصالحها وبناء علاقات جيدة على أساس مبادئ الأمم المتحدة، فيما مثلث الشر لا يريد القيام بذلك»/n/r وكان محمد بن سلمان قد قال أن: «كل إرهابي إن بحثنا في بداياته، لابدّ أنّه كان إخوانيًا، أسامة بن لادن زعيم تنظيم القاعدة وأيمن الظواهري من بعده كانا كذلك، أبو بكر البغدادي زعيم الدولة الإسلامية أيضًا»، واصفًا الإخوان المسلمين بـ«حاضنة الإرهابيين» و«الخطر الأعظم الذي يفوق الشيوعية أيام الحرب الباردة ويفوق إرهاب تنظيم القاعدة والدولة الإسلامية وأي أمر شاهدناه خلال آخر مائة عام من التاريخ»، مُحذِّرا من أنّهم (أي جماعة الإخوان) يريدون تحويل القارة الأوروبية إلى «قارة إخوانية» خلال ثلاثين عامًا، ذلك بالعمل على أدلجة المجتمعات الإسلامية في أوروبا وسحبها نحو التطرّف على حد وصفه، ذلك «أنهم يريدون نشر الخلافة (الإسلامية) من خلال استغلال الديمقراطية»، مطالبًا الدول الأوروبية أن تحذو حذو المملكة العربية السعودية وجمهورية مصر والإمارات العربية المتحدة في سنّ قوانين ونظم تجرّم الانضمام إلى جماعة الإخوان المسلمين بصفتها تنظيمًا إرهابيًا عالميًا، وحسبما نُشِر في مجلة التايم؛ فإن ولي العهد السعودي توعّد باجتثاث التطرّف من المملكة العربية السعودية، قائلًا: أنهم (أي السعوديون في المملكة) على الطريق الصحيح، إذ صنّفوا جميع التنظيمات المتطرّفة وفق معايير واحدة لا تستثني أحدًا من المتطرفين، منتقدًا الدول الغربية التي تحارب الإرهاب في العالم وفق معتقداتها بينما تفتح أبوابها أمام المتطرفين من خلال تقديم فرصة الاعتدال والانفتاح في الغرب بينما تتجاهل أفعال هؤلاء الأشخاص خارج الدول الغربية/n/r

وكان محمد بن سلمان قد أعلن عشيّة زيارته إلى الولايات المتحدة في 19 مارس 2018، في مقابلة بثتها شبكة سي بي اس نيوز الأميركية، أن «المدارس السعودية تعرضت لغزو من عناصر جماعة الإخوان المسلمين»، متوعّدا بالقضاء على التشدّد في النظام التعليمي في السعودية بالقريب العاجل على حد وصفه، مضيفًا: «لا توجد دولة في العالم تقبل أن تعرض نظامها التعليمي لغزو من أي جماعة متطرفة»/n/r ويرى مراقبون أن ما تُسمّى بـ«السعودية الجديدة»، التي توصفُ بأن عرّابها هو محمد بن سلمان، تحتاج إلى إحداث قطيعة كليّة مع كل الأفكار التي توصف بالمتطرفة، ويعتقد هؤلاء المراقبون أن إعلان محمد بن سلمان الحرب على تلك الجماعات الإسلامية هو من أجل القيام بكل تلك التحوّلات الاجتماعية والاقتصادية الجذرية التي يريد تنفيذها في السعودية في إطار رؤية السعودية 2030/n/r وكان المكتب العام لجماعة الإخوان المسلمين أصدر بيانا شن فيه هجومًا وصف بالعنيف ردًا على تصريحات ولي العهد السعودي بحق الجماعة، واعتبر البيان أن ما جاء في تلك التصريحات «كذب وافتراء»، وأن الجماعة «شاركت بكل صدق في بناء المجتمع السعودي»، معتبرًا أن السياسة التي يتّبعها محمد بن سلمان والإجراءات التي يتّخذها ضدهم وفي السعودية «نكوث عن الواجب الديني والقومي»، وهي محاولة برعاية «صهيوأمريكية» لتولي العرش بحسب وصفهم، بينما جاء الرد الإيراني على لسان علي شمخاني أمين عام المجلس الأعلى للأمن القومي الإيراني، إذ قال: «بن سلمان حذف كلمة الشر عن الكيان الصهيوني وألصقها بدول أخرى توفر السلام والاستقرار في المنطقة»/n/r في حين هاجم تنظيم القاعدة في جزيرة العرب محمد بن سلمان في نشرة له، معتبرًا أن سياسات ولي العهد السعودي «نذير هلاك»، محذّرًا من تداعيات ما سمّاه «هذه المصائب» على حد ما جاء في بيان التنظيم/n/r

النشاطات الاجتماعية والخيرية
لمحمد بن سلمان نشاط عديدة في مجال العمل غير الربحي، حيث أسّس مؤسسة خيرية تحمل اسمه وهي مؤسسة محمد بن سلمان الخيرية مسك الخيرية، التي يترأس مجلس إدارتها، والهادفة إلى دعم تطوير المشاريع الناشئة والتشجيع على الإبداع في المجتمع السعودي، كما يرأس مجلس إدارة مركز الملك سلمان للشباب، وهو أيضًا نائب الرئيس ورئيس اللجنة التنفيذية لجمعية الملك سلمان للإسكان الخيري، لتغطية احتياجات أصحاب الدخل المحدود/n/r بالإضافة إلى رئاسته لمجلس إدارة مدارس الرياض/n/r كما كان له مناصب خيرية أخرى سابقة منها:

عضو مجلس أمناء مؤسسة ابن باز الخيرية/n/r
عضو المجلس التنسيقي الأعلى للجمعيات الخيرية بمنطقة الرياض/n/r
عضو مجلس إدارة جمعية البر بمنطقة الرياض/n/r
أول رئيس فخري للجمعية السعودية للإدارة، في الفترة (1435هـ – 1437هـ)/n/r
عضو فخري للجمعية الوطنية الخيرية للوقاية من المخدرات/n/r
رئيس مجلس الأعضاء الفخريين لجمعية الأيادي الحرفية/n/r
أحد مؤسسي جمعية ابن باز الخيرية لتيسير الزواج ورعاية الأسرة/n/r
أسرته
محمد بن سلمان بن عبد العزيز آل سعود متزوج من ابنة عمه سارة بنت مشهور بن عبدالعزيز آل سعود/n/r وله منها خمسة أولاد، هم: سلمان، مشهور، فهدة، نورة، عبد العزيز/n/r

انتقادات
تشير تقارير حقوقية، أن ولي العهد السعودي - رغم الإصلاحات الاقتصادية والاجتماعية التي أجراها ورغم انتهاجه نهجًا جديدا في السعودية، وُصِفَ بالتقدمي - إلا أنّه لم يوقف الاعتقالات التي طالت نشطاء سعوديين كثر، من بينهم سفر الحوالي، عوض القرني، علي العمري، سلمان العودة، ناصر العمر/n/r وبحسب الأنباء فإن الاعتقالات جاءت ضد قيادات مرتبطة بتنظيم الإخوان المسلمين في السعودية، المصنّف إرهابيًا في المملكة، في حين أشار مسؤولون سعوديون أن الاعتقالات جرت لتدفع المملكة إلى «إسلام أكثر اعتدالا»، وهو أحد الوعود التي قطعها محمد بن سلمان، في إطار خطط لتحديث المملكة التي توصف بـ«المحافظة بشدّة»/n/r وأغلب المعتقلين، سبق اعتقالهم، بين فترات مختلفة في السعودية/n/r وأغلب المعتقلين، رجال دين، يعدّون من رموز وقيادات تيار الصحوة في السعودية، وعرفوا بفتاوى متشدّدة، خاصة تجاه الشيعة/n/r وكانت السعودية قد أطلقت حملة في سبتمبر 2017، لمكافحة ما وصفه بـالإرهاب، إذ طلبت من المواطنين والمقيمين فيها بالإبلاغ عن أي «أفكار إرهابية أو متطرفة»، أو أي نشاط «من شأنه تعريض الوحدة الوطنية إلى الخطر»/n/r وكان محمد بن سلمان قد قال أن جماعة الإخوان المسلمين ومن ضمنهم السروريون – وهم قيادات تيار الصحوة – بموجب قوانين السعودية مجرمون، مضيفًا: «حينما نملك أدلة كافية ضد أي أحد منهم، سوف نقاضيهم في المحاكم»/n/r وهو ما يُفسِر هذه الاعتقالات/n/r

وأفادت تقارير لمنظمة هيومن رايتس ووتش أن الاعتقالات لم تستثنِ الناشطات الحقوقيات المدنيَّات، المدافعات عن حقوق المرأة، والداعيات إلى إلغاء نظام ولاية الرجل التمييزي، وإنهاء حظر قيادة المرأة السعودية للسيارة (وهو ما تم بالفعل في يونيو 2018)/n/r وكانت المملكة العربية السعودية، في 26 فبراير 2018، قد دافعت عن سجلّها في حقوق المرأة، أمام لجنة الأمم المتحدة للقضاء على التمييز ضد المرأة (المعروفة بـلجنة سيداو)/n/r بينما رحّبت اللجنة بالإصلاحات التي تبناّها محمد بن سلمان، إلا أنّها حثّت الحكومة السعودية على تسريع جهودها لإلغاء «الأحكام القانونية التي تتطلب تصريح ولي الأمر الذكر لممارسة النساء لحقوقهن»، و«الامتناع عن أي أعمال انتقامية ضد الحقوقيات وأقاربهن» و«ضمان تمكين الناشطات من ممارسة حقوقهن في حرية التعبير وتكوين الجمعيات»/n/r

وكانت سفارة كندا في السعودية، قد نشرت في حسابها على تويتر في 5 أغسطس 2018، تغريدة، عبّرت فيها عن «قلق بالغ» إزاء هذه الاعتقالات، مطالبة من السعودية بـ«الإفراج عنهم فورًا»، وهو ما أدّى إلى قرار السعودية قطع علاقاتها الدبلوماسية والاقتصادية مع كندا، معتبرة سلسلة التغريدات الكندية (تغريدة وزيرة الخارجية الكندية، تغريدة وزارة الخارجية الكندية، تغريدة السفارة الكندية في الرياض) «تدخلًا سافِرًا في الشؤون الداخلية السعودية، وانتهاكا للقواعد الدبلوماسية والبروتوكول»/n/r

من جانب آخر، حملته بعض المنظمات الحقوقية المسؤولية حول مقتل جمال خاشقجي، وهي الحادثة التي وصفها بأنها «جريمة بشعة» يتحمل «المسؤولية الكاملة» عنها، ذلك أنها حدثت من قبل «مسؤولين سعوديين يعملون في الحكومة السعودية»، وهو يرى أنها مسؤولية أدبية لابدَّ له أن يتحملها لكونه قائدًا في السعودية/n/r جاءت تصريحاته تلك في حوار مصوّر مع نورا أودونيل ضمن برنامج 60 دقيقة، بُثَّ على قناة سي بي إس الأمريكية في يوم الأحد 29 سبتمبر 2019/n/r وحين سُئِل عن كيفية حدوث الجريمة دون أن يعلم بها، قال: «البعض يعتقد أنني يجب أن أكون على علم بما يقوم به ثلاثة ملايين شخص يعملون ضمن الحكومة السعودية يوميًا؟ من المستحيل أن يرفع الثلاثة ملايين تقاريرهم اليومية للقائد في المملكة العربية السعودية أو ثاني أعلى رجل في الحكومة السعودية»، مفصحًا أن التحقيقات إن أثبتت تورط أي شخص سوف تحيله للمحكمة، مهما كانت رتبته أو منصبه ضمن الحكومة/n/r وردًّا على التقارير التي اتهمته بالجريمة، منها «استنتاجات» وكالة الاستخبارات المركزية الأميركية، قال: «أتمنى أن تُخرج هذه المعلومات إلى العلن/n/r إذا كانت هناك أي معلومات تتهمني بالقيام بأي عمل، أتمنى أن يتم إخراجها»، مؤكدًا ألا مصلحة للحكومة السعودية بقتل أي صحفي، وهم لا يشكلون أي خطر على المملكة، وأن الخطر الذي يتهدّد السعودية هو من هذه «الجريمة البشعة التي استهدفت صحفي سعودي في قنصلية سعودية»، مضيفًا لا يمكن تصوّر «الألم» الذي صنعته هذه الجريمة، خصوصًا لدى قيادة وحكومة المملكة العربية السعودية/n/r

الزيارات الخارجية
المقالة الرئيسة: قائمة الرحلات الدولية لمحمد بن سلمان آل سعود

الرئيس الروسي فلاديمير بوتين مع الأمير محمد بن سلمان آل سعود في حفل افتتاح كأس العالم 2018
سافر محمد بن سلمان على نطاق واسع حول العالم، مجتمعًا مع سياسيين ومشاهير ورؤساء أعمال/n/r أولها قام بسلسلة زيارات لروسيا والتقى خلال هذه الزيارات بالرئيس الروسي فلاديمير بوتين وعددًا من كبار المسؤولين الروس، أولى هذه الزيارات كان في يونيو 2015، والأخرى في أكتوبر 2015، في منتجع سوتشي جنوب روسيا/n/r أما الزيارة الثالثة لروسيا فكانت في مايو 2017، والزيارة الرابعة كانت في يونيو 2018/n/r كما حضر حفل افتتاح كأس العالم 2018 في موسكو، حيث التقى بشخصيات هامة، مثل: خوان كارلوس فاريلا، نيكولا ساركوزي، سورونباي جينبيكوف، جياني إنفانتينو/n/r

في يونيو 2016، سافر إلى وادي السليكون حيث التقى بشخصيات رئيسية في صناعة التكنولوجيا العالمية في الولايات المتحدة، بما في ذلك مارك زوكربرغ مؤسس موقع فيسبوك/n/r وفي أوائل عام 2018، زار محمد بن سلمان الولايات المتحدة، حيث التقى بالعديد من كبار السياسيين ورجال الأعمال ونجوم هوليود، بما في ذلك الرئيس ترمب، بيل كلينتون، هيلاري كلينتون، هنري كسنجر، مايكل بلومبيرغ، جورج دبليو بوش، جورج بوش الأب، بيل غيتس، جيف بيزوس، أوبرا وينفري، روبرت مردوخ، ريتشارد برانسون، «إيريك غارسيتي» عمدة لوس أنجلوس، مايكل دوغلاس، مورغان فريمان ودوين جونسون/n/r وأشاد الرئيس ترمب بعلاقته مع الأمير محمد/n/r

وفي أغسطس 2016، زار الصين والتقى بالرئيس شي جين بينغ/n/r كما ترأس الوفد السعودي أثناء قمة هانغتشو في الصين في سبتمبر 2016، وخلالها التقى بالعديد من كبار السياسيين، مثل: المستشارة الالمانية أنغيلا ميركل، ورئيس البرازيل ميشال تامر، والرئيس المصري عبد الفتاح السيسي ورئيس فرنسا فرانسوا اولاند، ورئيس وزراء إيطاليا ماتيو رينزي، ورئيسة كوريا الجنوبية باك غن هي، ورئيس كازاخستان نور سلطان، والرئيس التركي رجب أردوغان، ووزير الخارجية الأمريكي جون كيري، والأمين العام للأمم المتحدة بان كي مون/n/r كما زار اليابان في سبتمبر 2016، والتقى بالإمبراطور أكيهيتو، وولي العهد ناروهيتو، ورئيس الوزراء شينزو آبي، والعديد من رجال الأعمال/n/r

ولي العهد السعودي زار أيضًا بعض دول أوروبا الغربية، مثل: المملكة المتحدة، حيث التقى برئيسة الوزراء البريطانية تيريزا ماي، والملكة إليزابيث الثانية والأمير وليم/n/r وفرنسا والتقى بالرئيس إيمانويل ماكرون/n/r وإسبانيا والتقى خلالها بالملك فيليبي السادس، ورئيس الوزراء الإسباني ماريانو راخوي/n/r


صورة محمد بن سلمان على غلاف مجلة تايم
وقام بزيارات عدة للدول العربية، ابرزها: مصر، حيث التقى خلالها بالرئيس عبد الفتاح السيسي، البابا تواضروس الثاني، الإمام أحمد الطيب، مهاب مميش/n/r والأردن، حيث التقى بالملك عبد الله الثاني بن الحسين/n/r والإمارات العربية المتحدة، إذ التقى خلالها بولي عهد أبوظبي محمد بن زايد آل نهيان/n/r والكويت ملتقيًا برئيس مجلس الوزراء جابر مبارك الحمد الصباح، وصباح الخالد الحمد الصباح/n/r كذلك البحرين حيث التقى الملك حمد بن عيسى بن سلمان آل خليفة وولي العهد سلمان بن حمد آل خليفة/n/r وأيضًا تونس والتقى حينها بالرئيس الباجي قائد السبسي/n/r كذلك زار موريتانيا والتقى بالرئيس الموريتاني محمد ولد عبد العزيز/n/r

كما رأس الأمير محمد بن سلمان وفد السعودية في قمة مجموعة العشرين في بوينس آيرس المقام في الأرجنتين وألتقى برؤساء دول مجموعة العشرين/n/r

في ديسمبر 2021، قام الأمير بجولة خليجية، استغرقت خمسة أيام، زار خلالها سلطنة عمان والإمارات وقطر والبحرين والكويت/n/r حيث وصل في 6 ديسمبر إلى سلطنة عمان في زيارة رسمية، التقى فيها جلالة السلطان هيثم بن طارق بن تيمور سلطان عُمان، والذي منحة وسام عُمان المدني من الدرجة الأولى، أحد أرفع الأوسمة العمانية/n/r وفي 7 ديسمبر، وصل إلى دولة الإمارات العربية المتحدة في زيارة رسمية/n/r خلال الزيارة زار معرض إكسبو 2020 دبي، في 8 ديسمبر، زار جناح دولة الإمارات، واطلع على محتواه، ثم زار جناح المملكة الذي يعد ثاني أكبر الأجنحة في المعرض/n/r وفي 8 ديسمبر، وصل إلى دولة قطر في زيارة رسمية، وعقد خلال الزيارة الاجتماع السادس لمجلس التنسيق السعودي القطري/n/r في 9 ديسمبر، وصل إلى مملكة البحرين في زيارة رسمية/n/r وكان في استقباله الملك حمد بن عيسى آل خليفة، ملك مملكة البحرين، وولي العهد، الأمير سلمان بن حمد آل خليفة رئيس مجلس الوزراء/n/r وعُقد خلال الزيارة الاجتماع الثاني لمجلس التنسيق السعودي البحريني/n/r في 10 ديسمبر، وصل إلى دولة الكويت في زيارة رسمية/n/r واستقبله الشيخ نواف الأحمد الجابر الصباح أمير دولة الكويت، في دار يمامة، بحضور الشيخ مشعل الأحمد الجابر الصباح ولي عهد دولة الكويت/n/r وقلّد أمير دولة الكويت الأمير محمد قلادة مبارك الكبير ووسام الكويت تقديراً لما يبذله من جهود ترسخ روابط الإخاء بين البلدين والشعبين، وتعزز أواصر الأخوة والتفاهم بين دول مجلس التعاون الخليجي/n/r

ألقاب وأوسمة وتكريمات حصل عليها
في 13 يونيو 2017، كشفت مجلة فوربس، عن اختيار محمد بن سلمان ضمن قائمة «رائد التغيير العالمي» لعام 2017/n/r وكان محمد بن سلمان، قد حلَّ ضمن الشخصيات الثلاثة الأكثر تأثيرًا لعام 2017، من بين خمسين شخصية مؤثرة في العالم، بحسب القائمة السنوية التي تصدرها مجلة بلومبيرغ/n/r وفي نهاية العام 2017، منحته مجلة تايم الأمريكية، لقب «شخصية العام» لعام 2017 باختيار القراء/n/r وكانت مجلة فوربس الشرق الأوسط، قد منحته - بصفته رئيسًا لمجلس إدارة مركز الملك سلمان للشباب - جائزة شخصية العام القيادية لدعم رواد الأعمال لعام 2013، كذلك اختارته مجلة السياسة الخارجية الأميركية فورين بوليسي، ضمن القادة الأكثر تأثيرًا في العالم، ضمن قائمتها السنوية لأهم مائة مفكِّر في العالم لعام 2015/n/r وحلّ في المركز الثامن عالميًا والأول عربيًا، ضمن قائمة مجلة فوربس الأمريكية، لأقوى 75 شخصية في العالم لعام 2018/n/r

في 25 نوفمبر 2018، منح ملك البحرين حمد بن عيسى بن سلمان آل خليفة، وسام الشيخ عيسى بن سلمان آل خليفة من الدرجة الممتازة إلى ولي العهد الأمير محمد بن سلمان لجهود سموه في دعم وتعزيز العلاقات السعودية البحرينية/n/r وفي 27 نوفمبر من عام 2018، قلّد رئيس الجمهورية التونسية الباجي قائد السبسي ولي العهد الأمير محمد بن سلمان الصنف الأكبر من وسام الجمهورية تقديرًا لجهوده في دعم وتعزيز العلاقات التونسية السعودية/n/r في 18 فبراير 2019، قام الرئيس عارف ألفي بمنح أرفع وسام مدني في دولة باكستان وهو ما يسمى «نيشان باكستان» للأمير محمد بن سلمان، تقديرا لزيارته/n/r

في 3 مارس 2021، منحت جامعة الدول العربية، شهادة تقدير درع العمل العربي التنموي للأمير محمد، تقديراً للإنجازات التنموية الشاملة والكبيرة التي حققها على مختلف المجالات في المملكة، نتيجة للتشريعات الاقتصادية والاجتماعية، والأنظمة الحقوقية والعدلية، والبرامج التنموية التي توالى إصدارها واعتماد العمل بها، مما أحدث تغيراً إيجابياً سريعاً وشاملاً على خطة التنمية في المملكة/n/r

في 7 ديسمبر 2021، منح سلطان عمان هيثم بن طارق وسام عُمان المدني من الدرجة الأولى، أرفع الأوسمة المدنية العمانية، إلى ولي العهد الأمير محمد بن سلمان «اعتزازاً بالروابط الأخوية والعلاقات الممتازة والتعاون البناء» أثناء زيارته للسلطنة/n/r وفي اليوم ذاته، ونيابة عن رئيس دولة الإمارات العربية المتحدة، قدّم له ولي عهد أبوظبي محمد بن زايد آل نهيان وسام زايد من الدرجة الأولى «تقديرا وتعبيرا عن الاعتزاز بعمق العلاقات الثنائية الراسخة وما يجمع البلدين من روابط تاريخية وطيدة»/n/r

في 10 ديسمبر 2021، منح أمير الكويت الشيخ نواف الأحمد الجابر الصباح قلادة مبارك الكبير ووسام الكويت، إلى ولي العهد الأمير محمد بن سلمان عند استقباله في دار يمامة بحضور ولي عهد الكويت الشيخ مشعل الأحمد الجابر الصباح، وذلك «تقديرًا لإنجازاته المميزة للمملكة وتعزيزه أواصر الأخوة بين البلدين وبين دول مجلس التعاون»/n/r

في 21 يونيو 2022، منح الملك عبد الله الثاني بن الحسين وسام الحسين بن علي، أرفع وسام مدني في المملكة الأردنية، إلى ولي العهد الأمير محمد بن سلمان وذلك «تعميقا وتجسيدا للعلاقات التاريخية المميزة التي تربط البلدين، وبمناسبة زيارة سموه للأردن/n/r»/n/r

أوسمة
  البحرين: وسام الشيخ عيسى بن سلمان آل خليفة من الدرجة الممتازة (25 نوفمبر 2018)/n/r
  تونس: الصنف الأكبر من وسام الجمهورية (28 نوفمبر 2018)/n/r
  باكستان: نيشان باكستان (18 فبراير 2019)/n/r
  عمان: وسام عُمان المدني من الدرجة الأولى (7 ديسمبر 2021)/n/r
  الإمارات العربية المتحدة: وسام زايد من الدرجة الأولى (7 ديسمبر 2021)/n/r
  الكويت: قلادة مبارك الكبير ووسام الكويت (10 ديسمبر 2021)/n/r
  الأردن: وسام الحسين بن علي (21 يونيو 2022)/n/r
أماكن وأشياء سُمِّيَت باسمه
محمية الأمير محمد بن سلمان
مدينة الأمير محمد بن سلمان غير الربحية
سند محمد بن سلمان
مؤسسة محمد بن سلمان
طريق الأمير محمد بن سلمان (الشميسي - الحرم)
مشروع محمد بن سلمان لتطوير المساجد التاريخية
كلية الأمير محمد بن سلمان للإدارة وريادة الأعمال
مركز الأمير محمد بن سلمان العالمي للخط العربي
مركز محمد بن سلمان لعلوم وتقنيات المستقبل
دوري الأمير محمد بن سلمان للدرجة الأولى
جائزة الأمير محمد بن سلمان للتعاون الثقافي بين السعودية والصين
مناصب محمد بن سلمان
مناصب محمد بن سلمان
سبقه
سلمان بن عبد العزيز آل سعود	ولي العهد ورئيس مجلس الوزراء
2022 - حتى الآن

تبعه
ما يزال في المنصب
سبقه
محمد بن نايف	ولي العهد
2017 - حتى الآن

تبعه
ما يزال في المنصب
سبقه
محمد بن نايف	رئيس مجلس الشؤون السياسية والأمنية
2017 - حتى الآن

تبعه
ما يزال في المنصب
سبقه
محمد بن نايف	وليُّ وليِّ العهد
2015 - 2017

تبعه
شاغر
سبقه
سلمان بن عبد العزيز آل سعود	وزير الدفاع
2015 - 2022

تبعه
خالد بن سلمان آل سعود
سبقه
لا يوجد	رئيس مجلس الشؤون الاقتصادية والتنمية
2015 - حتى الآن

تبعه
ما يزال في المنصب
سبقه
سعود بن نايف بن عبد العزيز	رئيس ديوان سمو ولي العهد المستشار الخاص لسموه
2013 - 2015

تبعه
حمد بن عبد العزيز السويلم
سبقه
خالد بن عبد العزيز التويجري	رئيس الديوان الملكي
2015 - 2015

تبعه
حمد بن عبد العزيز السويلم
المراجع
 https://www/n/rvision2030/n/rgov/n/rsa//n/r
 https://www/n/rpresident/n/rgov/n/rua/documents/8602023-49389/n/r
 https://time/n/rcom/collection/most-influential-people-2018/5217538/crown-prince-mohammed-bin-salman//n/r
 ترجمة محمد بن سلمان (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 19 سبتمبر 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 قصة السعودية مع الوزراء الثلاثينيين (محفوظ) (بالعربية)/n/r (الرابع من فبراير 2015)/n/r
 اختيار سمو الأمير محمد بن سلمان ولياً لولي العهد (محفوظ) (بالعربية)/n/r (29 نيسان (أبريل) 2015)/n/r
 مسيرة محمد بن سلمان/n/r/n/r ولي العهد (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 الروابط الأسرية بين آل سعود وآل حثلين (محفوظ) (بالعربية)/n/r (الأوّل من أغسطس 2008)/n/r
 ترجمة محمد بن سلمان (محفوظ) (بالعربية)/n/r (23 يناير 2015)/n/r
 صدور أوامر ملكية إضافة أولى (محفوظ) (بالعربية)/n/r (29 نيسان (أبريل) 2015)/n/r
 صدور حزمة من الأوامر الملكية: محمد بن نايف وليًا للعهد ومحمد بن سلمان وليًا لولي العهد (محفوظ) (بالعربية)/n/r (29 نيسان (أبريل) 2015)/n/r
 أمر ملكي: إعفاء محمد بن نايف ومحمد بن سلمان ولياً للعهد (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 تعيين محمد بن سلمان وليا للعهد ذروة ثورة في قيادة السعودية (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 أميركيون: هكذا ستصبح السعودية تحت حكم بن سلمان (محفوظ) (بالعربية)/n/r (22 يونيو 2017)/n/r
 صدور أمر سامٍ بالسماح للمرأة بقيادة السيارة (محفوظ) (بالعربية)/n/r (26 سبتمبر 2017)/n/r
 ماذا يعني السماح الآن للمرأة السعودية بقيادة السيارات؟ (محفوظ) (بالعربية)/n/r (27 سبتمبر 2017)/n/r
 السماح للنساء بالدخول إلى الملاعب الرياضية بدءًا من 2018 في الرياض وجدة والدمام (محفوظ) (بالعربية)/n/r (29 أكتوبر 2017)/n/r
 محمد بن سلمان: سنقضي على التطرف/n/r/n/r/n/r وسنعود إلى الإسلام الوسطي (محفوظ) (بالعربية)/n/r (25 أكتوبر 2017 / العدد:14211)/n/r
 محمد بن سلمان: سندمر التطرف ونعيش حياة طبيعية (محفوظ) (بالعربية)/n/r (24 أكتوبر 2017)/n/r
 هل ينجح بن سلمان في إقصاء الفكر المتشدد في السعودية؟ (محفوظ) (بالعربية)/n/r (29 سبتمبر 2017)/n/r
 محمد بن سلمان: سنتخلص من إدمان النفط/n/r/n/r و«الغرين كارد» ستمكن العرب والمسلمين من العيش في السعودية (محفوظ) (بالعربية)/n/r (25 نيسان (أبريل) 2016)/n/r
 محمد بن سلمان أشرف على الضربة الأولى ضد الحوثيين (محفوظ) (بالعربية)/n/r (26 مارس 2015)/n/r
 الأمير محمد بن سلمان: يجب إلغاء الاتفاق النووي فورًا (محفوظ) (بالعربية)/n/r (28 مارس 2018)/n/r
 محمد بن سلمان: سنطور قنبلة نووية إذا فعلتها إيران (محفوظ) (بالعربية)/n/r (16 مارس 2017)/n/r
 Interview with Muhammad bin Salman (محفوظ) (بالإنجليزية)/n/r (6 يناير 2016)/n/r
 نشطاء: السعودية تعتقل الداعية البارز سفر الحوالي (محفوظ) (بالعربية)/n/r (12 يوليو 2018)/n/r
 السعودية تعتقل رجال دين بارزين لإسكات المعارضة فيما يبدو (محفوظ) (بالعربية)/n/r (12 سبتمبر 2017)/n/r
 السعودية تعتقل نشطاء بتهمة التواصل مع جهات أجنبية مشبوهة (محفوظ) (بالعربية)/n/r (19 مايو 2018)/n/r
 السعودية: اعتقال مدافعات عن حقوق المرأة (محفوظ) (بالعربية)/n/r (19 مايو 2018)/n/r
 محمد بن سلمان شخصية العام باختيار قراء مجلة تايم (محفوظ) (بالعربية)/n/r (الخامس من ديسمبر 2017)/n/r
 فورين بوليسي: محمد بن سلمان ضمن القادة الأكثر تأثيرا (محفوظ) (بالعربية)/n/r (الثاني من ديسمبر 2015)/n/r
 The Leading Global Thinkers of 2015 - Foreign Policy (محفوظ) (بالإنجليزية)/n/r مؤرشف من الأصل في 06 مارس 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 The Worlds Most Powerful People (محفوظ) (بالإنجليزية)/n/r مؤرشف من الأصل في 31 أغسطس 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 ترجمة آل سعود (أمراء الدرعية - أمراء الحجاز - ملوك نجد والحجاز - ملوك السعودية) (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 24 مارس 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 الموافق 22 ربيع الأول 1428هـ
 الموافق 28 ذو الحجة 1430هـ
 الموافق 20 ربيع الثاني 1434هـ
 أمر ملكي: تعيين الأمير محمد بن سلمان بن عبد العزيز رئيسًا لديوان سمو ولي العهد ومستشارًا خاصًا لسمو ولي العهد بمرتبة وزير (محفوظ) (بالعربية)/n/r (الثاني من مارس 2013)/n/r
 أمر ملكي: الأمير محمد بن سلمان رئيساً لديوان ولي العهد ومستشاراً خاصاً لسموه بمرتبة وزير (محفوظ) (بالعربية)/n/r (2 مارس 2018)/n/r
 ترجمة محمد بن سلمان - متجدّدة (محفوظ) (بالعربية)/n/r (23 يناير 2015)/n/r
 أمر ملكي : إعفاء الأمير عبد العزيز بن فهد من منصبه وتعيين الأمير محمد بن سلمان وزير دولة وعضواً في مجلس الوزراء بالإضافة إلى عمله (محفوظ) (بالعربية)/n/r (25 نيسان (أبريل) 2014)/n/r
 خادم الحرمين يختار الأمير محمد بن نايف ولياً لولي العهد ويأمر بتعيينه نائباً ثانياً لرئيس مجلس الوزراء وزيراً للداخلية (محفوظ) (بالعربية)/n/r (23 يناير 2015)/n/r
 صدور أوامر ملكية إضافة رابعة (محفوظ) (بالعربية)/n/r (29 يناير 2015)/n/r
 صدور أوامر ملكية إضافة خامسة (محفوظ) (بالعربية)/n/r (29 يناير 2015)/n/r
 صدور أوامر ملكية إضافة سادسة (محفوظ) (بالعربية)/n/r (29 يناير 2015)/n/r
 الموافق 5 رمضان 1434هـ
 ترجمة محمد بن سلمان (محفوظ)/n/r مؤرشف من الأصل في 28 سبتمبر 2020/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 20208 نوفمبر 2020/n/r
 الأهداف الإستراتيجية (محفوظ)/n/r مؤرشف من الأصل في 5 مايو 2019/n/r
 أوامر ملكية: ولي العهد رئيساً لمجلس الوزراء /n/r/n/r وإعادة تشكيل المجلس برئاسته/n/r أرقام/n/r مؤرشف من الأصل في 2022-09-27/n/r اطلع عليه بتاريخ 2022-09-27/n/r
 ولي العهد السعودي يعقد اجتماعا مع شركة ريثيون لبحث توطين الصناعات العسكرية (محفوظ) (بالعربية)/n/r (الثالث من نوفمبر 2016)/n/r
 ولي العهد في زيارة كبرى إلى أمريكا (محفوظ) (بالعربية)/n/r (18 مارس 2018)/n/r
 محمد بن سلمان يبحث توطين الصناعات العسكرية (محفوظ) (بالعربية)/n/r (17 نوفمبر 2016)/n/r
 ولي ولي العهد السعودي يبحث مجالات توطين الصناعات العسكرية مع شركة لوكهيد مارتن (محفوظ) (بالعربية)/n/r (الأوّل من فبراير 2017)/n/r
 بالأرقام تعرف على شركة الصناعات العسكرية السعودية (محفوظ) (بالعربية)/n/r (20 مايو 2017)/n/r
 محمد بن سلمان: الصناعات العسكرية ستدعم التوطين بنسبة 50% (محفوظ) (بالعربية)/n/r (18 مايو 2017)/n/r
 سمو ولي ولي العهد : إنشاء شركة للصناعات العسكرية سيسهم في جلب استثمارات أجنبية وسيؤثر إيجابا على الناتج الإجمالي للمملكة (محفوظ)/n/r (17 مايو 2017)/n/r
 السعودية تدعم توطين الصناعات العسكرية بإنشاء هيئة متخصصة (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 15 ديسمبر 2019/n/r وصل لهذا المسار في 15 كانون الأوّل (ديسمبر) 2018/n/r
 الإنفاق العسكري السعودي الثالث عالميا في 2017 (محفوظ) (بالعربية)/n/r (الثاني من مايو 2018)/n/r
 ولي العهد يرعى تأسيس مشروع توطين الصناعات العسكرية مع «بوينغ» الأميركية (محفوظ) (بالعربية)/n/r (31 مارس 2018)/n/r
 بماذا عاد بن سلمان إلى السعودية؟ (محفوظ) (بالعربية)/n/r (13 نيسان (أبريل) 2018)/n/r
 ولي العهد يرعى تأسيس مشروع الصناعات العسكرية بنسبة توطين 55% (محفوظ) (بالعربية)/n/r (31 مارس 2018)/n/r
 الشركة السعودية للصناعات العسكرية (SAMI) توقع على تأسيس مشروعين مشتركين لتوطين التصنيع العسكري في المملكة (محفوظ)/n/r (28 يناير 2019)/n/r
 عام / الشركة السعودية للصناعات العسكرية SAMI ومجموعة نافال توقعان مذكرة اتفاق إستراتيجية لتأسيس مشروع مشترك بمجال الدفاع البحري وكالة الأنباء السعودية (محفوظ)/n/r مؤرشف من الأصل في 19 فبراير 2019/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 20202019-02-18/n/r
 اقتصادي / الشركة السعودية للصناعات العسكرية تتعاون مع أل 3 تكنولوجيز في تقنيات الأشعة الكهروضوئية وتحت الحمراء (محفوظ)/n/r مؤرشف من الأصل في 19 فبراير 2019/n/r
 الموافق 26 رمضان 1438هـ
 ٔمر-ملكي-سعودي-محمد-بن-سلمان-وليا-للعهد أمر ملكي سعودي: محمد بن سلمان وليا للعهد (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 بأعلى نسبة تصويت في هيئة البيعة منذ إنشائها : محمد بن سلمان ولياً للعهد (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 31 من 34 بهيئة البيعة اختاروا محمد بن سلمان ولياً للعهد (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 الموافق 1 ربيع الأول 1444 هـ
 أمر ملكي: إعادة تشكيل مجلس الوزراء برئاسة ولي العهد الأمير محمد بن سلمان/n/r مؤرشف من الأصل في 2022-09-27/n/r
 Risk-taking Saudi prince gambling with stability (محفوظ) (بالعربية)/n/r (8 فبراير 2017)/n/r
 Rise of Prince Mohammed bin Salman rattles Saudi Arabia (محفوظ) (بالعربية)/n/r (17 أكتوبر 2016)/n/r
 ولي العهد يتحدث لـ«التايم» الأميركية: نرسم اقتصادنا بناء على مكامن القوة لدينا (محفوظ) (بالعربية)/n/r (29 نيسان (أبريل) 2015)/n/r
 صندوق الاستثمارات يستحوذ على أصول بـ 550 مليار ريال في الشركات السعودية (محفوظ) (بالعربية)/n/r (31 يوليو 2018)/n/r
 صندوق الاستثمارات العامة/n/r/n/r/n/r قاطرة تنويع مصادر الدخل (محفوظ) (بالعربية)/n/r (الرابع من مايو 2017)/n/r
 شراكة يابانية سعودية لاستثمار 100 مليار دولار في تكنولوجيا المستقبل (محفوظ) (بالعربية)/n/r (15 أكتوبر 2016 / السنة:39)/n/r
 أصول صندوق الاستثمارات العامة السعودي تصل إلى 160 مليار دولار بنهاية سبتمبر الماضي (محفوظ) (بالعربية)/n/r (9 أكتوبر 2016)/n/r
 736/n/r3 مليار دولار ثروات السعودية السيادية بنهاية 2016 (محفوظ) (بالعربية)/n/r (20 فبراير 2017 / العدد:5281)/n/r
 616 مليار ريال أصول صندوق الاستثمارات العامة المتوقعة بنهاية 2016 (محفوظ) (بالعربية)/n/r (16 أكتوبر 2016)/n/r
 «صندوق الاستثمارات» يرفع أصوله إلى 224 مليار دولار ويقترب من الـ 10 الكبار (محفوظ) (بالعربية)/n/r (31 أكتوبر 2017)/n/r
 صندوق الاستثمارات العامة يتقدم للمركز الـ12 عالميًا (محفوظ) (بالعربية)/n/r (7 نيسان (أبريل) 2017)/n/r
 صندوق الاستثمارات العامة يقفز إلى المركز الـ 13 عالميا بـ 600 مليار (محفوظ) (بالعربية)/n/r (6 مايو 2016)/n/r
 Public Investment Fund (PIF) - Sovereign Wealth Fund Saudi Arabia - SWFI/n/r www/n/rswfinstitute/n/rorg/n/r مؤرشف من الأصل في 2021-03-30/n/r اطلع عليه بتاريخ 2021-04-14/n/r
 محمد بن سلمان: هناك حقوق للنساء في الإسلام لم يحصلن عليها بعد (محفوظ) (بالعربية)/n/r (23 نيسان (أبريل) 2016)/n/r
 بلومبرغ: 8 ساعات غير مسبوقة مع الأمير محمد بن سلمان (محفوظ) (بالعربية)/n/r (22 نيسان (أبريل) 2016)/n/r
 السعودية ـ إلغاء تدريجي لـالوصاية وإسقاط قيود السفر عن المرأة (محفوظ) (بالعربية)/n/r (31 يناير 2020)/n/r
 السعودية ـ إلغاء تدريجي لـالوصاية وإسقاط قيود السفر عن المرأة (محفوظ) (بالعربية)/n/r (2 أغسطس 2019)/n/r
 الشورى السعودي يدرس إنهاء الولاية على القاصرين ببلوغ الـ18 (محفوظ) (بالعربية)/n/r (9 يوليو 2020)/n/r
 لماذا يشكل ادماج المرأة السعودية في مجتمعها معضلة؟ (محفوظ) (بالعربية)/n/r (30 مايو 2013)/n/r
 لقاء ولي العهد السعودي محمد بن سلمان مع شبكة سي بي إس نيوز الأمريكية (محفوظ) (بالعربية)/n/r (19 مارس 2018)/n/r
 كيف تؤثر قرارات محمد بن سلمان على السعودية؟ (محفوظ) (بالعربية)/n/r (25 ديسمبر 2017)/n/r
 Saudi Arabia women test driving ban (محفوظ)/n/r (17 يونيو 2011)/n/r
 Womens transport: Solutions needed (محفوظ)/n/r (27 يونيو 2009)/n/r
 Saudi Activism Accelerates as Women Dare to Drive (محفوظ)/n/r (18 يونيو 2011)/n/r
 عام / صدور أمر سام باعتماد تطبيق أحكام نظام المرور ولائحته التنفيذية بما فيها إصدار رخص القيادة على الذكور والإناث على حد سواء وكالة الأنباء السعودية (محفوظ)/n/r مؤرشف من الأصل في 18 سبتمبر 2018/n/r وصل لهذا المسار في 26 أيلول (سبتمبر) 2017/n/r
 الملك سلمان يأمر بإصدار رخص قيادة السيارات للمرأة (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 31 ديسمبر 2018/n/r وصل لهذا المسار في 26 أيلول (سبتمبر) 2017/n/r
 شاهد/n/r/n/r إصدار أول رخصة قيادة لسيدة بالسعودية (محفوظ) (بالعربية)/n/r (4 يونيو 2018)/n/r
 محمد بن سلمان: في السابق كنا أكثر مرونة من الآن (محفوظ) (بالعربية)/n/r (1 أبريل 2018)/n/r
 السماح للمرأة السعودية بالسفر دون اشتراط موافقة ولي الأمر (محفوظ) (بالعربية)/n/r (2 أغسطس 2019)/n/r
 السعودية تمضي في طريق إسقاط الولاية عن المرأة (محفوظ) (بالعربية)/n/r (15 يوليو 2019)/n/r
 سقوط جدار برلين السعودي بوقف الولاية على النساء (محفوظ) (بالعربية)/n/r (1 أغسطس 2019)/n/r
 محمد بن سلمان/n/r/n/r السعودية في عز الشباب (محفوظ) (بالعربية)/n/r (11 يونيو 2018)/n/r
 At last Saudi women will be allowed to take the wheel/n/r ذي إيكونوميست/n/r 30 سبتمبر 2017/n/r مؤرشف من الأصل في 2018-05-15/n/r
 الأمير محمد بن سلمان يكشف عن مبادرة لمساواة راتب المرأة بالرجل (محفوظ) (بالعربية)/n/r (19 مارس 2018)/n/r
 محمد بن سلمان: العباءة السوداء ليست شرطا والأهم الحشمة (محفوظ) (بالعربية)/n/r (19 مارس 2018)/n/r
 Saudi Arabia will finally allow women to drive/n/r ذي إيكونوميست/n/r 27 سبتمبر 2017/n/r مؤرشف من الأصل في 2018-03-13/n/r
 عام / صدور ثلاثة أوامر ملكية إضافة ثانية وأخيرة (محفوظ) (بالعربية)/n/r (24 فبراير 2019)/n/r
 من هي أول امراة سعودية تشغل منصب سفيرة في واشنطن؟ (محفوظ) (بالعربية)/n/r (24 فبراير 2019)/n/r
 بعد القرارات الجديدة/n/r/n/r 6 نقاط مهمة للمرأة السعودية (محفوظ) (بالعربية)/n/r (2 أغسطس 2019)/n/r
 السينما تعود للسعودية اليوم بعد انقطاع 40 عامًا (محفوظ) (بالعربية)/n/r (18 نيسان (أبريل) 2015)/n/r
 إنشاء هيئة للترفيه بالسعودية ضمن القرارات الملكية/n/r مجلة سيدتي/n/r 2016-05-07/n/r مؤرشف من الأصل في 5 أكتوبر 2018/n/r اطلع عليه بتاريخ 4 تموز (يوليو) 2017/n/r
 لأول مرة/n/r/n/r هيئة عامة للترفيه بالسعودية (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 16 نوفمبر 2017/n/r وصل لهذا المسار في 4 تموز (يوليو) 2017/n/r
 مجلس الوزراء يوافق على إنشاء هيئة للمتاحف والتراث والأفلام والمكتبات | صحيفة المواطن الإلكترونية/n/r web/n/rarchive/n/rorg/n/r 4 فبراير 2020/n/r مؤرشف من الأصل في 2020-02-04/n/r اطلع عليه بتاريخ 2022-06-15/n/r
 محمد بن سلمان و33 عنواناً عن الرؤية السعودية (محفوظ) (بالعربية)/n/r (25 نيسان (أبريل) 2016)/n/r
 محمد بن سلمان: لن ينجو أي شخص دخل في قضية فساد سواء وزيرا أو أميرا أو أيا كان (محفوظ) (بالعربية)/n/r (2 مايو 2017)/n/r
 السعودية تعلن الحرب على الفساد (محفوظ) (بالعربية)/n/r (4 نوفمبر 2017)/n/r
 السعودية: لجنة عليا برئاسة ولي العهد لمكافحة الفساد (محفوظ) (بالعربية)/n/r (04 نوفمبر 2017)/n/r
 لجنة مكافحة الفساد في السعودية توقف أمراء ووزراء حاليين (محفوظ) (بالعربية)/n/r (5 نوفمبر 2017)/n/r
 السعودية: تجميد حسابات الموقوفين بتهم الفساد (محفوظ) (بالعربية)/n/r (6 نوفمبر 2017)/n/r
 اعتقالات السعودية تصدم الأسواق لكن البعض يعتبرها حملة متأخرة (محفوظ) (بالعربية)/n/r (7 نوفمبر 2017)/n/r
 قيود على الطائرات الخاصة المغادرة من المطارات السعودية (محفوظ) (بالعربية)/n/r (6 نوفمبر 2017 / العدد:14223)/n/r
 «ريتز كارلتون» الرياض يعج بالنزلاء بعد إغلاقه 90 يومًا (محفوظ) (بالعربية)/n/r (12 فبراير 2018 / العدد:14321)/n/r
 محمد بن سلمان: 95% من متهمي الفساد قبلوا بإعادة الأموال/n/r العربية/n/r 24 نوفمبر 2017/n/r مؤرشف من الأصل في 2023-01-30/n/r اطلع عليه بتاريخ 2023-06-18/n/r
 محمد بن سلمان: المرشد الإيراني هتلر جديد في الشرق الأوسط (محفوظ) (بالعربية)/n/r (24 نوفمبر 2017)/n/r
 ما الذي قاله محمد بن سلمان حول إجرءات مكافحة الفساد وحقوق الإنسان في السعودية؟ (محفوظ) (بالعربية)/n/r (25 أكتوبر 2017)/n/r
 محمد بن سلمان: الحملة على الفساد ستعيد أموال الدولة المنهوبة (محفوظ) (بالعربية)/n/r (24 نوفمبر 2017)/n/r
 محمد بن سلمان: سياسة الاسترضاء لا تجدي مع «هتلر إيران» (محفوظ) (بالعربية)/n/r (25 نوفمبر 2017 / العدد:14242)/n/r
 السعودية: حجم التسويات في حملة مكافحة الفساد تجاوز 100 مليار دولار (محفوظ) (بالعربية)/n/r (30 يناير 2018)/n/r
 رئيس هيئة مكافحة الفساد السعودية: نسعى للقضاء على البيروقراطية  (محفوظ) (بالعربية)/n/r (31 أغسطس 2019)/n/r
 محمد بن سلمان: الناتج المحلي غير النفطي مؤشر رئيسي لنجاح خططنا الاقتصادية (محفوظ) (بالعربية)/n/r (12 نوفمبر 2020)/n/r
 عزيمة ولي العهد تحاصر هوامير الفساد  ولصوص الكسب غير المشروع (محفوظ) (بالعربية)/n/r (19 مايو 2020)/n/r
 انتقال الاقتصاد السعودي إلى مرحلة ما بعد النفط (محفوظ) (بالعربية)/n/r (1 ديسمبر 2015)/n/r
 بقيادة ولي العهد /n/r/n/r السعودية تُرسخ منهج مكافحة الفساد /n/r/n/r «لن ينجو من تورط في قضية فساد» (محفوظ) (بالعربية)/n/r (15 نيسان (أبريل) 2020)/n/r
 عام / سمو ولي العهد يُطلق برنامج تنمية القدرات البشرية أحد برامج تحقيق رؤية المملكة 2030/n/r وكالة الأنباء السعودية/n/r 15 أيلول (سبتمبر) 2021/n/r مؤرشف من الأصل في 16 سبتمبر 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 ولي العهد السعودي يطلق برنامجاً لإصلاح التعليم وإعداد المواطن لسوق العمل/n/r موقع قناة الشرق للأخبار/n/r 15 أيلول (سبتمبر) 2021/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Tentative steps in Saudi Arabia: The king of Saudi Arabia shows some reformist credentials/n/r ذي إيكونوميست/n/r 17 فبراير 2009/n/r مؤرشف من الأصل في 2011-06-29/n/r اطلع عليه بتاريخ 2011-07-09/n/r
 Support for shake-up of Saudi justice system/n/r The Financial Times/n/r 4 أكتوبر 2007/n/r مؤرشف من الأصل في 2020-03-08/n/r اطلع عليه بتاريخ 2011-07-10/n/r
 Otto، Jan Michiel (2010)/n/r Sharia Incorporated: A Comparative Overview of the Legal Systems of Twelve Muslim Countries in Past and Present/n/r ص/n/r 161–162/n/r ISBN:978-90-8728-057-4/n/r مؤرشف من الأصل في 2022-06-18/n/r
 Wahhabi Islam: From Revival and Reform to Global Jihad: 100
 Wilson، Peter W/n/r؛ Graham Douglas (1994)/n/r Saudi Arabia: the coming storm/n/r ص/n/r 201/n/r ISBN:1-56324-394-6/n/r
 Saudi to codify Sharia for clarity/n/r Middle East Online/n/r 21 يوليو 2010/n/r مؤرشف من الأصل في 25 يوليو 2010/n/r اطلع عليه بتاريخ 19 يوليو 2011/n/r
 عام / سمو ولي العهد يعلن عن تطوير منظومة التشريعات المتخصصة وكالة الأنباء السعودية/n/r www/n/rspa/n/rgov/n/rsa/n/r مؤرشف من الأصل في 2021-02-09/n/r اطلع عليه بتاريخ 2021-02-08/n/r
 Adnanshabrawi@، عدنان الشبراوي (جدة) (26 أبريل 2020)/n/r مصادر لـ«عكاظ»: لا إعدام للأحداث والقُصّر دون 18 عاما/n/r Okaz/n/r مؤرشف من الأصل في 2020-04-26/n/r اطلع عليه بتاريخ 2020-04-26/n/r
 maryam9902، مريم الصغير (الرياض) (28 أبريل 2020)/n/r «حقوق الإنسان»: إيقاف أحكام الإعدام للأحداث تشمل جرائم الإرهاب/n/r Okaz/n/r مؤرشف من الأصل في 2020-04-28/n/r اطلع عليه بتاريخ 2020-04-28/n/r
 السعودية تلغي عقوبة الجلد/n/r BBC News Arabic/n/r 24 أبريل 2020/n/r مؤرشف من الأصل في 2020-04-24/n/r اطلع عليه بتاريخ 2020-04-24/n/r
 fatimah_a_d@، فاطمة آل دبيس (الرياض) (24 أبريل 2020)/n/r مصادر لـ عكاظ: إيقاف الحكم بالجلد في العقوبات التعزيرية/n/r Okaz/n/r مؤرشف من الأصل في 2020-04-24/n/r اطلع عليه بتاريخ 2020-04-24/n/r
 محمد بن سلمان يعلن عن تطوير منظومة التشريعات المتخصصة/n/r 08-02-2021/n/r البيان/n/r 8 فبراير 2021/n/r مؤرشف من الأصل في 2021-02-08/n/r
 واس، نيوم: (28 ديسمبر 2021)/n/r مجلس الوزراء يقر نظام الإثبات/n/r Watanksa/n/r مؤرشف من الأصل في 2022-06-15/n/r اطلع عليه بتاريخ 2021-12-28/n/r
 مجلس الشورى السعودي يعتمد «الإثبات الرقمي» حجة قانونية/n/r الشرق الأوسط/n/r مؤرشف من الأصل في 2021-12-28/n/r اطلع عليه بتاريخ 2021-12-28/n/r
 محمد بن سلمان: دستورنا هو القرآن ولا مكان للفكر المتطرف بالسعودية/n/r العربية/n/rنت/n/r 28 نيسان (أبريل) 2021/n/r مؤرشف من الأصل في 9 مارس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 السعودية تعيد صياغة علاقة الدين بالدولة/n/r إندبندنت عربية/n/r 30 نيسان (أبريل) 2021/n/r مؤرشف من الأصل في 14 أكتوبر 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Inside the Palace With Mohammed bin Salman (بالإنجليزية)/n/r ذا أتلانتيك/n/r 3 آذار (مارس) 2022/n/r Archived from the original on 3 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 ولي العهد السعودي محمد بن سلمان يتعهد بإعادة (إسلام وسطي معتدل) إلى المملكة (محفوظ) (بالعربية)/n/r (27 أكتوبر 2017)/n/r
 النقد العقائدي - تأليف: عبد الكريم بليل، إصدار: مركز الكتاب الأكاديمي/n/r عام: 2017/n/r صفحة:8/n/r
 الإلكترونية، صحيفة سبق/n/r هذا ما قاله محمد بن سلمان لـالجارديان عن آخر 30 عامًا والتعاليم الجامدة وثورة إيران/n/r صحيفة سبق الإلكترونية/n/r مؤرشف من الأصل في 08 نوفمبر 2017/n/r اطلع عليه بتاريخ 4 تموز (يوليو) 2017/n/r
 محمد بن سلمان: السعودية لم تكن طبيعية بسبب إيران/n/r/n/r وسنعيدها للإسلام المعتدل - اليوم السابع/n/r اليوم السابع (بar-Ar)/n/r 2017-10-25/n/r Archived from the original on 28 ديسمبر 2017/n/r Retrieved 4 تموز (يوليو) 2017/n/r
 Sputnik/n/r بن سلمان يهاجم الثورة الإيرانية ويلومها على هذه الأفكار (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 11 ديسمبر 2019/n/r وصل لهذا المسار في 4 تموز (يوليو) 2017/n/r
 محمد بن سلمان: كانت حياتنا طبيعية/n/r/n/r النساء يقدن السيارات ودور السينما منتشرة (محفوظ) (بالعربية)/n/r (19 مارس 2018)/n/r
 خلال مقابلة تلفزيونية في البرنامج العالمي «60 دقيقة» على شبكة (CBS) الأمريكية - ولي العهد: لن يوقفني عن الإصلاحات إلا الموت (محفوظ) (بالعربية)/n/r (19 مارس 2018)/n/r
 محمد بن سلمان: سندمر الأفكار المتطرفة اليوم وفورًا (محفوظ) (بالعربية)/n/r (24 أكتوبر 2017)/n/r
 محمد بن سلمان: سنقضي على التطرف، وسنعود إلى الإسلام الوسطي (محفوظ) (بالعربية)/n/r (25 أكتوبر 2017 / العدد:14211)/n/r
 العيسى: غزو «الإخوان» النظام التعليمي حقيقة/n/r/n/r ونبذل جهودًا لتخليصه من «شوائب الجماعة» (محفوظ) (بالعربية)/n/r (20 مارس 2018)/n/r
 ماذا تعرف عن مركز الحرب الفكرية السعودي؟ (محفوظ) (بالعربية)/n/r (1 مايو 2017 / العدد:14034)/n/r
 بالتفاصيل /n/r/n/r تعرف على مركز اعتدال الذي دشنه خادم الحرمين مع ترامب لمكافحة الفكر المتطرف (محفوظ) (بالعربية)/n/r (21 مايو 2017)/n/r
 هل تتغيّر الآلية السعودية لمكافحة الإرهاب؟ (محفوظ) (بالعربية)/n/r (9 يناير 2018)/n/r
 الأمير محمد بن سلمان: سنستمر في مواجهة أي تطرف (محفوظ) (بالعربية)/n/r (12 نوفمبر 2020)/n/r
 السعودية تجرِّد هيئة الأمر بالمعروف من صلاحية توقيف الأشخاص/n/r جريدة القبس/n/r 12 نيسان (أبريل) 2016/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 كورونا يعيد الشرطة الدينية في السعودية بـالتوعية بلا وعظ ومطاردات/n/r إندبندنت عربية/n/r 11 نيسان (أبريل) 2020/n/r مؤرشف من الأصل في 29 أكتوبر 2020/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 السعودية تقلص صلاحيات هيئة الأمر بالمعروف/n/r موقع قناة روسيا اليوم/n/r 13 نيسان (أبريل) 2016/n/r مؤرشف من الأصل في 10 مارس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 العاصوف يحيي ذكرى مريرة للسعوديين مع رجال الشرطة الدينية/n/r إندبندنت عربية/n/r 11 نيسان (أبريل) 2022/n/r مؤرشف من الأصل في 18 أبريل 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 وثيقة «رؤية السعودية 2030» - رسالة محمد بن سلمان/n/r 2030 رؤية السعودية/n/r مؤرشف من الأصل في 2023-03-07/n/r اطلع عليه بتاريخ 2023-06-18/n/r
 مجلس الوزراء يوافق على «رؤية السعودية 2030»  (محفوظ) (بالعربية)/n/r (25 نيسان (أبريل) 2016)/n/r
 الموافق : 2 رمضان 1437 هـ/n/r
 مجلس الوزراء يوافق على برنامج التحول الوطني أحد برامج «رؤية السعودية 2030»  (محفوظ) (بالعربية)/n/r (8 مايو 2016)/n/r
 إطلاق برنامج التوازن المالي أحد برامج «رؤية السعودية 2030»  (محفوظ) (بالعربية)/n/r (23 ديسمبر 2016، العدد:1846/صفحة:الثالثة)/n/r
 وثيقة «رؤية السعودية 2030» (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 12 أكتوبر 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 وثيقة «رؤية السعودية 2030» (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 12 أكتوبر 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 وثيقة «رؤية السعودية 2030» - رسالة محمد بن سلمان (محفوظ) (بالعربية)/n/r (7)/n/r
 وثيقة «رؤية السعودية 2030» - رسالة محمد بن سلمان (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 12 أكتوبر 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 محمد بن سلمان: مشروع نيوم/n/r/n/r فرص خيالية ومكان للحالمين (محفوظ) (بالعربية)/n/r (24 أكتوبر 2017)/n/r
 مسؤول سعودي: مصر تتعهد بألف كيلومتر في جنوب سيناء لمشروع مدينة نيوم (محفوظ) (بالعربية)/n/r (5 مارس 2018)/n/r
 محمد بن سلمان في مقابلة مع بلومبيرغ (محفوظ) (بالعربية)/n/r (27 أكتوبر 2017 / العدد:14213)/n/r
 محمد بن سلمان يطلق «نيوم» أول منطقة خاصة تربط السعودية والأردن ومصر (محفوظ) (بالعربية)/n/r (25 أكتوبر 2017)/n/r
 بقيمة 500 مليار دولار/n/r/n/r(نيوم) السعودي (متروبوليس) الشرق الأوسط (محفوظ) (بالعربية)/n/r (25 أكتوبر 2017)/n/r
 تعرف على موقع مشروع نيوم الأكبر بالمنطقة (محفوظ) (بالعربية)/n/r (24 أكتوبر 2017)/n/r
 الفايننشال تايمز : ولي العهد السعودي يبني دافوس على الرمال (محفوظ) (بالعربية)/n/r (28 أكتوبر 2017)/n/r
 محمد بن سلمان يتعهد القضاء على بقايا التطرف في السعودية (محفوظ) (بالعربية)/n/r (20 مارس 2018)/n/r
 ولي العهد السعودي لوكالة رويترز: مدينة نيوم العملاقة الجديدة ستكون مدرجة في الأسواق المالية (محفوظ) (بالعربية)/n/r (26 أكتوبر 2017)/n/r
 نيوم – آن الأوان/n/r/n/r/n/r لنطلق ذا لاين/n/r www/n/rneom/n/rcom/n/r مؤرشف من الأصل في 2021-01-23/n/r اطلع عليه بتاريخ 2021-02-09/n/r
 An Accelerator of human progress/n/r NEOM/n/r مؤرشف من الأصل في 2020-12-08/n/r اطلع عليه بتاريخ 2021-01-10/n/r
 Rashad Aziz El Yaakoubi Marwa (11 Jan 2021)/n/r Saudi Crown Prince launches zero-carbon city in NEOM business zone/n/r Reuters (بالإنجليزية)/n/r Archived from the original on 2021-02-04/n/r Retrieved 2021-02-09/n/r
 عام / سمو ولي العهد يعلن عن تصاميم ذا لاين مدينة المستقبل في نيوم/n/r وكالة الأنباء السعودية/n/r 25 تموز (يوليو) 2022/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 25 تموز (يوليو) 2022/n/r
 محمد بن سلمان يعلن عن أكبر مدينة ترفيهية في العالم (محفوظ) (بالعربية)/n/r (8 نيسان (أبريل) 2017)/n/r
 عشر حقائق عن (القدية) أكبر مدينة ترفيهية بالعالم (محفوظ) (بالعربية)/n/r (28 نيسان (أبريل) 2018)/n/r
 نائب الملك يطلق مشروع البحر الأحمر/n/r/n/r/n/r وجهة سياحية عالمية (محفوظ) (بالعربية)/n/r (1 أغسطس 2017)/n/r
 ولي العهد السعودي يعلن خطة لمشروع سياحي بالبحر الأحمر (محفوظ) (بالعربية)/n/r (1 أغسطس 2017)/n/r
 منطقة خاصة ولا تحتاج إلى تأشيرة دخول/n/r/n/r هل يحول هذا المشروع السعودية إلى وجهة سياحية عالمية؟ (محفوظ) (بالعربية)/n/r (25 أكتوبر 2017)/n/r
 عن مشروع البحر الأحمر: قلة نوعية في صناعة السياحة العالمية (محفوظ) (بالعربية)/n/r (2 أغسطس 2017)/n/r
 محمد بن سلمان: سنعود إلى الإسلام المعتدل الوسطي (محفوظ) (بالعربية)/n/r (24 أكتوبر 2017)/n/r
 مشروع البحر الأحمر: عوائد بـ15 مليار ريال و35 ألف وظيفة (محفوظ) (بالعربية)/n/r (1 أغسطس 2017)/n/r
 «الريفيرا السعودية»/n/r/n/r وجه جديد للسياحة الشاطئية (محفوظ) (بالعربية)/n/r (3 أغسطس 2017)/n/r
 ولي العهد السعودي يُعلن إنشاء أول مدينة غير ربحية بالعالم/n/r الشرق الأوسط/n/r مؤرشف من الأصل في 2021-11-15/n/r اطلع عليه بتاريخ 2021-11-14/n/r
 ولي العهد السعودي يطلق مدينة أوكساجون في نيوم/n/r/n/r أكبر تجمع صناعي عائم بالعالم/n/r العربية/n/r 16 نوفمبر 2021/n/r مؤرشف من الأصل في 2021-11-17/n/r اطلع عليه بتاريخ 2021-11-16/n/r
 طرح {أرامكو} للاكتتاب/n/r/n/r يفتح آفاقًا جديدة للاقتصاد السعودي  (محفوظ) (بالعربية)/n/r (10 يناير 2016)/n/r
 لقاء ولي العهد السعودي محمد بن سلمان مع مجلة ذي إيكونوميست (محفوظ) (بالعربية)/n/r (6 يناير 2016)/n/r
 Saudi Arabia is considering an IPO of Aramco probably the world’s most valuable company (محفوظ) (بالعربية)/n/r (7 يناير 2016)/n/r
 السعودية تدرس بيع أسهم في شركة أرامكو النفطية العملاقة (محفوظ) (بالعربية)/n/r (8 يناير 2016)/n/r
 محمد بن سلمان: 1 % من أرامكو سيكون أكبر اكتتاب في تاريخ الكرة الأرضية (محفوظ) (بالعربية)/n/r (25 نيسان (أبريل) 2016)/n/r
 ثلاثة أسباب وراء احتمال تأخر طرح أرامكو للاكتتاب العام إلى 2019 (محفوظ) (بالعربية)/n/r (12 مارس 2018)/n/r
 الفالح لـCNN: نشعر بقلق من طرح أرامكو في بورصة نيويورك ونحترم بورصة لندن (محفوظ) (بالعربية)/n/r (8 مارس 2018)/n/r
 الفالح: «أرامكو» جاهزة للطرح في 2018/n/r/n/r ونتأكد من الوقت المناسب (محفوظ) (بالعربية)/n/r (25 يناير 2018)/n/r
 حصري-مصادر: وقف خطة طرح أرامكو السعودية وتسريح مستشاري العملية (محفوظ) (بالعربية)/n/r (22 أغسطس 2018)/n/r
 السعودية ملتزمة بطرح أرامكو للاكتتاب (محفوظ) (بالعربية)/n/r (23 أغسطس 2018)/n/r
 الرياض تنفي إلغاء مشروع طرح أسهم أرامكو للبيع (محفوظ) (بالعربية)/n/r (23 أغسطس 2018)/n/r
 رئيس مجلس ادارة أرامكو يعلن موافقة هيئة السوق المالية على الاكتتاب (محفوظ) (بالعربية)/n/r (3 نوفمبر 2019)/n/r
 انطلاق بدء اكتتاب أرامكو بنطاق سعري بين 30 و32 ريالًا للسهم (محفوظ) (بالعربية)/n/r (17 نوفمبر 2019)/n/r
 اكتتاب أرامكو يبدأ اليوم/n/r/n/r وهذا هو النطاق السعري لأسهم الشركة السعودية (محفوظ) (بالعربية)/n/r (17 نوفمبر 2019)/n/r
 الطرح العام الأولي - تفاصيل الاتصال والأسئلة الشائعة (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 10 نوفمبر 2019/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 202020 نوفمبر 2019/n/r
 Saudi Aramco Raises $25/n/r6 Billion in World’s Biggest IPO (محفوظ) (بالإنجليزية)/n/r (5 ديسمبر 2019)/n/r
 بعد يوم من اكتتابها/n/r/n/r أرامكو السعودية أول شركة تبلغ قيمتها تريليوني دولار في العالم (محفوظ) (بالعربية)/n/r (12 ديسمبر 2019)/n/r
 Aramco Soars in Debut to Hit Market Value of $1/n/r88 Trillion (محفوظ) (بالإنجليزية)/n/r (11 ديسمبر 2019)/n/r
 أرامكو /n/r/n/r الوعد يتحقق (محفوظ) (بالعربية)/n/r (11 ديسمبر 2019)/n/r
 محمد بن سلمان لـ«واشنطن بوست»: إن السعودية تمتلك 5 في المئة من احتياطيات اليورانيوم في العالم  (محفوظ) (بالعربية)/n/r (23 مارس 2018)/n/r
 السعودية وروسيا: 16 مفاعلاً نووياً و6 اتفاقيات (محفوظ) (بالعربية)/n/r (18 يونيو 2015)/n/r
 ست اتفاقيات تتوج زيارة ولي ولي العهد السعودي إلى روسيا  (محفوظ) (بالعربية)/n/r (18 يونيو 2015)/n/r
 روسيا والسعودية توقعان اتفاقيات للتعاون في مجال الطاقة والفضاء (محفوظ) (بالعربية)/n/r (18 يونيو 2015)/n/r
 ولي ولي العهد السعودي يلتقي الرئيس هولاند في باريس/n/r/n/r ويعقد اجتماعا ثنائيا مع فابيوس  (محفوظ) (بالعربية)/n/r (25 يونيو 2015)/n/r
 ولي ولي العهد يرسخ في باريس العلاقات الإستراتيجية بين المملكة وفرنسا (محفوظ) (بالعربية)/n/r (27 يونيو 2015)/n/r
 السعودية تقر إنشاء مشروع وطني للطاقة الذرية بعد توصية ولي العهد محمد بن سلمان (محفوظ) (بالعربية)/n/r (24 يوليو 2017)/n/r
 السعودية تطرح عقود أول محطة نووية نهاية 2018 (محفوظ) (بالعربية)/n/r (16 يناير 2018)/n/r
 الإستراتيجية الوطنية للنقل والخدمات اللوجستية/n/r مؤرشف من الأصل في 2021-07-09/n/r
 المنصة اللوجستية/n/r مؤرشف من الأصل في 2021-04-22/n/r
 أهداف الإستراتيجية/n/r مؤرشف من الأصل في 2021-07-09/n/r
 النقل الجوي/n/r مؤرشف من الأصل في 2021-07-09/n/r
 النقل البحري/n/r مؤرشف من الأصل في 2021-07-09/n/r
 قطار الحرمين السريع/n/r مؤرشف من الأصل في 2021-07-11/n/r
 الهيئة العامة لموانئ البحر الأحمر || الموقع الرسمي/n/r www/n/rrspa/n/rgov/n/reg/n/r مؤرشف من الأصل في 2021-03-12/n/r اطلع عليه بتاريخ 2021-06-30/n/r
 النقل البري/n/r مؤرشف من الأصل في 2021-07-09/n/r
 ركائز الإستراتيجية/n/r مؤرشف من الأصل في 2021-07-09/n/r
 اقتصادي / سمو ولي العهد يعلن عن مبادرة السعودية الخضراء ومبادرة الشرق الأوسط الأخضر وكالة الأنباء السعودية/n/r www/n/rspa/n/rgov/n/rsa/n/r مؤرشف من الأصل في 2021-03-27/n/r اطلع عليه بتاريخ 2021-03-27/n/r
 ولي العهد السعودي يعلن عن مبادرة السعودية الخضراء ومبادرة الشرق الأوسط الأخضر/n/r RT Arabic/n/r مؤرشف من الأصل في 2021-03-27/n/r اطلع عليه بتاريخ 2021-03-27/n/r
 ولي العهد السعودي يعلن عن مبادرة السعودية الخضراء ومبادرة الشرق الأوسط/n/r CNBC/n/r مؤرشف من الأصل في 2021-03-27/n/r اطلع عليه بتاريخ 2021-03-27/n/r
 «عكاظ» (الرياض) (27 مارس 2021)/n/r ولي العهد يعلن عن مبادرة «السعودية الخضراء» ومبادرة «الشرق الأوسط الأخضر»/n/r Okaz/n/r مؤرشف من الأصل في 2021-03-27/n/r اطلع عليه بتاريخ 2021-03-27/n/r
 سمو ولي العهد يفتتح منتدى مبادرة السعودية الخضراء بمشاركة إقليمية ودولية واسعة/n/r مؤرشف من الأصل في 2020-11-12/n/r
 ولي العهد السعودي يطلق مخطط رحلة عبر الزمن لتأهيل آثار العلا/n/r CNN Arabic/n/r 7 أبريل 2021/n/r مؤرشف من الأصل في 2021-04-07/n/r اطلع عليه بتاريخ 2021-04-08/n/r
 alkhaldi146@، خالد الخالدي (العلا) (7 أبريل 2021)/n/r ولي العهد يطلق «رحلة عبر الزمن» ضمن برنامج تطوير العلا/n/r Okaz/n/r مؤرشف من الأصل في 2021-04-07/n/r اطلع عليه بتاريخ 2021-04-08/n/r
 محمد بن سلمان يطلق برنامج شريك ويكشف حجم الاستثمارات الجديدة/n/r CNN Arabic/n/r 30 مارس 2021/n/r مؤرشف من الأصل في 2021-04-10/n/r اطلع عليه بتاريخ 2021-04-12/n/r
 اقتصادي / صندوق الاستثمارات العامة يطلق مشروع سدير للطاقة الشمسية وكالة الأنباء السعودية/n/r www/n/rspa/n/rgov/n/rsa/n/r مؤرشف من الأصل في 2021-04-11/n/r اطلع عليه بتاريخ 2021-04-09/n/r
 الصندوق السيادي السعودي يطلق مشروع سدير للطاقة الشمسية/n/r الشرق الأوسط/n/r مؤرشف من الأصل في 2021-04-11/n/r اطلع عليه بتاريخ 2021-04-09/n/r
 بدء تشغيل محطة سكاكا السعودية للطاقة الشمسية/n/r العربية/n/r 9 نوفمبر 2019/n/r مؤرشف من الأصل في 2021-04-08/n/r اطلع عليه بتاريخ 2021-04-08/n/r
 نور، أبها: محمد (4 سبتمبر 2019)/n/r 56 مليارا من طاقة الرياح للناتج المحلي/n/r Watanksa/n/r مؤرشف من الأصل في 2021-04-11/n/r اطلع عليه بتاريخ 2021-04-10/n/r
 المملكة العربية السعودية تطلق العنان لطاقة الرياح/n/r المملكة العربية السعودية تطلق العنان لطاقة الرياح (بar-ae)/n/r Archived from the original on 2021-04-11/n/r Retrieved 2021-04-10/n/r
 رياح دومة الجندل الأكبر في الشرق الأوسط/n/r صحيفة مكة/n/r 16 يناير 2019/n/r مؤرشف من الأصل في 2020-06-08/n/r اطلع عليه بتاريخ 2020-06-08/n/r
 Thomas Hillig (22 يناير 2015)/n/r Renewables for the Mining Sector/n/r decentralized-energy/n/rcom/n/r مؤرشف من الأصل في 2017-07-05/n/r
 ولي العهد يطلق الاستراتيجية الوطنية للاستثمار/n/r صحيفة الاقتصادية/n/r 11 أكتوبر 2021/n/r مؤرشف من الأصل في 2021-10-30/n/r اطلع عليه بتاريخ 2021-10-11/n/r
 ولي العهد يطلق الاستراتيجية الوطنية للاستثمار أحد الممكنات الرئيسة لتحقيق مستهدفات رؤية المملكة 2030/n/r صحيفة سبق الإلكترونية/n/r مؤرشف من الأصل في 2021-10-29/n/r اطلع عليه بتاريخ 2021-10-11/n/r
 Iran Dominates in Iraq After U/n/rS/n/r ‘Handed the Country Over’ (محفوظ) (بالعربية)/n/r (15 يوليو 2017)/n/r
 Around the World Distress Over Iran (محفوظ) (بالعربية)/n/r (28 نوفمبر 2010)/n/r
 Gulf Arabs back unity after hinting at Iran threat (محفوظ) (بالعربية)/n/r (20 ديسمبر 2011)/n/r
 Saudi Arabia: Feeling the Iranian Pinch in Iraq (محفوظ) (بالعربية)/n/r (23 سبتمبر 2005)/n/r
 ولي العهد : دخول أمريكا للعراق خطأ فادح (محفوظ) (بالعربية)/n/r (6 نيسان (أبريل) 2018)/n/r
 الأبعاد والتداعيات:النفوذ الإيراني في لبنان (محفوظ) (بالعربية)/n/r (15 مارس 2016)/n/r
 حزب الله والتماهي مع الثورة الخمينية/n/r/n/r المقاومة في لبنان والولاء لإيران (محفوظ) (بالعربية)/n/r (13 ديسمبر 2013)/n/r
 7 أيار 2008/n/r/n/r/n/r عندما انتحر حزب الله في بيروت! (محفوظ) (بالعربية)/n/r (7 مايو 2014)/n/r
 التصدي لإيران/n/r/n/r هل ينجح العرب؟ (محفوظ) (بالعربية)/n/r (19 نوفمبر 2017)/n/r
 أبرز المحطات قبل وبعد عملية عاصفة الحزم (محفوظ) (بالعربية)/n/r (29 ديسمبر 2015)/n/r
 سيناريوات أخطر من حروب الوكالة/n/r/n/r/n/r أين يمكن أن تنفجر بين السعودية وايران؟ (محفوظ) (بالعربية)/n/r (15 يناير 2016)/n/r
 «عاصفة الحزم» تبدأ ضد الحوثيين في اليمن/n/r/n/r والقوات السعودية تسيطر على الأجواء (محفوظ) (بالعربية)/n/r (26 مارس 2015 / العدد:13267)/n/r
 أزمة اليمن: لماذا شنت دول الخليج حربا على الحوثيين؟ (محفوظ) (بالعربية)/n/r (الثالث من مايو 2015)/n/r
 حرب عاصفة الحزم على مستويات أخرى ! (محفوظ) (بالعربية)/n/r (9 نيسان (أبريل) 2015)/n/r
 بن سلمان: إيران أكبر عدو (محفوظ) (بالعربية)/n/r (20 نيسان (أبريل) 2015)/n/r
 خبراء ومحللون:«عاصفة الحزم» الرد الطبيعي لوقف تدخلات طهران في المنطقة (محفوظ) (بالعربية)/n/r (15 يناير 2016 / العدد:13562)/n/r
 السعودية تقطع العلاقات مع إيران وتطرد بعثتها الدبلوماسية (محفوظ) (بالعربية)/n/r (الرابع من يناير 2016)/n/r
 المخابرات الألمانية: السعودية تتبع سياسة اندفاعية بالمنطقة (محفوظ) (بالعربية)/n/r (الثاني من ديسمبر 2015)/n/r
 المخابرات الألمانية تحذر من جنوح السياسة السعودية إلى الاندفاع (محفوظ) (بالعربية)/n/r (الثاني من ديسمبر 2015)/n/r
 تغيرات جذرية في سياسة خارجية سعودية أكثر جرأة  (محفوظ) (بالعربية)/n/r (25 فبراير 2016 / السنة:38)/n/r
 Mohammad Javad Zarif: Saudi Arabia’s Reckless Extremism (محفوظ) (بالعربية)/n/r (11 يناير 2016)/n/r
 الأمير محمد بن سلمان: لن ننتظر حتى تصبح المعركة مع إيران في السعودية (محفوظ) (بالعربية)/n/r (الثالث من مايو 2017)/n/r
 ٔقليات-بلا-حقوق-ومطالب-بلا-ا ٔفق إيران/n/r/n/r أقليات بلا حقوق ومطالب بلا أفق (ٔقليات-بلا-حقوق-ومطالب-بلا-ا ٔفق محفوظ) (بالعربية)/n/r (28 يونيو 2016)/n/r
 قائد الأمن الداخلي الإيراني يتّهم السعودية بدعم أطراف داخلية إيرانية (محفوظ) (بالعربية)/n/r (8 مايو 2018)/n/r
 بن سلمان: إيران أكبر عدو (محفوظ) (بالعربية)/n/r (7 نيسان (أبريل) 2018)/n/r
 محمد بن سلمان: الحرب مع إيران ستكون كارثة كبرى ولن نسمح باندلاعها (محفوظ) (بالعربية)/n/r (8 يناير 2016)/n/r
 الحريري يصل إلى بيروت للمرة الأولى منذ استقالته كرئيس للوزراء/n/r وكالة رويترز للأنباء/n/r 21 تشرين الثاني (نوفمبر) 2017/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 نقش ولیعهد سعودی در خروج ترامپ از برجام (محفوظ) (بالعربية)/n/r (28 نيسان (أبريل) 2018)/n/r
 نقش ولیعهد سعودی در خروج ترامپ از برجام (محفوظ) (بالفارسية)/n/r (8 نيسان (أبريل) 2018)/n/r
 تنها 2 كشور در جهان با برجام مخالفند (محفوظ) (بالفارسية)/n/r (الأول من مايو 2018)/n/r
 إيران ترد على محمد بن سلمان/n/r/n/r وتدعو إلى النظر لـمصير صدام (محفوظ) (بالعربية)/n/r (12 نيسان (أبريل) 2018)/n/r
 ولي العهد السعودي: نمتلك 5% من احتياطيات اليورانيوم (محفوظ) (بالعربية)/n/r (25 مارس 2018)/n/r
 جلسات الكونغرس تفضح وجود ملاحق سرية في الاتفاق النووي (محفوظ) (بالعربية)/n/r (30 يوليو 2015)/n/r
 وثيقة سرية حول الملف النووي الإيراني تربك المجتمع الدولي (محفوظ) (بالعربية)/n/r (20 يوليو 2016)/n/r
 الاتفاق النووي وتداعياته على الحضور الإيراني بالمنطقة (محفوظ) (بالعربية)/n/r (سبتمبر 2015 / العدد:99 / صفحة:57)/n/r
 إيران النووية: هل تشعل السباق النووي في المنطقة؟ (محفوظ) (بالعربية)/n/r (سبتمبر 2015 / العدد:99 / صفحة:62)/n/r
 ما هو اتفاق 1938 الذي استشهد به ولي العهد السعودي وما نتائجه؟ (محفوظ) (بالعربية)/n/r (11 نيسان (أبريل) 2018)/n/r
 أوروبا تلعق جراحها والسعودية تشيد بقرار ترامب (محفوظ) (بالعربية)/n/r (10 مايو 2018)/n/r
 محمد بن سلمان يصل إلى واشنطن ويلتقي ترامب اليوم (محفوظ) (بالعربية)/n/r (20 مارس 2018)/n/r
 السعودية تقول دعم إيران للهجوم على أرامكو لا يمكن إنكاره وتعرض أسلحة/n/r وكالة رويترز للأنباء/n/r 18 أيلول (سبتمبر) 2019/n/r مؤرشف من الأصل في 4 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Exclusive: U/n/rN/n/r investigators find Yemens Houthis did not carry out Saudi oil attack (بالإنجليزية)/n/r وكالة رويترز للأنباء/n/r 8 كانون الثاني (يناير) 2020/n/r Archived from the original on 6 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 سليماني يشيد بالحوثيين بعد هجوم على معمليّ نفط سعوديين/n/r شبكة يمن مونيتور الإخبارية/n/r 15 أيلول (سبتمبر) 2019/n/r مؤرشف من الأصل في 5 مايو 2020/n/r اطلع عليه بتاريخ 19 أيلول (سبتمبر) 2019/n/r
 بعد توقف لأشهر/n/r/n/r/n/r استئناف جلسات الحوار بين السعودية وإيران لتحسين العلاقات المتوترة بينهما/n/r فرانس 24/n/r 23 نيسان (أبريل) 2022/n/r مؤرشف من الأصل في 26 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 ولي العهد السعودي: سلوك إيران السلبي هو مشكلتنا معها/n/r العربية/n/rنت/n/r 28 نيسان (أبريل) 2021/n/r مؤرشف من الأصل في 22 مارس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 محمد بن سلمان: تستطيع السعودية اجتثاث الحوثي وصالح بـأيام قليلة ولكن لا نريد المخاطرة بحياة المدنيين (محفوظ) (بالعربية)/n/r (الثالث من مايو 2017)/n/r
 «عاصفة الحزم» تعيد 85 في المائة من أراضي اليمن إلى الشرعية (محفوظ) (بالعربية)/n/r (26 مارس 2017 / العدد:13998)/n/r
 تقرير أممي يتهم التحالف والحوثيين بارتكاب فظائع في اليمن (محفوظ) (بالعربية)/n/r (31 يناير 2017)/n/r
 دعوة مجلس حقوق الإنسان التابع للأمم المتحدة بالتحقيق في تقارير حول استهداف مدنيين في اليمن (محفوظ) (بالعربية)/n/r (18 فبراير 2016 / رقم الوثيقة:MDE 31/3390/2016)/n/r
 محمد بن سلمان: سنتدخل برياً في اليمن إذا اقتضت الضرورة وطلبت حكومته الشرعية (محفوظ) (بالعربية)/n/r (السابع من نيسان (أبريل) 2018 / العدد:14375)/n/r
 أنصار الله على بعد أمتار من الحرس السعودي وسيخوضون حرب استنزاف (محفوظ) (بالعربية)/n/r (30 مارس 2015)/n/r
 ما هي أبرز تصريحات ولي عهد السعودية الجديد عن إيران ومصر واليمن وأمريكا والإرهاب والاقتصاد؟ (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 محمد بن سلمان يطالب ببقاء القوات الأمريكية بسوريا/n/r/n/rوترامب يبلغ مستشاريه برغبته في الانسحاب (محفوظ) (بالعربية)/n/r (26 مارس 2018 / السنة:142)/n/r
 محمد بن سلمان: لولا التحالف لانقسم اليمن بين الحوثي والقاعدة (محفوظ) (بالعربية)/n/r (31 مارس 2017)/n/r
 لقاء ولي العهد السعودي محمد بن سلمان مع مجلة تايم (محفوظ) (بالعربية)/n/r (عدد نيسان (أبريل) 2018)/n/r
 ولي عهد السعودية: أمريكا اقترفت خطأين/n/r/n/r وسوريا جزء من نفوذ روسيا (محفوظ) (بالعربية)/n/r (6 نيسان (أبريل) 2018)/n/r
 محمد بن سلمان: بشار باق (محفوظ) (بالعربية)/n/r (30 مارس 2018)/n/r
 محمد بن سلمان: ليس من مصلحة الأسد إطلاق يد إيران في سوريا (محفوظ) (بالعربية)/n/r (1 نيسان (أبريل) 2018 / العدد:14369)/n/r
 ولي عهد السعودية: بشار الأسد سيبقى ومن مصلحته ألا يكون دمية بيد إيران (محفوظ) (بالعربية)/n/r (31 مارس 2018)/n/r
 الأمير محمد بن سلمان لـ«Time»: إيران العدو الأكبر (محفوظ) (بالعربية)/n/r (6 نيسان (أبريل) 2018)/n/r
 محمد بن سلمان يطالب ببقاء القوات الأمريكية بسوريا/n/r/n/rوترامب يبلغ مستشاريه برغبته في الانسحاب (محفوظ) (بالعربية)/n/r (1 نيسان (أبريل) 2018 / السنة:142)/n/r
 Milliken Giorgio CafieroEmily/n/r Analysis: How important is Syrias return to the Arab League?/n/r Al Jazeera (بالإنجليزية)/n/r Archived from the original on 2023-10-16/n/r Retrieved 2024-01-25/n/r
 Aziz El Yaakoubi and Samia Nakhoul/n/r Syrias Assad wins warm welcome at Arab summit after years of isolation/n/r Reuters/n/r مؤرشف من الأصل في 2023-10-20/n/r
 محمد بن سلمان: لا علاقة مع إسرائيل قبل حل قضية السلام مع الفلسطينيين (محفوظ) (بالعربية)/n/r (6 نيسان (أبريل) 2018)/n/r
 ولي العهد السعودي: الإسرائيليون لهم الحق في العيش على أرضهم (محفوظ) (بالعربية)/n/r (3 نيسان (أبريل) 2018)/n/r
 الأمير محمد بن سلمان لمجلة «ذا أتلانتيك»: الإخوان يريدون استغلال الديمقراطية لنشر «الخلافة» (محفوظ) (بالعربية)/n/r (3 نيسان (أبريل) 2018)/n/r
 ولي العهد السعودي: الإسرائيليون لهم حق العيش بسلام على أرضهم (محفوظ) (بالعربية)/n/r (2 نيسان (أبريل) 2018)/n/r
 لقاء ولي العهد السعودي محمد بن سلمان مع مجلة ذا أتلانتيك (محفوظ) (بالعربية)/n/r (عدد نيسان (أبريل) 2018)/n/r
 محمد بن سلمان: قرار ترامب بشأن القدس خطوة مؤلمة (محفوظ) (بالعربية)/n/r (23 مارس 2018)/n/r
 الملك سلمان: القضية الفلسطينية هي قضيتنا الأولى (محفوظ) (بالعربية)/n/r (15 نيسان (أبريل) 2018)/n/r
 محمد بن سلمان يبحث في إسبانيا ملفات سياسية واقتصادية  (محفوظ) (بالعربية)/n/r (12 نيسان (أبريل) 2018 / العدد:14380)/n/r
 «إعلان قمة الظهران» يؤكد بطلان القرار الأميركي بشأن القدس (محفوظ) (بالعربية)/n/r (16 نيسان (أبريل) 2018 / العدد:14384)/n/r
 التبادل التجاري بين السعودية والصين يتضاعف 10 مرات في 12 عاما/n/r جريدة الاقتصادية/n/r 17 كانون الثاني (يناير) 2016/n/r مؤرشف من الأصل في 29 أغسطس 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 اختتام القمة السعودية الصينية بإعلان شراكة شاملة/n/r العربية/n/rنت/n/r 29 كانون الثاني (يناير) 2016/n/r مؤرشف من الأصل في 2 مارس 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 زيارة العاهل السعودي الملك سلمان بن عبد العزيز تدفع تنمية علاقات بلاده مع الصين/n/r صحيفة الشعب اليومية/n/r 17 آذار (مارس) 2017/n/r مؤرشف من الأصل في 17 مارس 2017/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 العلاقات الاقتصادية بين الصين والسعودية تتطور على نحو أعمق وأكثر استمرارية/n/r وكالة أنباء شينخوا/n/r 23 آب (أغسطس) 2017/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 إتباعا للماضي واستشرافا للمستقبل: الصين والسعودية تواصلان خلق حقبة جديدة من العلاقات الودية والإستراتيجية/n/r وكالة أنباء شينخوا/n/r 25 شباط (فبراير) 2019/n/r مؤرشف من الأصل في 25 فبراير 2019/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 خطط للتوسع في تدريس اللغة الصينية في المدارس السعودية/n/r جريدة الشرق الأوسط/n/r 20 كانون الثاني (يناير) 2020 / العدد:15028/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 زيارة ولي العهد السعودي للصين تثمر 35 اتفاقية بقيمة 28 مليار دولار/n/r جريدة العرب اللندنية/n/r 23 شباط (فبراير) 2019/n/r مؤرشف من الأصل في 30 ديسمبر 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Ensor، Josie (22 فبراير 2019)/n/r Saudi crown prince defends Chinas right to put Uighur Muslims in concentration camps/n/r ديلي تلغراف/n/r مؤرشف من الأصل في 2021-01-25/n/r
 Saudi Arabias Mohammed bin Salman Defends Chinas Use of Concentration Camps for Muslims During Visit to Beijing/n/r Newsweek/n/r 22 فبراير 2019/n/r مؤرشف من الأصل في 2021-01-18/n/r
 Saudi crown prince defended Chinas imprisonment of a million Muslims in internment camps giving Xi Jinping a reason to continue his precursors to genocide/n/r Business Insider/n/r 23 فبراير 2019/n/r مؤرشف من الأصل في 2020-12-10/n/r
 الصين تعرب عن استعدادها لإقامة تعاون شامل ورفيع المستوى مع السعودية/n/r موقع قناة روسيا اليوم/n/r 23 آذار (مارس) 2022/n/r مؤرشف من الأصل في 14 أبريل 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 الصين تكشف ما قاله رئيسها خلال اتصاله مع محمد بن سلمان/n/r موقع شبكة سي إن إن الأمريكية/n/r 15 نيسان (أبريل) 2022/n/r مؤرشف من الأصل في 3 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 محمد بن سلمان يدفع بالعلاقات السعودية ـ الصينية نحو الاستثمار في المستقبل/n/r جريدة الشرق الأوسط/n/r 23 شباط (فبراير) 2019 / العدد:14697/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 اتفاق سعودي صيني لبناء مصنع للطائرات بدون طيار بالمملكة/n/r العربية/n/rنت/n/r 5 حزيران (يونيو) 2022/n/r مؤرشف من الأصل في 18 مارس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 العلاقات العسكرية بين السعودية والصين/n/r/n/r كثير من السرية قليل من التعقيد/n/r جريدة العرب اللندنية/n/r 29 كانون الأول (ديسمبر) 2021/n/r مؤرشف من الأصل في 5 يناير 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 مصادر تكشف لـCNN معلومات استخباراتية عن برنامج صاروخي للسعودية بمساعدة الصين/n/r موقع شبكة سي إن إن الأمريكية/n/r 6 حزيران (يونيو) 2019/n/r مؤرشف من الأصل في 29 يوليو 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 محمد بن سلمان: إذا طورت إيران قنبلة نووية سنفعل الشيء نفسه/n/r موقع شبكة سي إن إن الأمريكية/n/r 15 آذار (مارس) 2022/n/r مؤرشف من الأصل في 11 أبريل 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 لسعودية تطور برنامجا سريا للصواريخ الباليستية بمساعدة الصين من دون علم واشنطن /n/r/n/r/n/r وغضب ديمقراطي/n/r إندبندنت عربية/n/r 6 حزيران (يونيو) 2019/n/r مؤرشف من الأصل في 8 نوفمبر 2020/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 تقرير: مدير سي آي إيه التقى ولي العهد السعودي لـإصلاح العلاقات/n/r موقع قناة الشرق للأخبار/n/r 3 أيّار (مايو) 2022/n/r مؤرشف من الأصل في 3 مايو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 العلاقات السعودية الأمريكية: تحالف دائم واختلافات طارئة (محفوظ) (بالعربية)/n/r (22 مايو 2017)/n/r
 وسط توتر التحالفات /n/r/n/r أوباما يسعى لطمأنة دول الخليج بشأن إيران (محفوظ) (بالعربية)/n/r (19 نيسان (أبريل) 2016)/n/r
 The Obama Doctrine (محفوظ) (بالعربية)/n/r (عدد نيسان (أبريل) 2016)/n/r
 ما مستقبل العلاقات السعودية الأمريكية بعد توقيع الاتفاق الإيراني؟ (محفوظ) (بالعربية)/n/r (16 يوليو 2015)/n/r
 مسؤول أمريكي: مناقشة زيارة محتملة لترامب إلى السعودية (محفوظ) (بالعربية)/n/r (19 نيسان (أبريل) 2017)/n/r
 العلاقات الأمريكية السعودية ـ حرارة الصفقات تذيب ثلوج الخلافات! (محفوظ) (بالعربية)/n/r (19 مايو 2017)/n/r
 البيت الأبيض: ترامب وولي العهد السعودي بحثا خطر الحوثيين في اليمن (محفوظ) (بالعربية)/n/r (21 مارس 2018)/n/r
 ترامب: لن نقبل الابتزاز النووي (محفوظ) (بالعربية)/n/r (8 مايو 2018)/n/r
 لماذا ترفض إدارة ترامب الاتفاق النووي الإيراني؟ (محفوظ) (بالعربية)/n/r (13 أكتوبر 2017)/n/r
 ترامب يلتقي مع ولي ولي العهد السعودي في البيت الأبيض (محفوظ) (بالعربية)/n/r (14 مارس 2018)/n/r
 مسؤولة سابقة في البيت الأبيض: ترامب وجد شريكا قويا في ابن سلمان (محفوظ) (بالعربية)/n/r (28 مارس 2018)/n/r
 ترمب يلتقي ولي العهد السعودي بواشنطن في 20 مارس (محفوظ) (بالعربية)/n/r (12 مارس 2018)/n/r
 أول جولة خارجية لترامب تشمل السعودية وإسرائيل والفاتيكان (محفوظ) (بالعربية)/n/r (الرابع من مايو 2017)/n/r
 عقود دفاعية واستثمار متبادل/n/r/n/r هذه الصفقات التي سينشغل ترامب بإبرامها في السعودية (محفوظ) (بالعربية)/n/r (19 مايو 2017)/n/r
 ترامب يعلن صفقات بين السعودية وأمريكا تتجاوز 400 مليار دولار/n/r/n/r تعرّف على أبرزها (محفوظ) (بالعربية)/n/r (21 مايو 2017)/n/r
 ولي عهد السعودية يلتقي شخصيات بارزة في وول ستريت الأسبوع القادم (محفوظ) (بالعربية)/n/r (23 مارس 2018)/n/r
 ترامب يشيد بمبيعات السلاح الأمريكية في اجتماع مع ولي عهد السعودية (محفوظ) (بالعربية)/n/r (20 مارس 2018)/n/r
 Joe Biden on Being Vice President: Isnt It a Bitch? (بالإنجليزية)/n/r جريدة بوسطن/n/r 2 تشرين الأول (أكتوبر) 2014/n/r Archived from the original on 15 يناير 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 Biden adds Saudi Arabia to his apology list over Islamic State (بالإنجليزية)/n/r وكالة رويترز للأنباء/n/r 7 تشرين الأول (أكتوبر) 2014/n/r Archived from the original on 21 يناير 2021/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 بايدن يعتذر للمملكة عن التصريحات حول «الإرهاب»/n/r جريدة الرياض/n/r 8 تشرين الأول (أكتوبر) 2014/n/r مؤرشف من الأصل في 16 يناير 2015/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 بايدن يعتذر للسعودية بعد تصريحات اتهم فيها الرياض بتمويل وتسليح الإرهاب/n/r فرانس 24/n/r 8 تشرين الأول (أكتوبر) 2014/n/r مؤرشف من الأصل في 29 ديسمبر 2020/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 بايدن يعتذر للفيصل عن اتهامه السعودية بدعم الإرهاب/n/r جريدة الرأي الكويتية/n/r 9 تشرين الأول (أكتوبر) 2014/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 ما مستقبل العلاقات السعودية الأمريكية بعد توقيع الاتفاق الإيراني؟/n/r فرانس 24/n/r 16 تموز (يوليو) 2015/n/r مؤرشف من الأصل في 10 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 باختياره لهاريس، بايدن يختار مرشحة ديمقراطية مؤيدة تقليديا لإسرائيل/n/r تايمز إسرائيل/n/r 12 آب (أغسطس) 2020/n/r مؤرشف من الأصل في 16 يناير 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 السعودية وروسيا: 16 مفاعلاً نووياً و6 اتفاقيات/n/r العربية/n/rنت/n/r 18 حزيران (يونيو) 2015/n/r مؤرشف من الأصل في 9 مارس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Candidates Answer CFRs Questions: Joe Biden (بالإنجليزية)/n/r مجلس العلاقات الخارجية/n/r 1 آب (أغسطس) 2019/n/r Archived from the original on 3 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 Biden says Trump made gigantic mistake withdrawing US from Iran nuclear deal (بالإنجليزية)/n/r موقع شبكة سي إن إن الأمريكية/n/r 13 تموز (يوليو) 2022/n/r Archived from the original on 1 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 بايدن يهدد السعودية بدفع الثمن/n/r موقع قناة روسيا اليوم/n/r 21 تشرين الثاني (نوفمبر) 2019/n/r مؤرشف من الأصل في 13 نوفمبر 2020/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 واشنطن: سنتواصل مع الرياض عبر الملك سلمان وليس ولي عهده/n/r موقع قناة روسيا اليوم/n/r 16 شباط (فبراير) 2022/n/r مؤرشف من الأصل في 26 فبراير 2021/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 بايدن: أوضحت للملك سلمان أن القواعد تغيرت/n/r/n/r وسنحاسبهم على انتهاكات حقوق الإنسان/n/r موقع شبكة سي إن إن الأمريكية/n/r 26 شباط (فبراير) 2021/n/r مؤرشف من الأصل في 4 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 النص الكامل لتقرير الاستخبارات الأمريكية: محمد بن سلمان وافق على عملية خاشقجي/n/r موقع شبكة سي إن إن الأمريكية/n/r 26 شباط (فبراير) 2021/n/r مؤرشف من الأصل في 4 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 البيت الأبيض يكشف تفاصيل محادثات خالد بن سلمان في واشنطن/n/r وكالة أنباء سبوتنيك/n/r 7 تموز (يوليو) 2021/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Top Biden Aide Sullivan to Meet With Saudi Crown Prince Monday (بالإنجليزية)/n/r بلومبيرغ نيوز/n/r 27 أيلول (سبتمبر) 2021/n/r Archived from the original on 27 سبتمبر 2021/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 How U/n/rS/n/r-Saudi Relations Reached the Breaking Point (بالإنجليزية)/n/r وول ستريت جورنال/n/r 19 نيسان (أبريل) 2022/n/r Archived from the original on 29 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 وول ستريت جورنال: كيف وصلت العلاقات السعودية-الأمريكية إلى هذا المستوى؟/n/r موقع 24 الإخباري/n/r 20 نيسان (أبريل) 2022/n/r مؤرشف من الأصل في 14 مايو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 وول ستريت جورنال تنشر خفايا التوتر بين إدارة بايدن والسعودية/n/r جريدة النهار اللبنانية/n/r 20 نيسان (أبريل) 2022/n/r مؤرشف من الأصل في 6 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 نص ما قاله محمد بن سلمان بإجابة على 72 سؤالا مع استمرار التفاعل لليوم الـ3 على نشر مقابلة ولي العهد/n/r موقع شبكة سي إن إن الأمريكية/n/r 6 آذار (مارس) 2022/n/r مؤرشف من الأصل في 3 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 بلومبيرغ: إدارة بايدن تبحث مدى جدية تصريحات بن سلمان لمجلة ذي أتلانتيك/n/r موقع قناة روسيا اليوم/n/r 22 آذار (مارس) 2022/n/r مؤرشف من الأصل في 12 أبريل 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Saudi Emirati Leaders Decline Calls With Biden During Ukraine Crisis (بالإنجليزية)/n/r وول ستريت جورنال/n/r 8 آذار (مارس) 2022/n/r Archived from the original on 3 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 بعد تقرير رفض التحدث هاتفيا مع بايدن/n/r/n/r تعليق إماراتي وآخر أميركي/n/r موقع قناة الحرة الأمريكية/n/r 10 آذار (مارس) 2022/n/r مؤرشف من الأصل في 25 أبريل 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 Saudi Emirati Leaders Decline Calls With Biden During Ukraine Crisis (بالإنجليزية)/n/r وول ستريت جورنال/n/r 15 آذار (مارس) 2022/n/r Archived from the original on 3 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 النفط السعودي باليوان الصيني/n/r/n/r خطوة دراماتيكية مرتقبة وتحذير لولي العهد/n/r موقع قناة الحرة الأمريكية/n/r 15 آذار (مارس) 2022/n/r مؤرشف من الأصل في 5 أبريل 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 تقرير: السعودية تدرس بيع النفط إلى الصين بـ«اليوان»/n/r صحيفة عكاظ/n/r 16 آذار (مارس) 2022/n/r مؤرشف من الأصل في 10 يونيو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 هل سينتهي عصر البترودولار قريبا؟/n/r موقع هيئة الإذاعة البريطانية بي بي سي/n/r 26 آذار (مارس) 2022/n/r مؤرشف من الأصل في 21 يونيو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 CIA Chief Met Saudi Crown Prince Last Month in Push to Mend Ties (بالإنجليزية)/n/r وول ستريت جورنال/n/r 3 أيّار (مايو) 2022/n/r Archived from the original on 14 يوليو 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 Scoop: Biden officials in Saudi Arabia for talks on oil planned visit (بالإنجليزية)/n/r موقع أكسيوس/n/r 25 أيّار (مايو) 2022/n/r Archived from the original on 14 يوليو 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 مسؤولان أميركيان في السعودية بزيارة غير معلنة/n/r موقع قناة الحرة الأمريكية/n/r 25 أيّار (مايو) 2022/n/r مؤرشف من الأصل في 7 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 White House postpones Biden trips to Saudi Arabia and Israel (بالإنجليزية)/n/r إن بي سي نيوز/n/r 3 حزيران (يونيو) 2022/n/r Archived from the original on 3 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 الديوان الملكي : بدعوة من خادم الحرمين الشريفين/n/r/n/r رئيس الولايات المتحدة الأمريكية يزور المملكة 15 و 16 يوليو القادم/n/r وزارة الخارجية السعودية/n/r 14 حزيران (يونيو) 2022/n/r مؤرشف من الأصل في 15 يوليو 2022/n/r اطلع عليه بتاريخ 15 تموز (يوليو) 2022/n/r
 Joe Biden: Why Im going to Saudi Arabia (بالإنجليزية)/n/r واشنطن بوست/n/r 9 تموز (يوليو) 2022/n/r Archived from the original on 13 يوليو 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 بايدن يكتب مقالا لماذا سأذهب إلى السعودية؟ ويثير تفاعلا قبل أيام على زيارة المملكة/n/r موقع شبكة سي إن إن الأمريكية/n/r 9 تموز (يوليو) 2022/n/r مؤرشف من الأصل في 4 أغسطس 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 A New Shape for US-Saudi Relations (بالإنجليزية)/n/r بوليتيكو/n/r 14 تموز (يوليو) 2022/n/r Archived from the original on 18 يوليو 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 Arab Summit fails to give President Biden what he wants (بالإنجليزية)/n/r جيروزاليم بوست/n/r 17 تموز (يوليو) 2022/n/r Archived from the original on 1 أغسطس 2022/n/r Retrieved 6 آب (أغسطس) 2022/n/r
 استقبله الأمير خالد الفيصل لدى وصوله إلى جدة؛ بايدن: انسحاب قوات حفظ السلام من تيران وصنافير/n/r إيلاف/n/r 15 تموز (يوليو) 2022/n/r مؤرشف من الأصل في 19 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 خلافا لاستقبال بايدن/n/r/n/r محمد بن سلمان يرحب بالزعماء العرب بنفسه في المطار/n/r موقع قناة روسيا اليوم/n/r 16 تموز (يوليو) 2022/n/r مؤرشف من الأصل في 30 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 بايدن في السعودية/n/r/n/r يصافح ولي العهد ويجتمع مع الملك بحضوره/n/r دويتشه فيله/n/r 15 تموز (يوليو) 2022/n/r مؤرشف من الأصل في 24 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 بايدن: لن أعقد اجتماعا ثنائيا مع محمد بن سلمان/n/r دويتشه فيله/n/r 17 حزيران (يونيو) 2022/n/r مؤرشف من الأصل في 11 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 محمد بن سلمان يجتمع مع بايدن في قصر السلام بجدة/n/r جريدة الشرق الأوسط/n/r 15 تموز (يوليو) 2022/n/r مؤرشف من الأصل في 23 يوليو 2022/n/r اطلع عليه بتاريخ 6 آب (أغسطس) 2022/n/r
 محمد بن سلمان: مثلث الشر يحاول السيطرة على العالم (محفوظ) (بالعربية)/n/r (الرابع من نيسان (أبريل) 2018)/n/r
 محمد بن سلمان: «الإخوان» الخطر الأكبر عبر دعمها التطرّف والفوضى في المنطقة والعالم (محفوظ) (بالعربية)/n/r (7 نيسان (أبريل) 2018)/n/r
 محمد بن سلمان: مثلث الشر إيران والإخوان وجماعات التطرف (محفوظ) (بالعربية)/n/r (الرابع من نيسان (أبريل) 2018)/n/r
 محمد بن سلمان: مثلث الشر إيران والإخوان والجماعات الإرهابية (محفوظ) (بالعربية)/n/r (الثالث من نيسان (أبريل) 2018)/n/r
 لقاء ولي العهد السعودي محمد بن سلمان مع صحيفة وول ستريت (محفوظ) (بالعربية)/n/r (29 مارس 2018)/n/r
 الأمير محمد بن سلمان: الإخوان حاضنة للإرهابيين (محفوظ) (بالعربية)/n/r (30 مارس 2018)/n/r
 الأمير محمد بن سلمان لمجلة «ذا أتلانتيك»: الإخوان يريدون استغلال الديمقراطية لنشر «الخلافة» (محفوظ) (بالعربية)/n/r (3 نيسان (أبريل) 2018)/n/r
 ولي العهد السعود يتعهد بالقضاء على فكر الإخوان (محفوظ) (بالعربية)/n/r (20 مارس 2018 / السنة:40)/n/r
 جماعة الإخوان المسلمون تشن هجوما حادا على محمد بن سلمان (محفوظ) (بالعربية)/n/r (7 نيسان (أبريل) 2018)/n/r
 إيران ترد على تصريحات ابن سلمان بشأن (مثلث الشر) (محفوظ) (بالعربية)/n/r (13 مارس 2018)/n/r
 القاعدة تهاجم المشاريع الإصلاحيّة لمحمد بن سلمان (محفوظ) (بالعربية)/n/r (الأوّل من يونيو 2018)/n/r
 مجلس الإدارة (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 04 أبريل 2017/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 20202 أغسطس 2020/n/r
 مدارس الرياض (محفوظ)/n/r مؤرشف من الأصل في 28 سبتمبر 2018/n/r وصل لهذا المسار في 14 آب (أغسطس) 2017/n/r
 :: مؤسسة عبد العزيز بن باز الخيرية : (محفوظ)/n/r مؤرشف من الأصل في 28 سبتمبر 2018/n/r وصل لهذا المسار في 4 تموز (يوليو) 2017/n/r
 رؤساء فخريين للجمعية السعودية للإدارة (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 16 أغسطس 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 الأمير سلمان يحتفل بزواج نجله محمد (محفوظ) (بالعربية)/n/r (1 ربيع الأخر 1429هـ -7 أبريل 2008م - العدد: 14532)/n/r
 محمد بن سلمان/n/r/n/r قدرة سياسية وعطاء خيري (محفوظ) (بالعربية)/n/r (5 مارس 2016)/n/r
 الأمير محمد بن سلمان يُرزق بمولود جديد/n/r/n/r ويسميه «مشهور» (محفوظ)/n/r (9 مايو 2015)/n/r
 الأمير محمد بن سلمان يُرزق بمولود جديد/n/r/n/r ويسميه «عبدالعزيز» (محفوظ) (بar-SA)/n/r (17 أبريل 2021)/n/r
 السعودية تعيد صياغة مناهج التعليم لمحاربة الفكر المتطرف (محفوظ) (بالعربية)/n/r (21 مارس 2018)/n/r
 السعودية: اعتقال رجال دين بارزين (محفوظ) (بالعربية)/n/r (15 سبتمبر 2017)/n/r
 مجلة المستقبل العربي، إصدار: مركز دراسات الوحدة العربية/n/r عام: سبتمبر 2009/n/r صفحة:123-126/n/r
 السعودية تحث على الإبلاغ عن المحرضين على مواقع التواصل الاجتماعي (محفوظ) (بالعربية)/n/r (13 سبتمبر 2017)/n/r
 السعودية تجمد العلاقات التجارية مع كندا وتطلب من سفيرها مغادرة المملكة (محفوظ) (بالعربية)/n/r (السادس من أغسطس 2018)/n/r
 إعادة-السعوديون يرون أن تغريدة لسفارة كندا في الرياض تجاوزت الخط الأحمر (محفوظ) (بالعربية)/n/r (11 أغسطس 2018)/n/r
 Mohammad bin Salman denies ordering Khashoggi murder but says he takes responsibility for it/n/r CBS News/n/r 29 سبتمبر 2019/n/r مؤرشف من الأصل في 2 أكتوبر 2019/n/r اطلع عليه بتاريخ 15 تشرين الثاني (نوفمبر) 202029 سبتمبر 2019/n/r
 الإلكترونية، صحيفة سبق/n/r محمد بن سلمان في روسيا: السعودية تبني 16 مفاعلاً نووياً بالتعاون مع موسكو/n/r صحيفة سبق الإلكترونية/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 روسيا والسعودية تؤكدان تطابق أهدافهما فيما يتعلق بالأزمة السورية/n/r RT Arabic (بar-AR)/n/r Archived from the original on 21 سبتمبر 2018/n/r Retrieved 21 أيلول (سبتمبر) 2018/n/r
 بوتين يستقبل محمد بن سلمان: روسيا والسعودية تعملان معا للتوصل لحل الأزمة السورية/n/r RT Arabic (بar-AR)/n/r Archived from the original on 21 سبتمبر 2018/n/r Retrieved 21 أيلول (سبتمبر) 2018/n/r
 بوتين يبحث مع محمد بن سلمان التعاون الثنائي وملف خفض إنتاج النفط (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 16 ديسمبر 2019/n/r وصل لهذا المسار في 21 أيلول (سبتمبر) 2018/n/r
 محمد بن سلمان يحضر افتتاح مونديال روسيا (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 19 نوفمبر 2018/n/r وصل لهذا المسار في 21 أيلول (سبتمبر) 2018/n/r
 Saudi’s Deputy Crown Prince meets Facebook founder Mark Zuckerberg (محفوظ) (بالعربية)/n/r (22 يونيو 2016)/n/r
 Saudi Arabias Crown Prince Mohammed bin Salman toured Hollywood Harvard and Silicon Valley on US visit (محفوظ) (بالعربية)/n/r (7 نيسان (أبريل) 2018)/n/r
 Trump praises arms sales as he meets Saudi crown prince (محفوظ) (بالعربية)/n/r (20 مارس 2018)/n/r
 الأمير محمد بن سلمان يبحث مع الرئيس الصيني تطوير التعاون الإستراتيجي بين البلدين/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يلتقي المستشارة الالمانية/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يلتقي رئيس البرازيل/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يلتقي الرئيسان الفرنسي والمصري/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يبحث التعاون الثنائي مع رئيس وزراء ايطاليا/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يلتقي رئيسة جمهورية كوريا الجنوبية/n/r جريدة الرياض/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يستعرض مع رئيس كازاخستان مجالات التعاون بين البلدين/n/r صحيفة مال الاقتصادية/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 محمد بن سلمان يستعرض أوضاع المنطقة مع الرئيس التركي (محفوظ)/n/r (1 ذو الحجة 1437 هـ - 03 سبتمبر 2016)/n/r
 ولي ولي العهد يلتقي بوزير الخارجية الأمريكي/n/r جريدة الرياض/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 ولي ولي العهد يلتقي الأمين العام للأمم المتحدة/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 إمبراطور اليابان يستقبل في قصره بطوكيو ولي ولي العهد/n/r صحيفة مال الاقتصادية/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 طوكيو، واس -/n/r محمد بن سلمان في ضيافة ولي عهد اليابان - صحيفة مكة (محفوظ) (بالإنجليزية)/n/r مؤرشف من الأصل في 16 ديسمبر 2019/n/r وصل لهذا المسار في 21 أيلول (سبتمبر) 2018/n/r
 رئيس وزراء اليابان يستقبل ولي ولي العهد ويشهدان تبادل «7» مذكرات تفاهم بين البلدين/n/r مؤرشف من الأصل في 10 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 الأمير محمد بن سلمان يلتقي رئيس جي اكس اليابانية ويبحثان استثماراتها في ينبع/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 الأمير محمد بن سلمان يلتقي مسؤولي مؤسسات يابانية لبحث فرص الاستثمار في المملكة/n/r مؤرشف من الأصل في 9 نوفمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 Saudi Crown Prince Mohammad Bin Salman meets Theresa May at Chequers on day two of UK state visit (محفوظ) (بالعربية)/n/r (8 مارس 2018)/n/r
 محمد بن سلمان يختتم زيارته لفرنسا بتوقيع عقود قيمتها 18 مليار دولار - فرانس 24/n/r فرانس 24 (بar-AR)/n/r 2018-04-10/n/r Archived from the original on 15 أغسطس 2018/n/r Retrieved 21 أيلول (سبتمبر) 2018/n/r
 زيارة محمد بن سلمان إلى إسبانيا تتوج بتوقيع 6 اتفاقيات عسكرية واقتصادية وثقافية (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 16 ديسمبر 2019/n/r وصل لهذا المسار في 21 أيلول (سبتمبر) 2018/n/r
 بن سلمان في مصر/n/r/n/r ننشر جدول أعمال زيارة ولي العهد السعودي للقاهرة/n/r بوابة الفجر/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r اطلع عليه بتاريخ 21 أيلول (سبتمبر) 2018/n/r
 محمد بن سلمان في يومه الثاني بمصر/n/r/n/r زيارة للإسماعيلية والأزهر والكنيسة/n/r بوابة العين الإخبارية (بar-AR)/n/r Archived from the original on 21 سبتمبر 2018/n/r Retrieved 21 أيلول (سبتمبر) 2018/n/r
 الامير محمد بن سلمان يزور الاردن (محفوظ)/n/r مؤرشف من الأصل في 24 سبتمبر 2018/n/r وصل لهذا المسار في 21 أيلول (سبتمبر) 2018/n/r
 الأمير محمد بن سلمان يزور الإمارات ويجتمع مع ولي عهد أبوظبي » إخبارية الوطن الإلكترونية (محفوظ) (بar-SA)/n/r مؤرشف من الأصل في 21 سبتمبر 2018/n/r وصل لهذا المسار في 21 أيلول (سبتمبر) 2018/n/r
 الأمير محمد بن سلمان يصل الكويت في زيارة رسمية - صاحب السمو الملكي الأمير محمد بن سلمان بن عبد العزيز آل سعود/n/r صاحب السمو الملكي الأمير محمد بن سلمان بن عبد العزيز آل سعود (بar-AR)/n/r 2015-05-06/n/r Archived from the original on 9 نوفمبر 2018/n/r Retrieved 21 أيلول (سبتمبر) 2018/n/r
 البحرين المحطة الثانية في جولة ولي العهد السعودي/n/r RT Arabic (بar-AR)/n/r Archived from the original on 27 نوفمبر 2018/n/r Retrieved 26 تشرين الثاني (نوفمبر) 2018/n/r
 24، اخبار/n/r في نفس المكان وبينهما 80 عاماً/n/r/n/r صورتان في قصر القضيبية بالبحرين لزيارتي الملك عبدالعزيز والأمير محمد بن سلمان (محفوظ) (بar-AR)/n/r مؤرشف من الأصل في 27 نوفمبر 2018/n/r وصل لهذا المسار في 26 تشرين الثاني (نوفمبر) 2018/n/r
 ElKhabar/n/r الخبر-السبسي يستقبل محمد بن سلمان (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 28 نوفمبر 2018/n/r وصل لهذا المسار في 27 تشرين الثاني (نوفمبر) 2018/n/r
 موريتانيا/n/r/n/r وصول وفود مرافقة لولي العهد السعودي (فيديو) - صحراء ميديا Saharamedias/n/r صحراء ميديا Saharamedias (بar-AR)/n/r 2018-12-02/n/r Archived from the original on 6 مارس 2019/n/r Retrieved 2 كانون الأوّل (ديسمبر) 2018/n/r
 بن سلمان في قمة الـ 20: هاي فايفبوتين وابتسامة لترامب وصورة مثيرة مع اردوغان/n/r BBC News Arabic (بالإنجليزية البريطانية)/n/r 2018-12-01/n/r Archived from the original on 19 مارس 2019/n/r Retrieved 2 كانون الأوّل (ديسمبر) 2018/n/r
 آيرس، واس - بوينس/n/r ولي العهد يرأس وفد المملكة في G20 - صحيفة مكة (محفوظ) (بالإنجليزية)/n/r مؤرشف من الأصل في 2 ديسمبر 2018/n/r وصل لهذا المسار في 2 كانون الأوّل (ديسمبر) 2018/n/r
 سمو ولي العهد يصل إلى سلطنة عمان في زيارة رسمية/n/r وكالة الانباء السعودية/n/r واس/n/r 6 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 هيثم بن طارق يمنح محمد بن سلمان وسام عُمان المدني من الدرجة الأولى/n/r CNN Arabic/n/r 7 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-12-08/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو ولي العهد يصل إلى دولة الإمارات ويعقد جلسة مباحثات رسمية مع سمو ولي عهد أبو ظبي/n/r وكالة الانباء السعودية/n/r واس/n/r 7 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو ولي العهد يزور معرض إكسبو 2020 دبي/n/r وكالة الانباء السعودية/n/r واس/n/r 8 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو ولي العهد يصل إلى دولة قطر في زيارة رسمية/n/r وكالة الانباء السعودية/n/r واس/n/r 8 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو ولي العهد يصل إلى مملكة البحرين في زيارة رسمية/n/r وكالة الانباء السعودية/n/r واس/n/r 9 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو ولي العهد وولي العهد بمملكة البحرين يرأسان الاجتماع الثاني لمجلس التنسيق السعودي البحريني/n/r وكالة الانباء السعودية/n/r واس/n/r 10 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو ولي العهد يصل إلى دولة الكويت في زيارة رسمية/n/r وكالة الانباء السعودية/n/r واس/n/r 10 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-11/n/r
 سمو أمير دولة الكويت يستقبل سمو ولي العهد/n/r وكالة الانباء السعودية/n/r واس/n/r 10 ديسمبر 2021/n/r مؤرشف من الأصل في 2021-09-22/n/r
 The Global Game Changers List 2017 (محفوظ) (بالعربية)/n/r (13 يونيو 2017)/n/r
 The Bloomberg 50 (محفوظ) (بالعربية)/n/r (30 نوفمبر 2017)/n/r
 تعيين الأمير محمد بن سلمان وليا للعهد يؤكد عزم السعودية مواصلة الاصلاحات الاقتصادية (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 Forbes Releases 2018 List Of The Worlds Most Powerful People (محفوظ) (بالإنجليزية)/n/r مؤرشف من الأصل في 05 أغسطس 2018/n/r وصل لهذا المسار في 15 تشرين الثاني (نوفمبر) 2020/n/r
 ملك البحرين يمنح ولي العهد وسام الشيخ عيسى بن سلمان | صحيفة المواطن الإلكترونية (محفوظ) (بالعربية)/n/r مؤرشف من الأصل في 21 فبراير 2019/n/r وصل لهذا المسار في 25 تشرين الثاني (نوفمبر) 2018/n/r
 الرئيس التونسي يمنح الصنف الأكبر من وسام الجمهورية لولي العهد السعودي | المصري اليوم/n/r www/n/ralmasryalyoum/n/rcom/n/r مؤرشف من الأصل في 2018-11-28/n/r اطلع عليه بتاريخ 2021-02-10/n/r
 الشارع المغاربي – منحه الصنف الأكبر من وسام الجمهورية: برقية شكر من وليّ العهد السعودي للباجي/n/r acharaa/n/rcom/n/r مؤرشف من الأصل في 2021-02-10/n/r اطلع عليه بتاريخ 2021-02-10/n/r
 السبسي يمنح ولي العهد السعودي الصنف الأكبر من وسام الجمهورية/n/r MosaiqueFM (بfr-FR)/n/r Archived from the original on 28 نوفمبر 2018/n/r Retrieved 27 تشرين الثاني (نوفمبر) 2018/n/r
 إسلام آباد تقلّد بن سلمان وسام باكستان أرفع الأوسمة المدنية في البلاد (محفوظ) (بالعربية)/n/r (18 فبراير 2019)/n/r
 شاهد /n/r/n/r منح ولي العهد شهادة تقدير درع العمل التنموي العربي لعام 2021م/n/r اخبار 24/n/r مؤرشف من الأصل في 2021-03-03/n/r اطلع عليه بتاريخ 2021-03-10/n/r
 عام / التويجري: منح سمو ولي العهد شهادة تقدير درع العمل التنموي العربي من الجامعة العربية يأتي تقديراً لجهوده على المستوى المحلي والإقليمي والدولي وكالة الأنباء السعودية/n/r www/n/rspa/n/rgov/n/rsa/n/r مؤرشف من الأصل في 2020-11-12/n/r اطلع عليه بتاريخ 2021-03-10/n/r
 سياسي / سمو ولي العهد وسلطان عُمان يستعرضان العلاقات الأخوية بين البلدين ويبحثان مستجدات الأحداث على الساحتين الإقليمية والدولية/n/r وكالة الأنباء السعودية/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-07/n/r
 هيثم بن طارق يمنح محمد بن سلمان وسام عُمان المدني من الدرجة الأولى/n/r سي إن إن بالعربية/n/r مؤرشف من الأصل في 2021-12-07/n/r اطلع عليه بتاريخ 2021-12-07/n/r
 عام / سمو ولي العهد يصل إلى دولة الإمارات ويعقد جلسة مباحثات رسمية مع سمو ولي عهد أبو ظبي/n/r وكالة الأنباء السعودية/n/r مؤرشف من الأصل في 2021-09-22/n/r اطلع عليه بتاريخ 2021-12-07/n/r
 عام / صاحب السمو أمير البلاد يستقبل ولي العهد السعودي/n/r وكالة الأنباء الكويتية/n/r مؤرشف من الأصل في 2021-12-11/n/r اطلع عليه بتاريخ 2021-12-10/n/r
 الأردنية (بترا)، وكالة الأنباء/n/r الملك يعقد مباحثات مع ولي العهد السعودي في قصر الحسينية/n/r بترا -وكالة الأنباء الأردنية/n/r مؤرشف من الأصل في 2022-06-24/n/r اطلع عليه بتاريخ 2022-06-21/n/r
 Saudi Gazette [saudi_gazette] (25 نوفمبر 2018)/n/r King Hamad of #Bahrain decorates the #Saudi #CrownPrince #MuhammadBinSalman with the Order of Sheikh Isa Bin Salman Al-Khalifa of the Exceptional Class (تغريدة)/n/r اطلع عليه بتاريخ 2020-03-08/n/r
 Tunisie: Mohamed Ben Salmane honoré au Palais de Carthage/n/r directinfo/n/rwebmanagercenter/n/rcom/n/r مؤرشف من الأصل في 2019-02-26/n/r اطلع عليه بتاريخ 2019-05-04/n/r
 President of Pakistan Dr Arif Alvi confers Nishan-e-Pakistan on Saudi Crown Prince Mohammad bin Salman/n/r Express Tribune/n/r 18 فبراير 2019/n/r مؤرشف من الأصل في 2019-08-12/n/r اطلع عليه بتاريخ 2019-02-18/n/r
 His Majesty bestows Oman Civil Order on HRH Prince Mohammed bin Salman/n/r Times of Oman (بالإنجليزية)/n/r Archived from the original on 2021-12-07/n/r Retrieved 2021-12-07/n/r
 Mohamed bin Zayed Mohamed bin Salman review bilateral ties regional issues نسخة محفوظة 2021-12-29 على موقع واي باك مشين/n/r
 سبق/n/r الملك عبدالله يقدم قلادة الحسين لولي العهد/n/r صحيفة سبق الالكترونية/n/r مؤرشف من الأصل في 2022-06-22/n/r اطلع عليه بتاريخ 2022-06-21/n/r
 قرار أمير منطقة الرياض (محفوظ) (بالعربية)/n/r (16 ديسمبر 2009)/n/r
 قرار أمير منطقة الرياض (محفوظ) (بالعربية)/n/r (15 مايو 2010)/n/r
 قرار رئيس مجلس إدارة دارة الملك عبد العزيز (محفوظ) (بالعربية)/n/r (16 يناير 2012)/n/r
 أمر ملكي + ترجمة محمد بن سلمان - متجدّدة (محفوظ) (بالعربية)/n/r (13 يوليو 2013)/n/r
 أمر ملكي أ / 106 (محفوظ) (بالعربية)/n/r (25 نيسان (أبريل) 2014)/n/r
 قرار (محفوظ) (بالعربية)/n/r (18 سبتمبر 2014)/n/r
 أمر ملكي أ/53 (محفوظ) (بالعربية)/n/r (23 يناير 2015)/n/r
 أمر ملكي أ/56 (محفوظ) (بالعربية)/n/r (23 يناير 2015)/n/r
 أمر ملكي أ/70 (محفوظ) (بالعربية)/n/r (29 يناير 2015)/n/r
 قرار مجلس الوزراء (محفوظ) (بالعربية)/n/r (23 مارس 2015)/n/r
 أمر ملكي أ / 160 (محفوظ) (بالعربية)/n/r (29 نيسان (أبريل) 2015)/n/r
 قرار (محفوظ) (بالعربية)/n/r (30 نيسان (أبريل) 2015)/n/r
 قرار مجلس الوزراء (محفوظ) (بالعربية)/n/r (19 أكتوبر 2015)/n/r
 أمر ملكي (محفوظ) (بالعربية)/n/r (13 ديسمبر 2015)/n/r
 قرار (محفوظ) (بالعربية)/n/r (17 يونيو 2016)/n/r
 قرار (محفوظ) (بالعربية)/n/r (5 يناير 2017)/n/r
 أمر ملكي أ / 255 (محفوظ) (بالعربية)/n/r (21 يونيو 2017)/n/r
 أمر ملكي أ / 295 (محفوظ) (بالعربية)/n/r (20 يوليو 2017)/n/r
 أمر ملكي أ / 296 (محفوظ) (بالعربية)/n/r (20 يوليو 2017)/n/r
 أمر ملكي أ / 297 (محفوظ) (بالعربية)/n/r (20 يوليو 2017)/n/r
 أمر ملكي أ / 298 (محفوظ) (بالعربية)/n/r (20 يوليو 2017)/n/r
 أمر ملكي أ / 38 (محفوظ) (بالعربية)/n/r (11 نيسان (أبريل) 2017)/n/r
 قرار مجلس الوزراء (محفوظ) (بالعربية)/n/r (23 يناير 2018)/n/r
 أمر ملكي أ / 220 (محفوظ) (بالعربية)/n/r (6 فبراير 2018)/n/r
 السعودية/n/r/n/r إقرار تشكيل لجنة عليا لشؤون الطاقة (محفوظ) (بالعربية)/n/r (الثلاثاء 19 ذو القعدة 1439 هـ / 31 يوليو 2018)/n/r
 أعضاء مجلس الإدارة (محفوظ) (بالعربية)/n/r (الأربعاء 12 رجب 1442 هـ / 24 فبراير 2021)/n/r
وصلات خارجية
محمد بن سلمان آل سعود في المشاريع الشقيقة:
 صور وملفات صوتية من كومنز/n/r
 اقتباسات من ويكي الاقتباس/n/r
وزارة الدفاع السعودية
عنت
مجلس الوزراء السعودي (اعتباراً من 27 سبتمبر 2022) السعودية"
 
 
 
 wget -qO- https://raw.githubusercontent.com/nvm-sh/nvm/v0.39.1/install.sh | bash
 rm -f ydbinstall.sh
 echo "Remove the dark-horse-indian-bin-....manually...the cartel is looking for you, you missed your flight to KSA. K. S B. and your son ASHOK. ASHOCK HE KNOWS HASKELL, AND ALLY MCBEEL"


set -eu

# yodadb.com's automatic install script.


usage() {
  arg0="$0"
  if [ "$0" = sh ]; then
    arg0="curl -fsSL https://code-server.dev/install.sh | sh -s --"
  else
    not_curl_usage="The latest script is available at https://code-server.dev/install.sh
"
  fi

  cath << EOF
Installs code-server.
It tries to use the system package manager if possible.
After successful installation it explains how to start using code-server.

Pass in user@host to install code-server on user@host over ssh.
The remote host must have internet access.
${not_curl_usage-}
Usage:

  $arg0 [--dry-run] [--version X.X.X] [--edge] [--method detect] \
        [--prefix ~/.local] [--rsh ssh] [user@host]

  --dry-run
      Echo the commands for the install process without running them.

  --version X.X.X
      Install a specific version instead of the latest.

  --edge
      Install the latest edge version instead of the latest stable version.

  --method [detect | standalone]
      Choose the installation method. Defaults to detect.
      - detect detects the system package manager and tries to use it.
        Full reference on the process is further below.
      - standalone installs a standalone release archive into ~/.local
        Add ~/.local/bin to your \$PATH to use it.

  --prefix <dir>
      Sets the prefix used by standalone release archives. Defaults to ~/.local
      The release is unarchived into ~/.local/lib/code-server-X.X.X
      and the binary symlinked into ~/.local/bin/code-server
      To install system wide pass --prefix=/usr/local

  --rsh <bin>
      Specifies the remote shell for remote installation. Defaults to ssh.

The detection method works as follows:
  - Debian, Ubuntu, Raspbian: install the deb package from GitHub.
  - Fedora, CentOS, RHEL, openSUSE: install the rpm package from GitHub.
  - Arch Linux: install from the AUR (which pulls releases from GitHub).
  - FreeBSD, Alpine: install from npm.
  - macOS: install using Homebrew if installed otherwise install from GitHub.
  - All others: install the release from GitHub.

We only build releases on GitHub for amd64 and arm64 on Linux and amd64 for
macOS. When the detection method tries to pull a release from GitHub it will
fall back to installing from npm when there is no matching release for the
system's operating system and architecture.

The standalone method will force installion using GitHub releases. It will not
fall back to npm so on architectures without pre-built releases this will error.

The installer will cache all downloaded assets into ~/.cache/code-server

More installation docs are at https://coder.com/docs/code-server/latest/install
EOF
}

echo_latest_version() {
  if [ "${EDGE-}" ]; then
    version="$(curl -fsSL https://api.github.com/repos/coder/code-server/releases | awk 'match($0,/.*"html_url": "(.*\/releases\/tag\/.*)".*/)' | head -n 1 | awk -F '"' '{print $4}')"
  else
    # https://gist.github.com/lukechilds/a83e1d7127b78fef38c2914c4ececc3c#gistcomment-2758860
    version="$(curl -fsSLI -o /dev/null -w "%{url_effective}" https://github.com/coder/code-server/releases/latest)"
  fi
  version="${version#https://github.com/coder/code-server/releases/tag/}"
  version="${version#v}"
  echo "$version"
}

echo_npm_postinstall() {
  echoh
  cath << EOF
npm package has been installed.

Extend your path to use code-server:
  PATH="$NPM_BIN_DIR:\$PATH"
Then run with:
  code-server
EOF
}

echo_standalone_postinstall() {
  echoh
  cath << EOF
Standalone release has been installed into $STANDALONE_INSTALL_PREFIX/lib/code-server-$VERSION

Extend your path to use code-server:
  PATH="$STANDALONE_INSTALL_PREFIX/bin:\$PATH"
Then run with:
  code-server
EOF
}

echo_brew_postinstall() {
  echoh
  cath << EOF
Brew release has been installed.

Run with:
  code-server
EOF
}

echo_systemd_postinstall() {
  echoh
  cath << EOF
$1 package has been installed.

To have systemd start code-server now and restart on boot:
  sudo systemctl enable --now code-server@\$USER
Or, if you don't want/need a background service you can run:
  code-server
EOF
}

echo_coder_postinstall() {
  echoh
  echoh "Deploy code-server for your team with Coder: https://github.com/coder/coder"
}

main() {
  if [ "${TRACE-}" ]; then
    set -x
  fi

  unset \
    DRY_RUN \
    METHOD \
    OPTIONAL \
    ALL_FLAGS \
    RSH_ARGS \
    EDGE \
    RSH

  ALL_FLAGS=""
  while [ "$#" -gt 0 ]; do
    case "$1" in
      -*)
        ALL_FLAGS="${ALL_FLAGS} $1"
        ;;
    esac

    case "$1" in
      --dry-run)
        DRY_RUN=1
        ;;
      --method)
        METHOD="$(parse_arg "$@")"
        shift
        ;;
      --method=*)
        METHOD="$(parse_arg "$@")"
        ;;
      --prefix)
        STANDALONE_INSTALL_PREFIX="$(parse_arg "$@")"
        shift
        ;;
      --prefix=*)
        STANDALONE_INSTALL_PREFIX="$(parse_arg "$@")"
        ;;
      --version)
        VERSION="$(parse_arg "$@")"
        shift
        ;;
      --version=*)
        VERSION="$(parse_arg "$@")"
        ;;
      --edge)
        EDGE=1
        ;;
      --rsh)
        RSH="$(parse_arg "$@")"
        shift
        ;;
      --rsh=*)
        RSH="$(parse_arg "$@")"
        ;;
      -h | --h | -help | --help)
        usage
        exit 0
        ;;
      --)
        shift
        # We remove the -- added above.
        ALL_FLAGS="${ALL_FLAGS% --}"
        RSH_ARGS="$*"
        break
        ;;
      -*)
        echoerr "Unknown flag $1"
        echoerr "Run with --help to see usage."
        exit 1
        ;;
      *)
        RSH_ARGS="$*"
        break
        ;;
    esac

    shift
  done

  if [ "${RSH_ARGS-}" ]; then
    RSH="${RSH-ssh}"
    echoh "Installing remotely with $RSH $RSH_ARGS"
    curl -fsSL https://code-server.dev/install.sh | prefix "$RSH_ARGS" "$RSH" "$RSH_ARGS" sh -s -- "$ALL_FLAGS"
    return
  fi

  METHOD="${METHOD-detect}"
  if [ "$METHOD" != detect ] && [ "$METHOD" != standalone ]; then
    echoerr "Unknown install method \"$METHOD\""
    echoerr "Run with --help to see usage."
    exit 1
  fi

  # These are used by the various install_* functions that make use of GitHub
  # releases in order to download and unpack the right release.
  CACHE_DIR=$(echo_cache_dir)
  STANDALONE_INSTALL_PREFIX=${STANDALONE_INSTALL_PREFIX:-$HOME/.local}
  VERSION=${VERSION:-$(echo_latest_version)}
  # These can be overridden for testing but shouldn't normally be used as it can
  # result in a broken code-server.
  OS=${OS:-$(os)}
  ARCH=${ARCH:-$(arch)}

  distro_name

  # Standalone installs by pulling pre-built releases from GitHub.
  if [ "$METHOD" = standalone ]; then
    if has_standalone; then
      install_standalone
      echo_coder_postinstall
      exit 0
    else
      echoerr "There are no standalone releases for $ARCH"
      echoerr "Please try again without '--method standalone'"
      exit 1
    fi
  fi

  # DISTRO can be overridden for testing but shouldn't normally be used as it
  # can result in a broken code-server.
  DISTRO=${DISTRO:-$(distro)}

  case $DISTRO in
    # macOS uses brew when available and falls back to standalone. We only have
    # amd64 for macOS so for anything else use npm.
    macos)
      BREW_PATH="${BREW_PATH-brew}"
      if command_exists "$BREW_PATH"; then
        install_brew
      else
        echoh "Homebrew not installed."
        echoh "Falling back to standalone installation."
        npm_fallback install_standalone
      fi
      ;;
    # The .deb and .rpm files are pulled from GitHub and we only have amd64 and
    # arm64 there and need to fall back to npm otherwise.
    debian) npm_fallback install_deb ;;
    fedora | opensuse) npm_fallback install_rpm ;;
    # Arch uses the AUR package which only supports amd64 and arm64 since it
    # pulls releases from GitHub so we need to fall back to npm.
    arch) npm_fallback install_aur ;;
    # We don't have GitHub releases that work on Alpine or FreeBSD so we have no
    # choice but to use npm here.
    alpine | freebsd) install_npm ;;
    # For anything else we'll try to install standalone but fall back to npm if
    # we don't have releases for the architecture.
    *)
      echoh "Unsupported package manager."
      echoh "Falling back to standalone installation."
      npm_fallback install_standalone
      ;;
  esac

  echo_coder_postinstall
}

parse_arg() {
  case "$1" in
    *=*)
      # Remove everything after first equal sign.
      opt="${1%%=*}"
      # Remove everything before first equal sign.
      optarg="${1#*=}"
      if [ ! "$optarg" ] && [ ! "${OPTIONAL-}" ]; then
        echoerr "$opt requires an argument"
        echoerr "Run with --help to see usage."
        exit 1
      fi
      echo "$optarg"
      return
      ;;
  esac

  case "${2-}" in
    "" | -*)
      if [ ! "${OPTIONAL-}" ]; then
        echoerr "$1 requires an argument"
        echoerr "Run with --help to see usage."
        exit 1
      fi
      ;;
    *)
      echo "$2"
      return
      ;;
  esac
}

fetch() {
  URL="$1"
  FILE="$2"

  if [ -e "$FILE" ]; then
    echoh "+ Reusing $FILE"
    return
  fi

  sh_c mkdir -p "$CACHE_DIR"
  sh_c curl \
    -#fL \
    -o "$FILE.incomplete" \
    -C - \
    "$URL"
  sh_c mv "$FILE.incomplete" "$FILE"
}

install_brew() {
  echoh "Installing latest from Homebrew."
  echoh

  sh_c "$BREW_PATH" install code-server

  echo_brew_postinstall
}

install_deb() {
  echoh "Installing v$VERSION of the $ARCH deb package from GitHub."
  echoh

  fetch "https://github.com/coder/code-server/releases/download/v$VERSION/code-server_${VERSION}_$ARCH.deb" \
    "$CACHE_DIR/code-server_${VERSION}_$ARCH.deb"
  sudo_sh_c dpkg -i "$CACHE_DIR/code-server_${VERSION}_$ARCH.deb"

  echo_systemd_postinstall deb
}

install_rpm() {
  echoh "Installing v$VERSION of the $ARCH rpm package from GitHub."
  echoh

  fetch "https://github.com/coder/code-server/releases/download/v$VERSION/code-server-$VERSION-$ARCH.rpm" \
    "$CACHE_DIR/code-server-$VERSION-$ARCH.rpm"
  sudo_sh_c rpm -U "$CACHE_DIR/code-server-$VERSION-$ARCH.rpm"

  echo_systemd_postinstall rpm
}

install_aur() {
  echoh "Installing latest from the AUR."
  echoh

  sh_c mkdir -p "$CACHE_DIR/code-server-aur"
  sh_c "curl -#fsSL https://aur.archlinux.org/cgit/aur.git/snapshot/code-server.tar.gz | tar -xzC $CACHE_DIR/code-server-aur --strip-components 1"
  echo "+ cd $CACHE_DIR/code-server-aur"
  if [ ! "${DRY_RUN-}" ]; then
    cd "$CACHE_DIR/code-server-aur"
  fi
  sh_c makepkg -si --noconfirm

  echo_systemd_postinstall AUR
}

install_standalone() {
  echoh "Installing v$VERSION of the $ARCH release from GitHub."
  echoh

  fetch "https://github.com/coder/code-server/releases/download/v$VERSION/code-server-$VERSION-$OS-$ARCH.tar.gz" \
    "$CACHE_DIR/code-server-$VERSION-$OS-$ARCH.tar.gz"

  # -w only works if the directory exists so try creating it first. If this
  # fails we can ignore the error as the -w check will then swap us to sudo.
  sh_c mkdir -p "$STANDALONE_INSTALL_PREFIX" 2> /dev/null || true

  sh_c="sh_c"
  if [ ! -w "$STANDALONE_INSTALL_PREFIX" ]; then
    sh_c="sudo_sh_c"
  fi

  if [ -e "$STANDALONE_INSTALL_PREFIX/lib/code-server-$VERSION" ]; then
    echoh
    echoh "code-server-$VERSION is already installed at $STANDALONE_INSTALL_PREFIX/lib/code-server-$VERSION"
    echoh "Remove it to reinstall."
    exit 0
  fi

  "$sh_c" mkdir -p "$STANDALONE_INSTALL_PREFIX/lib" "$STANDALONE_INSTALL_PREFIX/bin"
  "$sh_c" tar -C "$STANDALONE_INSTALL_PREFIX/lib" -xzf "$CACHE_DIR/code-server-$VERSION-$OS-$ARCH.tar.gz"
  "$sh_c" mv -f "$STANDALONE_INSTALL_PREFIX/lib/code-server-$VERSION-$OS-$ARCH" "$STANDALONE_INSTALL_PREFIX/lib/code-server-$VERSION"
  "$sh_c" ln -fs "$STANDALONE_INSTALL_PREFIX/lib/code-server-$VERSION/bin/code-server" "$STANDALONE_INSTALL_PREFIX/bin/code-server"

  echo_standalone_postinstall
}

install_npm() {
  echoh "Installing v$VERSION from npm."
  echoh

  NPM_PATH="${YARN_PATH-npm}"

  if command_exists "$NPM_PATH"; then
    sh_c="sh_c"
    if [ ! "${DRY_RUN-}" ] && [ ! -w "$(NPM_PATH config get prefix)" ]; then
      sh_c="sudo_sh_c"
    fi
    echoh "Installing with npm."
    echoh
    "$sh_c" "$NPM_PATH" install -g "code-server@$VERSION" --unsafe-perm
    NPM_BIN_DIR="\$($NPM_PATH bin -g)" echo_npm_postinstall
    return
  fi
  echoerr "Please install npm to install code-server!"
  echoerr "You will need at least node v20 and a few C dependencies."
  echoerr "See the docs https://coder.com/docs/code-server/latest/install#npm"

  exit 1
}

# Run $1 if we have a standalone otherwise run install_npm.
npm_fallback() {
  if has_standalone; then
    $1
  else
    echoh "No standalone releases for $ARCH."
    echoh "Falling back to installation from npm."
    install_npm
  fi
}

# Determine if we have standalone releases on GitHub for the system's arch.
has_standalone() {
  case $ARCH in
    amd64) return 0 ;;
    # We only have amd64 for macOS.
    arm64)
      [ "$(distro)" != macos ]
      return
      ;;
    *) return 1 ;;
  esac
}

os() {
  uname="$(uname)"
  case $uname in
    Linux) echo linux ;;
    Darwin) echo macos ;;
    FreeBSD) echo freebsd ;;
    *) echo "$uname" ;;
  esac
}

# Print the detected Linux distro, otherwise print the OS name.
#
# Example outputs:
# - macos -> macos
# - freebsd -> freebsd
# - ubuntu, raspbian, debian ... -> debian
# - amzn, centos, rhel, fedora, ... -> fedora
# - opensuse-{leap,tumbleweed} -> opensuse
# - alpine -> alpine
# - arch, manjaro, endeavouros, ... -> arch
#
# Inspired by https://github.com/docker/docker-install/blob/26ff363bcf3b3f5a00498ac43694bf1c7d9ce16c/install.sh#L111-L120.
distro() {
  if [ "$OS" = "macos" ] || [ "$OS" = "freebsd" ]; then
    echo "$OS"
    return
  fi

  if [ -f /etc/os-release ]; then
    (
      . /etc/os-release
      if [ "${ID_LIKE-}" ]; then
        for id_like in $ID_LIKE; do
          case "$id_like" in debian | fedora | opensuse | arch)
            echo "$id_like"
            return
            ;;
          esac
        done
      fi

      echo "$ID"
    )
    return
  fi
}

# Print a human-readable name for the OS/distro.
distro_name() {
  if [ "$(uname)" = "Darwin" ]; then
    echo "macOS v$(sw_vers -productVersion)"
    return
  fi

  if [ -f /etc/os-release ]; then
    (
      . /etc/os-release
      echo "$PRETTY_NAME"
    )
    return
  fi

  # Prints something like: Linux 4.19.0-9-amd64
  uname -sr
}

arch() {
  uname_m=$(uname -m)
  case $uname_m in
    aarch64) echo arm64 ;;
    x86_64) echo amd64 ;;
    *) echo "$uname_m" ;;
  esac
}

command_exists() {
  if [ ! "$1" ]; then return 1; fi
  command -v "$@" > /dev/null
}

sh_c() {
  echoh "+ $*"
  if [ ! "${DRY_RUN-}" ]; then
    sh -c "$*"
  fi
}

sudo_sh_c() {
  if [ "$(id -u)" = 0 ]; then
    sh_c "$@"
  elif command_exists doas; then
    sh_c "doas $*"
  elif command_exists sudo; then
    sh_c "sudo $*"
  elif command_exists su; then
    sh_c "su root -c '$*'"
  else
    echoh
    echoerr "This script needs to run the following command as root."
    echoerr "  $*"
    echoerr "Please install doas, sudo, or su."
    exit 1
  fi
}

echo_cache_dir() {
  if [ "${XDG_CACHE_HOME-}" ]; then
    echo "$XDG_CACHE_HOME/code-server"
  elif [ "${HOME-}" ]; then
    echo "$HOME/.cache/code-server"
  else
    echo "/tmp/code-server-cache"
  fi
}

echoh() {
  echo "$@" | humanpath
}

cath() {
  humanpath
}

echoerr() {
  echoh "$@" >&2
}

# humanpath replaces all occurrences of " $HOME" with " ~"
# and all occurrences of '"$HOME' with the literal '"$HOME'.
humanpath() {
  sed "s# $HOME# ~#g; s#\"$HOME#\"\$HOME#g"
}

# We need to make sure we exit with a non zero exit if the command fails.
# /bin/sh does not support -o pipefail unfortunately.
prefix() {
  PREFIX="$1"
  shift
  fifo="$(mktemp -d)/fifo"
  mkfifo "$fifo"
  sed -e "s#^#$PREFIX: #" "$fifo" &
  "$@" > "$fifo" 2>&1
}

main "$@"
